export const baguaInfo = {
  '乾': { 自然: '天', 人体: '头', 动物: '马', 家人: '父亲', 声音: '金属声', 建筑: '京都', 八仙: '吕洞宾', 偏旁: '金字旁' },
  '兑': { 自然: '泽', 人体: '口', 动物: '羊', 家人: '少女', 声音: '说话吼叫声', 建筑: '井', 八仙: '张果老', 偏旁: '口字旁' },
  '离': { 自然: '火', 人体: '眼', 动物: '凤', 家人: '中女', 声音: '燃烧声', 建筑: '炉灶', 八仙: '汉钟离', 偏旁: '火字旁' },
  '震': { 自然: '雷', 人体: '足', 动物: '龙', 家人: '长男', 声音: '擂鼓声', 建筑: '门市', 八仙: '曹国舅', 偏旁: '木字旁' },
  '巽': { 自然: '风', 人体: '腿', 动物: '鸡', 家人: '长女', 声音: '风声', 建筑: '园艺', 八仙: '韩湘子', 偏旁: '草字头' },
  '坎': { 自然: '水', 人体: '耳', 动物: '鲤鱼', 家人: '中男', 声音: '水流声', 建筑: '厕所', 八仙: '铁拐李', 偏旁: '三点水' },
  '艮': { 自然: '山', 人体: '手', 动物: '狗', 家人: '少男', 声音: '山石声', 建筑: '门墙', 八仙: '蓝采和', 偏旁: '山字旁' },
  '坤': { 自然: '地', 人体: '腹', 动物: '牛', 家人: '母亲', 声音: '动土声', 建筑: '城市', 八仙: '仙姑', 偏旁: '土字旁' },
} 
