import { HexagramInfoType } from "@types"

/**
 * 卦象信息
 * no: 卦象编号
 * name: 卦象名称
 * qian: 卦象吉凶
 * original: 卦象原文
 * meaning: 传统解卦
 * description: 卦象解释
 * pinyin: 卦象拼音
 */
export const hexagramInfo: { [key: string]: HexagramInfoType } = {
  '111111': {
    no: 1,
    name: '上乾下乾 乾为天（乾卦）自强不息',
    qian: '上上卦',
    original: '乾。元，亨，利，贞。',
    meaning: `这个卦是同卦（下乾上乾）相叠。象征天，喻龙（德才的君子），又象征纯粹的阳和健，表明兴盛强健。乾卦是根据万物变通的道理，以“元、亨、利、贞”为卦辞，表示吉祥如意，教导人遵守天道的德行。

大象：天行刚健，自强不息。

运势：飞龙在天，名利双收之象，宜把握机会，争取成果。有地位擢升、名利双收之象，功名荣显得贵子。六亲和睦，凡事谦和为贵，可吉。

事业：大吉大利，万事如意，心想事成，自有天佑，春风得意，事业如日中天。但阳气已达顶点，盛极必衰，务须提高警惕，小心谨慎。力戒骄傲，冷静处世，心境平和，如是则能充分发挥才智，保证事业成功。

经商：十分顺利，有发展向上的大好机会。但切勿操之过急，宜冷静分析形势，把握时机，坚持商业道德，冷静对待中途出现的困难，定会有满意的结果。

求名：潜在能力尚未充分发挥，只要进一步努力，克服骄傲自满情绪，进业修德，以渊博学识和高尚品质，成君子之名。

婚恋：阳盛阴衰，但刚柔可相济，形成美满结果。女性温柔者更佳。

决策：可成就大的事业。坚持此卦的刚健、正直、公允的实质，修养德行，积累知识，坚定信念，自强不息，必能克服困难，消除灾难。

时运：临事刚健，自强不息。

财运：施比受有福，不利买而利卖。

家宅：积善有余庆；女子过刚宜慎重。

身体：保健有恒。

特性：积极，刚毅，努力，认真，有耐性，坚忍，正派，主动，慷慨，严律，重名誉。

家运：繁昌兴隆，须小心口舌之争。

疾病：病情恶化，宜细心调养，注意头、脑、骨髓等病变。

胎孕：有不安之兆，宜小心保养。

子女：儿女健康，幸福有为。

周转：虽不成问题，尚宜心平气和来处理。

买卖：小利可得，大则勿取，勿太张扬为吉。

等人：一定会来。

寻人：已远走高飞，不易找到，在西北方向。

失物：可望寻回。

外出：利于出行，结伴而行更佳。

考试：有望取得好成绩。

诉讼：宜据理力争。

求事：有贵人提拔，可发展，称心。

改行：占得此卦不宜改行。

开业：开业者需要耐心观望。`,
    description: `这个卦是同卦（下乾上乾）相叠。象征天，喻龙（德才的君子），又象征纯粹的阳和健，表明兴盛强健。乾卦是根据万物变通的道理，以“元、亨、利、贞”为卦辞，示吉祥如意，教导人遵守天道的德行。
    大吉大利。象征着刚健、正直、创造、领导。事业上会有所发展，但要注意谦虚谨慎。`,
    pinyin: 'qián'
  },
  '000000': {
    no: 2,
    name: '上坤下坤 坤为地（坤卦）厚德载物',
    qian: '上上卦',
    meaning: `这个卦是同卦（下坤上坤）相叠，阴性。象征地（与乾卦相反），顺从天，承载万物，伸展无穷无尽。坤卦以雌马为象征，表明地道生育抚养万物，而又依天顺时，性情温顺。它以“先迷后得”证明“坤”顺从“乾”，依随“乾”，才能把握正确方向，遵循正道，获取吉利。

大象：大地承载万物，以德服众，仁者无敌。

运势：诸事不宜急进，以静制动为宜。诸事不宜急进，退守以静制动者吉。坤者大地平静，任其他物所摧而不为所动者大利也。若醉心私欲，违背常理，则有无妄之灾。

事业：诸项事业可以成功，得到预想的结果，但开始出师不利，为困境所扰。切莫冒险急进，须小心谨言慎行，尤其不可单枪匹马，独断专行。取得朋友的关心和支持最为重要，在他人的合作下，共同完成事业。因此，应注重内心修养，积蓄养德，效法大地，容忍负重，宽厚大度，以直率、方正、含蓄为原则，不得贪功自傲，持之以恒，谋求事业的成功。

经商：机遇不很好，切莫冒险，以稳健为妥，遇到挫折，务必即时总结经验。注意储存货物，待价而沽，处处小心为是。

求名：比较顺利，具备基本条件，踏踏实实，埋头苦干，不追求身外之物，即可吉祥。

婚恋：阴盛。以柔克刚，女方柔顺，美好姻缘，白头到老。

决策：忠厚、温和，待人真诚，热心助人，因此也能得到他人的帮助，可往往因不提防小人而受到伤害，但无大碍。性格灵活，工作方法多样，可以左右逢源，得到赞许。

时运：为人厚道，声名远传。

财运：满载而归。

家宅：家庭安稳；婚嫁大吉。

身体：柔软运动。

家运：幸福平静之象。

疾病：病情严重，为腹、肠胃、肌肉等慢性病（腹疾、脾胃之疾、饮食停滞，从而食不化）。

胎孕：生贵子，女儿亦为福。

子女：儿女众多，和睦幸福也。

周转：须耐心去求，否则难成。

买卖：勿急，交易可成。

等人：不会来，须再待些时日。

寻人：此人为色情之事出走，于西南方附近之地也。

失物：难以寻回，大部分均不知下落。

外出：宜结伴而行。可去陌生的地方。

考试：希望不大。

诉讼：防房地产之争，宜和解，有始无终之兆。

求事：不称意亦不理想，另寻。

改行：改行不利，宜固守本份。

开业：开业者再观望，目前尚未筹备妥当，不宜。`,
    description: `这个卦是同卦（下坤上坤）相叠，阴性。象征地（与乾卦相反），顺从天。承载万物，伸展无穷无尽。坤卦以雌马为象征，表明地道生育抚养万物，而又依天顺时，性情温顺。它以“先迷后得”证明“坤”顺从“乾”，依随“乾”，才能把握正确方向，遵循正道，获取吉利。
    大地包容，坤顺承天。主静止、包容、顺从。事业需要耐心积累，切勿急躁。`,
    pinyin: 'kūn'
  },
  '010001': {
    no: 3,
    name: '上坎下震 水雷屯（屯卦）起始维艰',
    qian: '下下卦',
    meaning: `这个卦是异卦（下震上坎）相叠，震为雷，喻动；坎为雨，喻险。雷雨交加，险象丛生，环境恶劣。“屯”原指植物萌生大地，万物始生，充满艰难险阻，然而顺时应运，必欣欣向荣。

大象：屯者难也，万事欲进而不得进。

运势：身处困境，步步为营，有初难后解之意。逆势，多有困惑，但不可妄进，宜守不宜进。坚定意志，凡事不可为一己之利而执意强行，皆有不成损破之象。宜步步为营，排除困难，始可通达，有初难后解之象。

事业：起初多有不利，要知难而进，小心翼翼，勇往直前，灵活机动，可望获得大的成功，时机到来时一定要抓住，却也不得操之太急，且仍有困难，务必有他人相助，故平时应多施恩惠。

经商：创业初期步履艰难，多有挫折。坚定信念最重要，不要为表面现象所迷惑，应积极进取，行动果断，打开出路。若仍无法摆脱困境，则应退守保全，等待机会，再展宏图。

求名：积极争取，主动追求，可以成功。

婚恋：好事多磨，忠贞纯洁，大胆追求，能够成功，婚姻美满。

决策：初始困难，但若具有坚忍不拔的毅力和锲而不舍的奋斗精神，前途不可估量，但往往不为他人理解而陷于孤独苦闷，事业会因此处于困难状态，需要得到贤德之人的帮助才能摆脱。如能以乐观主义精神处世，能取得成就。

时运：宜守不宜进。

财运：创业维艰。

家宅：修缮住宅；初婚不和。

身体：保存元气。

家运：多波折，若能努力排除困难，可得通顺。

疾病：病在肠胃，足部或泌尿系统，不宜掉以轻心。

胎孕：不安，产母有虚惊，但可无虑。

子女：有辛苦，但以后可得安逸。

周转：困难重重，须用心忍耐奔波。

买卖：不利，交易有损。

等人：不会来。

寻人：出走者不知去向，难寻。东或北方去矣。

失物：难以寻回。

外出：慎重为好，有危险，宜改日动身。

考试：不理想。

诉讼：小事粘滞纠缠，大事反无大害，宜和解。

求事：不利。

改行：不宜。

开业：不宜，有困难亦难成也。`,
    description: `这个卦是异卦（下震上坎）相叠，震为雷，喻动；坎为雨，喻险。雷雨交加，险象丛生，环境恶劣。“屯”原指植物萌生大地。万物始生，充满艰难险阻，然而顺时应运，必欣欣向荣。
    起始维艰。象征着开始时的困难。需要耐心和毅力，度过初期的艰难时期。`,
    pinyin: 'zhūn'
  },
  '100010': {
    no: 4,
    name: '上艮下坎 山水蒙（蒙卦）启蒙奋发',
    qian: '中下卦',
    meaning: `这个卦是异卦（下坎上艮）相叠，艮是山的形象，喻止；坎是水的形象，喻险。卦形为山下有险，仍不停止前进，是为蒙昧，故称蒙卦。但因把握时机，行动切合时宜，因此，具有启蒙和通达的卦象。

大象：蒙者，昏而无所见也，故宜“启蒙”。

运势：初时迷惑不知方向，须忍耐待机而动，凡事多听取别人意见，则运可通。气运不发，多迷惑。初时不顺，须忍耐待机，渐可佳。切勿贸然行事或为人认保、作保，否则必有损失。凡事宜从上辈教诲，则运可通也。

事业：事业开始，混乱无序，危机四伏，以勇敢坚毅的行动可以扭转局面。然而必须接受严格教育，培养这种奋发图强的精神。务必脚踏实地，最忌好高骛远，否则会陷入孤立无援的境地。

经商：务必小心谨慎，不得急功近利，尤其应树立高尚的商业道德，以良好的信誉提高竞争力而取胜。

求名：必须接受良好的基础教育，陶冶情操。且动机纯正，可以达到目的。

婚恋：注意考察对方品德，不可以金钱为诱铒。夫妻需相互宽容、理解。

决策：有时会陷入迷惘困顿的境地，加上胆小、不果断，往往误事。如能接受长辈的教诲，甚至严酷的考验，抛弃疑惧的心理，等待适当时机，必然一帆风顺。

时运：蓄积德行，出而用世。

财运：矿山生意，果决则吉。

家宅：君子居吉；婚姻之始。

身体：驱去邪热，可保平安。

家运：初时辛苦，上下无法沟通，只要以诚相待，必有开运之时。

疾病：病情不明，反覆难治。为肠胃、腹水之疾及传染病。

胎孕：胎孕无碍。

子女：应注重子女教养，将来方得幸福之象。

周转：困难，防止上当受骗。

买卖：不利，有损失。

等人：可能走错路，会迟到。

寻人：受诱惑而出走，因本身蒙昧无知而受骗。在东北或北方，日前难寻。

失物：遍寻不获。似乎在大门下陷之处遗失，忘记带走，可试问人。

外出：等候有利时机再行动，等待期间应积极做准备。

考试：不理想。

诉讼：因外人引起事端，目下未明，有理讲不清。

求事：未能如愿，再等时机。

改行：改行不宜

开业：开业者不宜。再等一段时间，筹备好资金再做打算。`,
    description: `这个卦是异卦（下坎上艮）相叠，艮是山的形象，喻止；坎是水的形象，喻险。卦形为山下有险，仍不停止前进，是为蒙昧，故称蒙卦。但因把握时机，行动切合时宜，因此，具有启蒙和通达的卦象。
    匪我求童蒙。象征着蒙昧和启蒙。需要学习和教导，循序渐进。`,
    pinyin: 'méng'
  },
  '010111': {
    no: 5,
    name: '上坎下乾 水天需（需卦）守正待机',
    qian: '中上卦',
    meaning: `这个卦是异卦（下乾上坎）相叠，下卦是乾，刚健之意；上卦是坎，险陷之意。以刚逢险，宜稳健之妥，不可冒失行动，观时待变，所往一定成功。

大象：云登天上而未雨，不能急进，等待时机之象。

运势：智者必须待时而行，急进反见凶险。宜退守正道，不宜冒险前进，投机急取反而失利。须知贪小失大，智者必须待时也。

事业：关键在于审时度势，耐心等待，事成于安祥，切勿冒险，欲速不达。自己要充满自信，临危不惧，坚守中正，必可化险为夷。情况有利时，仍得居安思危。

经商：行动之初，情况困难，必须以极大的耐心，创造条件和机会，行事光明磊落，观时待变，实现愿望。事情接近成功时，更应小心谨慎，切莫功亏一篑。

求名：时机尚不成熟，应耐心等待。这时应坚定信念，不为闲言流语所动摇，努力丰富自己，再求助可靠的人便可成功。

婚恋：慎重，切不可草率行事，逐渐培养感情，以诚实、热情相待，会发生变故，仍可以有良好的结局。双方都应懂得以柔克刚的道理。

决策：前途光明，有雄心大志，且可实现。为此需要积蓄实力，等待时机，大器晚成。本人具有坚强的意志，冷静的头脑。前进途中会遇到困难和险阻，必须十分谨慎，坦然对待小人的中伤，在灾祸在面前能镇静自若。不轻举妄动，冷静选择方向。为人谦和、坦率，多有他人相助，促使事业成功。当时机成熟后，必然一帆风顺。

时运：时机尚未成熟，耐心等待。

财运：资本未集，无法开张。

家宅：平安是福。

身体：调节饮食，健康有望。

家运：初为多事之秋，须凭智慧耐心挽救颓势。

疾病：病情拖延，须留心治疗，为头、胸、肺、泌尿系统等病。

胎孕：临产之时才占卜，表示会有障碍。防克产母。

子女：得子迟。

周转：不能预期而得，有延滞。

买卖：有口舌不可成就，亦勿贪小而失大。

等人：迟到。

寻人：此出走之人因感情之事，在西北或北方。

失物：即时不能寻回，需经过一段时间将会出现。

外出：充分准备齐全后，可平安无事。

考试：要多用功。

诉讼：暂时未能了结，以和为贵。

求事：不宜急取，急亦不得，再等待，再寻求。

改行：不宜。

开业：不宜。`,
    description: `这个卦是异卦（下乾上坎）相叠，下卦是乾，刚健之意；上卦是坎，险陷之意。以刚逢险，宜稳健之妥，不可冒失行动，观时待变，所往一定成功。
    有孚光亨。象征着等待时机。需要耐心等待，时机成熟时方可行动。`,
    pinyin: 'xū'
  },
  '111010': {
    no: 6,
    name: '上乾下坎 天水讼（讼卦）慎争戒讼',
    qian: '中下卦',
    meaning: `这个卦是异卦（下坎上乾）相叠。同需卦相反，互为“综卦”。乾为刚健，坎为险陷。刚与险，健与险，彼此反对，定生争讼。争讼非善事，务必慎重戒惧。

大象：乾天升于上，坎水降于下，相背而行而起讼。

运势：事与愿违，凡事不顺，小人加害，宜防陷阱。百事闭塞不通，伤害频繁，受中伤而又易陷于奸计，不如意之运也。得饶人处且饶人，得过且过，莫再争讼，否则皆不利也。

事业：起初顺利，有利可图，继而受挫，务必警惕，慎之又慎，不得固执已见，极力避免介入诉讼纠纷的争执之中。与其这样，不如退而让人，求得化解，安于正理，可免除意外之灾。陷入争讼，即使获胜，最后还得失去，得不偿失。

经商：和气生财，吃亏是福，切勿追求不义之财。商业谈判应坚持公正、公平、互利的原则，尽量避免发生冲突。这样便会有好结果。

求名：不利。自己尚缺乏竞争实力，应坚守纯正，隐忍自励，自强自勉，切莫逞强。依靠有地位的人的帮助，及早渡过难关。

婚恋：虽不尽人意，倒也般配，彼此理解，未尝不可。双方应以温和的方式处理生活。

决策：争强好胜，不安于现状，为改变命运和超越他人而奋斗。头脑聪颖，反应敏捷，有贵人相助。但缺乏持之以恒的毅力，容易露出锋芒，得罪他人，带来诉讼之灾。宜承认现实，顺其自然，知足，适可而止。接受教训，引以为戒，可功成名就。

时运：功名受阻，不宜树敌。

财运：开始谨慎，终可获利。

家宅：君子必求淑女。

身体：预防胜于治疗。

家运：家庭内部不和，有口舌争端之害，并有散离之象。

疾病：病情严重，为腰、血液、泌尿系统、头部疾患。

胎孕：生产无惊阻，安也。

子女：父子之间存有歧见，无法沟通之象。子女生来劳碌，与父母缘薄，多辛劳忧苦也。

周转：不得要领，难成。

买卖：因处理不当，有冲突争端，常招损失，不利也。

等人：不会来。就算会来，双方必有争执事情发生。

寻人：此人因争执事由负气出走，并有生命危险，又寻找不易，尽量往西北与北方寻找。

失物：不会出现。

外出：途中多有变故，宜改日出行。

考试：不理想。

诉讼：两败俱伤，宜找中间人调解，久争无益。

求事：难成。

改行：不利。

开业：不宜。`,
    description: `这个卦是异卦（下坎上乾）相叠。同需卦相反，互为“综卦”。乾为刚健，坎为险陷。刚与险，健与险，彼此反对，定生争讼。争讼非善事，务必慎重戒惧。
    有孚窒惕。象征着争论和诉讼。需要谨慎处理人际关系，避免冲突。`,
    pinyin: 'sòng'
  },
  '000010': {
    no: 7,
    name: '上坤下坎 地水师（师卦）行险而顺',
    qian: '中上卦',
    meaning: `这个卦是异卦（下坎上坤）相叠。“师”指军队。坎为水、为险；坤为地、为顺，喻寓兵于农。兵凶战危，用兵乃圣人不得已而为之，但它可以顺利无阻碍地解决矛盾，因为顺乎形势，师出有名，故能化凶为吉。

大象：养兵聚众，出师攻伐之象，彼此有伤，难得安宁。

运势：困难重重，凡事以正规行事，忌独断独行、投机取巧，提防潜在敌人。事虽有不顺、但要引以为镜，记取教训。不要图私利而投机取巧。凡事应以正规而行，事物多变动，切忌独立而行。困难多端，靠自己努力，摒除一切困难为上策。

事业：阻力很大，困难很多，处于激烈的竞争状态，要与他人密切合作，谨小慎微，行为果断，切忌盲目妄动，适度即可，注意保全自己。机动灵活，严于律已。从容沉着对付一切，必能成功。

经商：已有一定的积蓄，可以从事大的营销活动，但必卷入激烈商战，以刚毅顽强的精神和高尚的商业道德，辅以灵活的方法，勿贪图小利，勿掉以轻心，加强与他人的沟通，必可摆脱困境，化险为夷。

求名：具备很好的条件，但须有正确的引导，务必严格要求自己，克服不利因素的干扰，经过扎实努力，必可名利双全。

婚恋：慎重、专注，否则会陷入“三角”纠纷。痴情追求可以达到目的。

决策：天资聪颖，性格灵活，具有坚强的意志，对事业执着追求，迎难而进。可成就大事业。喜竞争，善争辩，富有冒险精神，不免带来麻烦，务老成持重，不贪功，以中正为要。

时运：包容别人，修行待时。

财运：有财有库，善自珍惜。

家宅：旧亲联姻，可喜可贺。

身体：腹胀之症，调气无忧。

家运：外柔顺而内险恶，故家内常生不和，需慎重处理。行正道可化险为安。

疾病：病况严重，提防心脏或腹腔肿瘤等。

胎孕：喜中有忧。或有不安或不孕。

子女：大出息之象。

周转：无望，另觅别处。

买卖：有阻，不太顺意，寅午戌日交易可成。

等人：来者不善。

寻人：此人因家内失和而出走，速往北方或西南找，否则有危险。

失物：不会出现，即或寻回，也已损坏。

外出：“行险而顺”。虽有可能遇到麻烦，但结果一定十分顺利，可放心出行。

考试：很认真，但不理想，继续努力终有成就。

诉讼：宜进不宜退，内心虽忧，但得贵人之助。

求事：独立无望，有人扶持则可。

改行：不宜。

开业：须待时机行事，勿过急。`,
    description: `这个卦是异卦（下坎上坤）相叠。“师”指军队。坎为水、为险；坤为地、为顺，喻寓兵于农。兵凶战危，用兵乃圣人不得已而为之，但它可以顺利无阻碍地解决矛盾，因为顺乎形势，师出有名，故能化凶为吉。
    贞丈人吉。象征着军队和组织。需要有纪律和领导力。`,
    pinyin: 'shī'
  },
  '010000': {
    no: 8,
    name: '上坎下坤 水地比（比卦）诚信团结',
    qian: '上上卦',
    meaning: `这个卦是异卦（下坤上坎）相叠，坤为地，坎为水。水附大地，地纳河海，相互依赖，亲密无间。此卦与师卦完全相反，互为综卦。它阐述的是相亲相辅，宽宏无私，精诚团结的道理。

大象：一阳统五阴，比邻相亲相辅，和乐之象。

运势：平顺，可得贵人提拔，凡事宜速战速决，不可过份迟疑。平顺可得贵人提拔，凡事宜速战速决，不可过份迟疑。

事业：顺利能够成功，向前发展，可以得到他人的帮助和辅佐，以诚实、信任的态度去做事。待人宽厚、正直，主动热情，向才德高尚的人士学习，听取建议。

经商：愿望能够实现，且有较丰厚的利润，但需要与他人密切合作，真诚交往，讲究商业道德，遵守信义，如唯利是图，贪心不足，或自以为是，会导致严重损失。

求名：有成功的希望，不仅要靠个人的努力，更为重要的是他人的赏识和栽培。

婚恋：美好姻缘，相亲相爱，彼此忠诚，白头到老。

决策：心地善良，待人忠诚、厚道，乐于帮助他人，也能得到回报。工作勤恳，对自己要求严格，可以实现自己的理想，但要多动脑筋，多思考，善于判断是非，尤其要注意选择朋友，一旦结上品行不端的人，会成为自己的祸患。如果与比自己高明的人交朋友，并取得帮助，会终身受益。

时运：众人相贺，荣显之极。

财运：善人相扶，大发利市。

家宅：百年好合。

身体：心腹水肿，宜早求治。

家运：合家和乐，家运亨通。

疾病：新病宜速就医，久病则危，为腹、肾、耳等疾。

胎孕：孕安。

子女：儿女温顺且侍亲至孝，亲情融合之象。

周转：必成、找同年之兄弟、朋友可成。

买卖：莫太贪心。交易反覆难成，勿贪则有利可成。

等人：会来。

寻人：不在杏花处，则是有妇人相留，不可寻，恐生不测之祸。此人会自己回来。

失物：不会再现。通常均已遭损毁。

外出：旅途平安，一路顺风。

考试：金榜题名。

诉讼：宜以和解态度面对，虽小人多，但可胜诉。

求事：有贵人帮助，可成。

改行：有利，可得友人支持。

开业：可大发利市，但须注意有人背叛。`,
    description: `这个卦是异卦（下坤上坎）相叠，坤为地；坎为水。水附大地，地纳河海，相互依赖，亲密无间。此卦与师卦完全相反，互为综卦。它阐述的是相亲相辅，宽宏无私，精诚团结的道理。
    吉。象征着亲近和团结。与他人和睦相处，共同进步。`,
    pinyin: 'bì'
  },
  '110111': {
    no: 9,
    name: '上巽下乾 风天小畜（小畜卦）蓄养待进',
    qian: '下下卦',
    meaning: '苗逢旱天尽焦梢，水想云浓雨不浇，农人仰面长吁气，是从款来莫心高。',
    description: `这个卦是异卦（下乾上巽）相叠，乾为天；巽为风。喻风调雨顺，谷物滋长，故卦名小畜（蓄）。力量有限，须待发展到一定程度，才可大有作为。
    密云不雨。象征着积蓄和等待。暂时收敛锋芒，等待时机。`,
    pinyin: 'xiǎo xù'
  },
  '111011': {
    no: 10,
    name: '上乾下兑 天泽履（履卦）脚踏实地',
    qian: '中上卦',
    meaning: '凤凰落在西岐山，长鸣几声出圣贤，天降文王开基业，富贵荣华八百年。',
    description: `这个卦是异卦（下兑上乾）相叠，乾为天；兑为泽，以天喻君，以泽喻民，原文：“履（踩）虎尾、不咥（咬）人。”因此，结果吉利。君上民下，各得其位。兑柔遇乾刚，所履危。履意为实践，卦义是脚踏实地的向前进取的意思。
    履虎尾。象征着谨慎和进退。行事需要谨慎，把握分寸。`,
    pinyin: 'lǚ'
  },
  '000111': {
    no: 11,
    name: '上坤下乾 地天泰（泰卦）应时而变',
    qian: '中中卦',
    meaning: '学文满腹入场闱，三元及第得意回，从今解去愁和闷，喜庆平地一声雷。',
    description: `这个卦是异卦（下乾上坤）相叠，乾为天，为阳；坤为地，为阴，阴阳交感，上下互通，天地相交，万物纷纭。反之则凶。万事万物，皆对立，转化，盛极必衰，衰而转盛，故应时而变者泰（通）。
    小往大来。象征着通达和和谐。各方面都很顺利，可以大展宏图。`,
    pinyin: 'tài'
  },
  '111000': {
    no: 12,
    name: '上乾下坤 天地否(pǐ)（否卦）不交不通',
    qian: '中中卦',
    meaning: '虎落陷坑不堪言，进前容易退后难，谋望不遂自己便，疾病口舌事牵连。',
    description: `这个卦是异卦（下坤上乾）相叠，其结构同泰卦相反，系阳气上升，阴气下降，天地不交，万物不通。它们彼此为“综卦”，表明泰极而否，否极泰来，互为因果。
    否之匪人。象征着闭塞和阻隔。当前困难重重，需要耐心等待。`,
    pinyin: 'pǐ'
  },
  '101111': {
    no: 13,
    name: '上离下乾 天火同人（同人卦）上下和同',
    qian: '中上卦',
    meaning: '心中有事犯猜疑，谋望从前不着实，幸遇明人来指引，诸般忧闷自消之。',
    description: `这个卦是异卦（下离上乾）相叠，乾为天，为君；离为火，为臣民百姓，上天下火，火性上升，同于天，上下和同，同舟共济，人际关系和谐，天下大同。
    同人于门。象征着团结和合作。与他人合作共事，可成大事。`,
    pinyin: 'tóng rén'
  },
  '111101': {
    no: 14,
    name: '上乾下离 火天大有（大有卦）顺天依时',
    qian: '上上卦',
    meaning: '砍树摸雀作事牢，是非口舌自然消，婚姻合伙不费力，若问走失未逃脱。',
    description: `这个卦是异卦（下乾上离）相叠。上卦为离，为火；下卦为乾，为天。火在天上，普照万物，万民归顺，顺天依时，大有所成。
    元亨。象征着光明和昌盛。事业正旺，但需谦逊。`,
    pinyin: 'dà yōu'
  },
  '001000': {
    no: 15,
    name: '上坤下艮 地山谦（谦卦）内高外低',
    qian: '中中卦',
    meaning: '天赐贫人一封金，不争不抢两平分，彼此分得金到手，一切谋望皆遂心。',
    description: `这个卦是异卦（下艮上坤）相叠，艮为山，坤为地。地面有山，地卑（低）而山高，是为内高外低，比喻功高不自居，名高不自誉，位高不自傲。这就是谦。
    谦谦君子。象征着谦虚和礼让。谦虚做人，终得善报。`,
    pinyin: 'qiān'
  },
  '000100': {
    no: 16,
    name: '上坤下震 雷地豫（豫卦）顺时依势',
    qian: '中中卦',
    meaning: '太公插下杏黄旗，收妖为徒归西岐，自此青龙得了位，一旦谋望百事宜。',
    description: `这个卦是异卦（下坤上震）相叠，坤为地，为顺；震为雷，为动。雷依时出，预示大地回春。因顺而动，和乐之源。此卦与谦卦互为综卦，交互作用。
    利建侯。象征着喜悦和享乐。适度娱乐，不可过度。`,
    pinyin: 'yǜ'
  },
  '011001': {
    no: 17,
    name: '上兑下震 泽雷随（随卦）随时变通',
    qian: '中中卦',
    meaning: '泥里步踏这几年，推车靠崖在眼前，目下就该再使力，扒上崖去发财源。',
    description: `这个卦是异卦（下震上兑）相叠，震为雷、为动；兑为悦。动而悦就是“随”。随指相互顺从，己有随物，物能随己，彼此沟通。随必依时顺势，有原则和条件，以坚贞为前提。
    元亨利贞。象征着顺从和跟随。顺应时势，随机应变。`,
    pinyin: 'suí'
  },
  '100110': {
    no: 18,
    name: '上艮下巽 山风蛊（蛊卦）振疲起衰',
    qian: '中中卦',
    meaning: '卦中爻象如推磨，顺当为福反为祸，心中有益且迟迟，凡事尽从忙处错。',
    description: `这个卦是异卦（下巽上艮）相叠，与随卦互为综卦。蛊（gu）本意为事，引申为多事、混乱。器皿久不用而生虫称“蛊”，喻天下久安而因循、腐败，必须革新创造，治理整顿，挽救危机，重振事业。
    元亨。象征着整顿和改革。需要整顿混乱局面，重建秩序。`,
    pinyin: 'gǔ'
  },
  '110000': {
    no: 19,
    name: '上兑下坤 地泽临（临卦）教民保民',
    qian: '中上卦',
    meaning: '君王无道民倒悬，常想拨云见青天，幸逢明主施仁政，重又安居乐自然。',
    description: `这个卦是异卦（下兑上坤）相叠。坤为地；兑为泽，地高于泽，泽容于地。喻君主亲临天下，治国安邦，上下融洽。
    元亨利贞。象征着临近和监督。密切关注，把握机会。`,
    pinyin: 'lín'
  },
  '000011': {
    no: 20,
    name: '上坤下巽 风地观（观卦）观下瞻上',
    qian: '中上卦',
    meaning: '卦遇蓬花旱逢河，生意买卖利息多，婚姻自有人来助，出门永不受折磨。',
    description: `这个卦是异卦（下坤上巽）相叠，风行地上，喻德教遍施。观卦与临卦互为综卦，交相使用。在上者以道义观天下；在下者以敬仰瞻上，人心顺服归从。
    盥而不荐。象征着观察和等待。观察形势，等待时机。`,
    pinyin: 'guān'
  },
  '100101': {
    no: 21,
    name: '上离下震 火雷噬嗑（噬嗑卦）刚柔相济',
    qian: '上上卦',
    meaning: '运拙如同身受饥，幸得送饭又送食，适口充腹心欢喜，忧愁从此渐消移。',
    description: `这个卦是异卦（下震上离）相叠。离为阴卦；震为阳卦。阴阳相交，咬碎硬物，喻恩威并施，宽严结合，刚柔相济。噬嗑（shihe）为上下颚咬合，咀嚼。
    亨。象征着决断和行动。果断行事，但需谨慎。`,
    pinyin: 'shì hé'
  },
  '101100': {
    no: 22,
    name: '上艮下离 山火贲（贲卦）饰外扬质',
    qian: '中上卦',
    meaning: '近来运转瑞气周，窈窕淑女君子求。钟鼓乐之大吉庆，占者逢之喜临头。',
    description: `这个卦是异卦（下离上艮）相叠。离为火为明；艮为山为止。文明而有节制。贲（bi）卦论述文与质的关系，以质为主，以文调节。贲，文饰、修饰。
    亨小利有攸往。象征着文饰和装饰。外表美化要适度。`,
    pinyin: 'bì'
  },
  '000001': {
    no: 23,
    name: '上坤下震 山地剥（剥卦）顺势而止',
    qian: '中下卦',
    meaning: '鹊遇天晚宿林中，不知林内先有鹰，虽然同处心生恶，卦若逢之是非轻。',
    description: `这个卦是异卦（下坤上艮）相叠。五阴在下，一阳在上，阴盛而阳孤；高山附于地。二者都是剥落象，故为“剥卦”。此卦阴盛阳衰，喻小人得势，君子困顿，事业败坏。
    不利有攸往。象征着剥落和衰退。事物衰退之时，需要韬光养晦。`,
    pinyin: 'bō'
  },
  '100000': {
    no: 24,
    name: '上震下坤 地雷复（复卦）寓动于顺',
    qian: '中中卦',
    meaning: '马氏太公不相合，世人占之忧疑多，恩人无义反为怨，是非平地起风波。',
    description: `这个卦是异卦（下震上坤）相叠。震为雷、为动；坤为地、为顺，动则顺，顺其自然。动在顺中，内阳外阴，循序运动，进退自如，利于前进。
    元亨。象征着返回和重复。万物复苏，重新开始。`,
    pinyin: 'fù'
  },
  '100111': {
    no: 25,
    name: '上乾下震 天雷无妄（无妄卦）无妄而得',
    qian: '下下卦',
    meaning: '飞鸟失机落笼中，纵然奋飞不能腾，目下只宜守本分，妄想扒高万不能。',
    description: `这个卦是异卦（下震上乾）相叠。乾为天为刚为健；震为雷为刚为动。动而健，刚阳盛，人心振奋，必有所得，但唯循纯正，不可妄行。无妄必有获，必可致福。
    元亨利贞。象征着天真无妄。行事要真诚不妄为。`,
    pinyin: 'wú wàng'
  },
  '111001': {
    no: 26,
    name: '上艮下乾 山天大畜（大畜卦）止而不止',
    qian: '中上卦',
    meaning: '忧愁常锁两眉头，千头万绪挂心间，从今以后防开阵，任意行而不相干。',
    description: `这个卦是异卦（下乾上艮）相叠。乾为天，刚健；艮为山，笃实。畜者积聚，大畜意为大积蓄。为此不畏严重的艰难险阻，努力修身养性以丰富德业。
    利贞。象征着积蓄和储存。当前适合积累实力，不宜轻举妄动。`,
    pinyin: 'dà xù'
  },
  '100001': {
    no: 27,
    name: '上震下震 山雷颐（颐卦）纯正以养',
    qian: '上上卦',
    meaning: '太公独钓渭水河，手执丝杆忧愁多，时来又遇文王访，自此永不受折磨。',
    description: `这个卦是异卦（下震上艮）相叠。震为雷，艮为山。山在上而雷在下，外实内虚。春暖万物养育，依时养贤育民。阳实阴虚，实者养人，虚者为人养。自食其力。
    贞吉。象征着养育和滋养。注重修养，培养实力。`,
    pinyin: 'yí'
  },
  '011110': {
    no: 28,
    name: '上巽下兑 泽风大过（大过卦）非常行动',
    qian: '中下卦',
    meaning: '夜晚梦里梦金银，醒来仍不见一文，目下只宜求本分，思想络是空劳神。',
    description: `这个卦是异卦（下巽上兑）相叠。兑为泽、为悦，巽为木、为顺，泽水淹舟，遂成大错。阴阳爻相反，阳大阴小，行动非常，有过度形象，内刚外柔。
    栋桡。象征着过度和失衡。行事过度，需要调整。`,
    pinyin: 'dà guò'
  },
  '010010': {
    no: 29,
    name: '上坎下坎 坎为水（坎卦）行险用险',
    qian: '下下卦',
    meaning: '一轮明月照水中，只见影儿不见踪，愚夫当财下去取，摸来摸去一场空。',
    description: `这个卦是同卦（下坎上坎）相叠。坎为水、为险，两坎相重，险上加险，险阻重重。一阳陷二阴。所幸阴虚阳实，诚信可豁然贯通。虽险难重重，却方能显人性光彩。
    有孚维心。象征着陷入困境。处境困难，需要坚守正道。`,
    pinyin: 'kǎn'
  },
  '101101': {
    no: 30,
    name: '上离下离 离为火（离卦）附和依托',
    qian: '中上卦',
    meaning: '官人来占主高升，庄农人家产业增，生意买卖利息厚，匠艺占之大亨通。',
    description: `这个卦是同卦（下离上离）相叠。离者丽也，附着之意，一阴附丽，上下二阳，该卦象征火，内空外明。离为火、为明、太阳反复升落，运行不息，柔顺为心。
    利贞亨。象征着光明和文明。光明在前，前途光明。`,
    pinyin: 'lí'
  },
  '011100': {
    no: 31,
    name: '上兑下艮 泽山咸（咸卦）相互感应',
    qian: '中上卦',
    meaning: '运去黄金失色，时来棒槌发芽，月令极好无差，且喜心宽意大。',
    description: `这个卦是异卦（下艮上兑）相叠。艮为山；泽为水。兑柔在上，艮刚在下，水向下渗，柔上而刚下，交相感应。感则成。
    亨利贞。象征着感应和交流。与人交往要真诚。`,
    pinyin: 'xián'
  },
  '110001': {
    no: 32,
    name: '上巽下震 雷风恒（恒卦）恒心有成',
    qian: '中上卦',
    meaning: '渔翁寻鱼运气好，鱼来撞网跑不了，别人使本挣不来，谁想一到就凑合。',
    description: `这个卦是异卦（下巽上震）相叠。震为男、为雷；巽为女、为风。震刚在上，巽柔在下。刚上柔下，造化有常，相互助长。阴阳相应，常情，故称为恒。
    亨无咎。象征着持久和恒常。保持恒心，坚持到底。`,
    pinyin: 'héng'
  },
  '111100': {
    no: 33,
    name: '上乾下艮 天山遁（遁卦）遁世救世',
    qian: '下下卦',
    meaning: '浓云蔽日不光明，劝君且莫出远行，婚姻求财皆不利，提防口舌到门庭。',
    description: `这个卦是异卦（下艮上乾）相叠。乾为天，艮为山。天下有山，山高天退。阴长阳消，小人得势，君子退隐，明哲保身，伺机救天下。
    亨小利贞。象征着退避和遁逃。适时退避，保存实力。`,
    pinyin: 'dùn'
  },
  '001111': {
    no: 34,
    name: '上震下乾 雷天大壮（大壮卦）壮勿妄动',
    qian: '中上卦',
    meaning: '卦占工师得大木，眼前该着走上路，时来运转多顺当，有事自管放心宽。',
    description: `这个卦是异卦（下乾上震）相叠。震为雷；乾为天。乾刚震动。天鸣雷，云雷滚，声势宏大，阳气盛壮，万物生长。刚壮有力故曰壮。大而且壮，故名大壮。四阳壮盛，积极而有所作为，上正下正，标正影直。
    利贞。象征着强盛和壮大。势头正盛，但不可过于刚强。`,
    pinyin: 'dà zhuàng'
  },
  '000101': {
    no: 35,
    name: '上离下坤 火地晋（晋卦）求进发展',
    qian: '中上卦',
    meaning: '锄地锄去苗里草，谁想财帛将人找，一锄锄出银子来，这个运气也算好。',
    description: `这个卦是异卦（下坤上离）相叠。离为日，为光明；坤为地。太阳高悬，普照大地，大地卑顺，万物生长，光明磊落，柔进上行，喻事业蒸蒸日上。
    康侯用锡马。象征着前进和晋升。事业上升，但需谨慎。`,
    pinyin: 'jìn'
  },
  '101000': {
    no: 36,
    name: '上坤下离 地火明夷（明夷卦）晦而转明',
    qian: '中下卦',
    meaning: '时乖运拙走不着，急忙过河拆了桥，恩人无义反为怨，凡事无功枉受劳。',
    description: `这个卦是异卦（下离上坤）相叠。离为明，坤为顺；离为日；坤为地。日没入地，光明受损，前途不明，环境困难，宜遵时养晦，坚守正道，外愚内慧，韬光养晦。
    利艰贞。象征着晦暗和隐藏。处于困境，需要隐忍。`,
    pinyin: 'míng yí'
  },
  '101011': {
    no: 37,
    name: '上巽下离 风火家人（家人卦）诚威治业',
    qian: '下下卦',
    meaning: '一朵鲜花镜中开，看着极好取不来，劝君休把镜花恋，卦若逢之主可怪。',
    description: `这个卦是异卦（下离上巽）相叠。离为火；巽为风。火使热气上升，成为风。一切事物皆应以内在为本，然后伸延到外。发生于内，形成于外。喻先治家而后治天下，家道正，天下安乐。
    利女贞。象征着家庭和睦。家庭和谐，事业顺遂。`,
    pinyin: 'jiā'
  },
  '110101': {
    no: 38,
    name: '上离下兑 火泽睽（睽卦）异中求同',
    qian: '下下卦',
    meaning: '此卦占来运气歹，如同太公作买卖，贩猪牛快贩羊迟，猪羊齐贩断了宰。',
    description: `这个卦是异卦（下兑上离）相叠。离为火；兑为泽。上火下泽，相违不相济。克则生，往复无空。万物有所不同，必有所异，相互矛盾。睽即矛盾。
    小事吉。象征着乖离和背离。人际关系不睦，需要调适。`,
    pinyin: 'kuí'
  },
  '001010': {
    no: 39,
    name: '上坎下艮 水山蹇（蹇卦）险阻在前',
    qian: '下下卦',
    meaning: '大雨倾地雪满天，路上行人苦又寒，拖泥带水费尽力，事不遂心且耐烦。',
    description: `这个卦是异卦（下艮上坎）相叠。坎为水；艮为山。山高水深，困难重重，人生险阻，见险而止，明哲保身，可谓智慧。蹇，跋行艰难。
    利西南。象征着艰难和险阻。前进困难，需要谨慎。`,
    pinyin: 'jiǎn'
  },
  '010100': {
    no: 40,
    name: '上雷下坎 雷水解（解卦）柔道致治',
    qian: '中上卦',
    meaning: '目下月令如过关，千辛万苦受熬煎，时来恰相有人救，任意所为不相干。',
    description: `这个卦是异卦（下坎上震）相叠。震为雷、为动；坎为水、为险。险在内，动在外。严冬天地闭塞，静极而动。万象更新，冬去春来，一切消除，是为解。
    利西南。象征着解除和化解。困难即将解除，柳暗花明。`,
    pinyin: 'xiè'
  },
  '100011': {
    no: 41,
    name: '上艮下兑 山泽损（损卦）损益制衡',
    qian: '下下卦',
    meaning: '时运不至费心多，比作推车受折磨，山路崎岖吊下耳，左插右按按不着。',
    description: `这个卦是异卦（下兑上艮）相叠。艮为山；兑为泽。上山下泽，大泽浸蚀山根。损益相间，损中有益，益中有损。二者之间，不可不慎重对待。损下益上，治理国家，过度会损伤国基。应损则损，但必量力、适度。少损而益最佳。
    有孚。象征着损益和取舍。有所损失才有所得，需要智慧取舍。`,
    pinyin: 'sǔn'
  },
  '001110': {
    no: 42,
    name: '上震下巽 风雷益（益卦）损上益下',
    qian: '上上卦',
    meaning: '时来运转吉气发，多年枯木又开花，枝叶重生多茂盛，几人见了几人夸。',
    description: `这个卦是异卦（下震上巽）相叠。巽为风；震为雷。风雷激荡，其势愈强，雷愈响，风雷相助互长，交相助益。此卦与损卦相反。它是损上以益下，后者是损下以益上。二卦阐述的是损益的原则。
    利有攸往。象征着增益和发展。有利于开展事业，扩大发展。`,
    pinyin: 'yì'
  },
  '011111': {
    no: 43,
    name: '上兑下乾 泽天夬 （夬卦） 决而能和',
    qian: '上上卦',
    meaning: '蜘蛛脱网赛天军，粘住游蜂翅翎毛，幸有大风吹破网，脱离灾难又逍遥。',
    description: `这个卦是异卦（下乾上兑）相叠。乾为天为健；兑为泽为悦。泽气上升，决注成雨，雨施大地，滋润万物。五阳去一阴，去之不难，决（去之意）即可，故名为夬（guài），夬即决。
    扬于王庭。象征着决断和果断。当机立断，不可犹豫。`,
    pinyin: 'guài'
  },
  '111110': {
    no: 44,
    name: '上乾下巽 天风姤（姤卦） 天下有风',
    qian: '上卦',
    meaning: '他乡遇友喜气欢，须知运气福重添，自今交了顺当运，向后管保不相干。',
    description: `这个卦是异卦（下巽上乾）相叠。乾为天；巽为风。天下有风，吹遍大地，阴阳交合，万物茂盛。姤（gòu）卦与夬卦相反，互为“综卦”。姤即遘，阴阳相遇。但五阳一阴，不能长久相处。
    女壮。象征着偶遇和相遇。机遇来临，把握时机。`,
    pinyin: 'gòu'
  },
  '000110': {
    no: 45,
    name: '上兑下坤 泽地萃（萃卦）荟萃聚集',
    qian: '中上卦',
    meaning: '游鱼戏水被网惊，跳过龙门身化龙，三尺杨柳垂金线，万朵桃花显你能。',
    description: `这个卦是异卦相叠（下坤上兑）。坤为地、为顺；兑为泽、为水。泽泛滥淹没大地，人众多相互斗争，危机必四伏，务必顺天任贤，未雨绸缪，柔顺而又和悦，彼此相得益彰，安居乐业。萃，聚集、团结。
    亨。象征着聚集和集合。众人聚集，利于谋事。`,
    pinyin: 'cuì'
  },
  '011000': {
    no: 46,
    name: '上坤下巽 地风升（升卦）柔顺谦虚',
    qian: '上上卦',
    meaning: '士人来占必得名，生意买卖也兴隆，匠艺逢之交易好，农间庄稼亦收成。',
    description: `这个卦是异卦相叠（下巽上坤）。坤为地、为顺；巽为木、为逊。大地生长树木，逐步的成长，日渐高大成材，喻事业步步高升，前程远大，故名“升”。
    元亨。象征着上升和进步。事业上��期，把握机会。`,
    pinyin: 'shēng'
  },
  '010011': {
    no: 47,
    name: '上坎下兑 泽水困（困卦）困境求通',
    qian: '中上卦',
    meaning: '时运不来好伤怀，撮上押去把梯抬，一筒虫翼无到手，转了上去下不来。',
    description: `这个卦是异卦（下坎上兑）相叠。兑为阴为泽喻悦；坎为阳为水喻险。泽水困，陷入困境，才智难以施展，仍坚守正道，自得其乐，必可成事，摆脱困境。
    亨贞。象征着困境和困难。身处困境，需要坚持。`,
    pinyin: 'kùn'
  },
  '110010': {
    no: 48,
    name: '上坎下巽 水风井（井卦）求贤若渴',
    qian: '上上卦',
    meaning: '枯井破费已多年，一朝流泉出来鲜，资生济渴人称羡，时来运转喜自然。',
    description: `这个卦是异卦（下巽上坎）相叠。坎为水；巽为木。树木得水而蓬勃生长。人靠水井生活，水井由人挖掘而成。相互为养，井以水养人，经久不竭，人应取此德而勤劳自勉。
    改邑不改井。象征着循环和滋养。坚守本分，滋养生息。`,
    pinyin: 'jǐng'
  },
  '101110': {
    no: 49,
    name: '上兑下离 泽火革（革卦）顺天应人',
    qian: '上上卦',
    meaning: '苗逢旱天渐渐衰，幸得天恩降雨来，忧去喜来能变化，求谋干事遂心怀。',
    description: `这个卦是异卦（下离上兑）相叠。离为火；兑为泽，泽内有水。水在上而下浇，火在下而上升。火旺水干；水大火熄。二者相生亦相克，必然出现变革。变革是宇宙的基本规律。
    巳日乃孚。象征着革新和变革。改革创新，谨慎行事。`,
    pinyin: 'gé'
  },
  '011101': {
    no: 50,
    name: '上离下巽 火风鼎（鼎卦）稳重图变',
    qian: '中下卦',
    meaning: '莺鹜蛤蜊落沙滩，蛤蜊莺鹜两翅扇，渔人进前双得利，失走行人却自在。',
    description: `这个卦是异卦（下巽上离）相叠。燃木煮食，化生为熟，除旧布新的意思。鼎为重宝大器，三足稳重之象。煮食，喻食物充足，不再有困难和困扰。在此基础上宜变革，发展事业。
    元吉。象征着变革和创新。改革创新，但需循序渐进。`,
    pinyin: 'dǐng'
  },
  '100100': {
    no: 51,
    name: '上震下震 震为雷（震卦）临危不乱',
    qian: '中上卦',
    meaning: '一口金钟在淤泥，人人拿着当玩石，忽然一日钟悬起，响亮一声天下知。',
    description: `这个卦是同卦（下震上震）相叠。震为雷，两震相叠，反响巨大，可消除沉闷之气，亨通畅达。平日应居安思危，怀恐惧心理，不敢有所怠慢，遇到突发事变，也能安然自若，谈笑如常。
    亨。震来虩虩。象征着震动和行动。行动要果断，但需谨慎。`,
    pinyin: 'zhèn'
  },
  '001001': {
    no: 52,
    name: '上艮下艮 艮为山（艮卦）动静适时',
    qian: '中下卦',
    meaning: '财帛常打心头走，可惜眼前难到手，不如意时且忍耐，逢着闲事休开口。',
    description: `这个卦是同卦（下艮上艮）相叠。艮为山，二山相重，喻静止。它和震卦相反。高潮过后，必然出现低潮，进入事物的相对静止阶段。静止如山，宜止则止，宜行则行。行止即动和静，都不可失机，应恰到好处，动静得宜，适可而止。
    艮其背。象征着停止和限制。适时停止，审时度势。`,
    pinyin: 'gèn'
  },
  '110100': {
    no: 53,
    name: '上巽下艮 风山渐（渐卦）渐进蓄德',
    qian: '上上卦',
    meaning: '俊鸟幸得出笼中，脱离灾难显威风，一朝得意福力至，东西南北任意行。',
    description: `这个卦是异卦（下艮上巽）相叠。艮为山；巽为木。山上有木，逐渐成长，山也随着增高。这是逐渐进步的过程，所以称渐，渐即进，渐渐前进而不急速。
    女归吉。象征着渐进和发展。循序渐进，稳步前行。`,
    pinyin: 'jiàn'
  },
  '001100': {
    no: 54,
    name: '上震下兑 雷泽归妹（归妹卦）立家兴业',
    qian: '下下卦',
    meaning: '求鱼须当向水中，树上求之不顺情，受尽爬揭难随意，劳而无功运平平。',
    description: `这个卦是异卦（下兑上震）相叠。震为动、为长男；兑为悦、为少女。以少女从长男，产生爱慕之情，有婚姻之动，有嫁女之象，故称归妹。男婚女嫁，天地大义，人的开始和终结。上卦与渐卦为综卦，交互为用。
    征凶。象征着归宿和结合。需要谨慎选择，避免冒进。`,
    pinyin: 'guī mèi'
  },
  '101001': {
    no: 55,
    name: '上离下震 雷火丰（丰卦）日中则斜',
    qian: '上上卦',
    meaning: '古镜昏暗好几年，一朝磨明似月圆，君子谋事逢此卦，时来运转喜自然。',
    description: `这个卦是异卦（下离上震）相叠，电闪雷鸣，成就巨大，喻达到顶峰，如日中天。告诫；务必注意事物向相反方面发展。治乱相因，盛衰无常，不可不警惕。
    亨。象征着丰盛和繁荣。当前形势大好，但需谨防骄傲。`,
    pinyin: 'fēng'
  },
  '001101': {
    no: 56,
    name: '上离下艮 火山旅（旅卦）依义顺时',
    qian: '下下卦',
    meaning: '飞鸟树上垒窝巢，小人使计举火烧，君占此卦为不吉，一切谋望枉徒劳。',
    description: `这个卦是异卦（下艮上离）相叠。此卦与丰卦相反，互为“综卦”。山中燃火，烧而不止，火势不停地向前蔓延，如同途中行人，急于赶路。因而称旅卦。
    小亨。象征着旅行和变动。行事谨慎，注意安全。`,
    pinyin: 'lǚ'
  },
  '110110': {
    no: 57,
    name: '上巽下巽 巽为风（巽卦）谦逊受益',
    qian: '中上卦',
    meaning: '一叶孤舟落沙滩，有篙无水进退难，时逢大雨江湖溢，不用费力任往返。',
    description: `这个卦是同卦（下巽上巽）相叠，巽（xùn）为风，两风相重，长风不绝，无孔不入，巽义为顺。谦逊的态度和行为可无往不利。
    小亨。象征着顺从和入巽。顺应形势，循序渐进。`,
    pinyin: 'xùn'
  },
  '011011': {
    no: 58,
    name: '上兑下兑 兑为泽（兑卦）刚内柔外',
    qian: '上上卦',
    meaning: '这个卦象真可取，觉着做事不费力，休要错过这机关，事事觉得随心意。',
    description: `这个卦是同卦（下泽上泽）相叠。泽为水。两泽相连，两水交流，上下相和，团结一致，朋友相助，欢欣喜悦。兑为悦也。同秉刚健之德，外抱柔和之姿，坚行正道，导民向上。
    亨利贞。象征着喜悦和愉快。保持愉快心情，但不可过度。`,
    pinyin: 'duì'
  },
  '010110': {
    no: 59,
    name: '上坎下兑 风水涣（涣卦）拯救涣散',
    qian: '下下卦',
    meaning: '隔河望见一锭金，欲取岸宽水又深，指望资财难到手，昼思夜想枉费心。',
    description: `这个卦是异卦（下坎上巽）相叠。风在水上行，推波助澜，四方流溢。涣，水流流散之意。象征组织和人心涣散，必用积极的手段和方法克服，战胜弊端，挽救涣散，转危为安。
    亨。象征着分散和涣散。需要整顿，重新集中。`,
    pinyin: 'huàn'
  },
  '011010': {
    no: 60,
    name: '上兑下坎 水泽节（节卦）万物有节',
    qian: '上上卦',
    meaning: '时来运转喜气生，登台封神姜太公，到此诸神皆退位，纵然有祸不成凶。',
    description: `这个卦是异卦（下兑上坎）相叠。兑为泽；坎为水。泽有水而流有限，多必溢于泽外。因此要有节度，故称节。节卦与涣卦相反，互为综卦，交相使用。天地有节度才能常新，国家有节度才能安稳，个人有节度才能完美。
    亨。象征着节制和规范。凡事要有节制，但不可过分拘束。`,
    pinyin: 'jié'
  },
  '110011': {
    no: 61,
    name: '上巽下兑 风泽中孚（中孚卦）诚信立身',
    qian: '下下卦',
    meaning: '路上行人色匆匆，急忙无桥过薄冰，小心谨慎过得去，一步错了落水中。',
    description: `这个卦是异卦（下兑上巽）相叠。孚（fú）本义孵，孵卵出壳的日期非常准确，有信的意义。卦形外实内虚，喻心中诚信，所以称中孚卦。这是立身处世的根本。
    豚鱼吉。象征着诚信和信任。以诚待人，守信为本。`,
    pinyin: 'zhōng fú'
  },
  '001011': {
    no: 62,
    name: '上震下艮 雷山小过（小过卦）行动有度',
    qian: '中上卦',
    meaning: '行人路过独木桥，心内惶恐眼里瞧，爽利保你过得去，慢行一定不安牢。',
    description: `这个卦是异卦（下艮上震）相叠。艮为山；震为雷。过山雷鸣，不可不畏惧。阳为大，阴为小，卦外四阴超过中二阳，故称“小过”，小有越过。
    亨。象征着小有成就。虽小有成就，但不可自满。`,
    pinyin: 'xiǎo guò'
  },
  '010101': {
    no: 63,
    name: '上离下坎 水火既济（既济卦）盛极将衰',
    qian: '中上卦',
    meaning: '金榜以上题姓名，不负当年苦用功，人逢此卦名吉庆，一切谋望大亨通。',
    description: `这个卦是异卦（下离上坎）相叠。坎为水；离为火。水火相交，水在火上，水势压倒火势，救火大功告成。既，已经；济，成也。既济就是事情已经成功，但终将发生变故。
    亨小。象征着成功和完成。事情已成，但仍需谨慎。`,
    pinyin: 'jì jì'
  },
  '101010': {
    no: 64,
    name: '上离下坎 火水未济（未济卦）事业未竟',
    qian: '中下卦',
    meaning: '离地着人几丈深，是防偷营劫寨人，后封太岁为凶煞，时加谨慎祸不侵。',
    description: `这个卦是异卦（下坎上离）相叠。离为火；坎为水。火上水下，火势压倒水势，救火大功未成，故称未济。《周易》以乾坤二卦为始，以既济、未济二卦为终，充分反映了变化发展的思想。
    亨。象征着未完成。事情未成，需要继续努力。`,
    pinyin: 'wèi jì'
  }
} 
