import { HexagramInfoType } from "@types"

/**
 * 卦象信息
 * no: 卦象编号
 * name: 卦象名称
 * qian: 卦象吉凶
 * original: 卦象原文
 * meaning: 传统解卦
 * description: 卦象解释
 * pinyin: 卦象拼音
 */
export const hexagramInfo: { [key: string]: HexagramInfoType } = {
  '111111': {
    no: 1,
    name: '上乾下乾 乾为天（乾卦）自强不息',
    qian: '上上卦',
    original: '乾。元，亨，利，贞。',
    meaning: `这个卦是同卦（下乾上乾）相叠。象征天，喻龙（德才的君子），又象征纯粹的阳和健，表明兴盛强健。乾卦是根据万物变通的道理，以“元、亨、利、贞”为卦辞，表示吉祥如意，教导人遵守天道的德行。

大象：天行刚健，自强不息。

运势：飞龙在天，名利双收之象，宜把握机会，争取成果。有地位擢升、名利双收之象，功名荣显得贵子。六亲和睦，凡事谦和为贵，可吉。

事业：大吉大利，万事如意，心想事成，自有天佑，春风得意，事业如日中天。但阳气已达顶点，盛极必衰，务须提高警惕，小心谨慎。力戒骄傲，冷静处世，心境平和，如是则能充分发挥才智，保证事业成功。

经商：十分顺利，有发展向上的大好机会。但切勿操之过急，宜冷静分析形势，把握时机，坚持商业道德，冷静对待中途出现的困难，定会有满意的结果。

求名：潜在能力尚未充分发挥，只要进一步努力，克服骄傲自满情绪，进业修德，以渊博学识和高尚品质，成君子之名。

婚恋：阳盛阴衰，但刚柔可相济，形成美满结果。女性温柔者更佳。

决策：可成就大的事业。坚持此卦的刚健、正直、公允的实质，修养德行，积累知识，坚定信念，自强不息，必能克服困难，消除灾难。

时运：临事刚健，自强不息。

财运：施比受有福，不利买而利卖。

家宅：积善有余庆；女子过刚宜慎重。

身体：保健有恒。

特性：积极，刚毅，努力，认真，有耐性，坚忍，正派，主动，慷慨，严律，重名誉。

家运：繁昌兴隆，须小心口舌之争。

疾病：病情恶化，宜细心调养，注意头、脑、骨髓等病变。

胎孕：有不安之兆，宜小心保养。

子女：儿女健康，幸福有为。

周转：虽不成问题，尚宜心平气和来处理。

买卖：小利可得，大则勿取，勿太张扬为吉。

等人：一定会来。

寻人：已远走高飞，不易找到，在西北方向。

失物：可望寻回。

外出：利于出行，结伴而行更佳。

考试：有望取得好成绩。

诉讼：宜据理力争。

求事：有贵人提拔，可发展，称心。

改行：占得此卦不宜改行。

开业：开业者需要耐心观望。`,
    description: `这个卦是同卦（下乾上乾）相叠。象征天，喻龙（德才的君子），又象征纯粹的阳和健，表明兴盛强健。乾卦是根据万物变通的道理，以“元、亨、利、贞”为卦辞，示吉祥如意，教导人遵守天道的德行。
    大吉大利。象征着刚健、正直、创造、领导。事业上会有所发展，但要注意谦虚谨慎。`,
    pinyin: 'qián'
  },
  '000000': {
    no: 2,
    name: '上坤下坤 坤为地（坤卦）厚德载物',
    qian: '上上卦',
    original: '坤。元，亨，利牝马之贞。',
    meaning: `这个卦是同卦（下坤上坤）相叠，阴性。象征地（与乾卦相反），顺从天，承载万物，伸展无穷无尽。坤卦以雌马为象征，表明地道生育抚养万物，而又依天顺时，性情温顺。它以“先迷后得”证明“坤”顺从“乾”，依随“乾”，才能把握正确方向，遵循正道，获取吉利。

大象：大地承载万物，以德服众，仁者无敌。

运势：诸事不宜急进，以静制动为宜。诸事不宜急进，退守以静制动者吉。坤者大地平静，任其他物所摧而不为所动者大利也。若醉心私欲，违背常理，则有无妄之灾。

事业：诸项事业可以成功，得到预想的结果，但开始出师不利，为困境所扰。切莫冒险急进，须小心谨言慎行，尤其不可单枪匹马，独断专行。取得朋友的关心和支持最为重要，在他人的合作下，共同完成事业。因此，应注重内心修养，积蓄养德，效法大地，容忍负重，宽厚大度，以直率、方正、含蓄为原则，不得贪功自傲，持之以恒，谋求事业的成功。

经商：机遇不很好，切莫冒险，以稳健为妥，遇到挫折，务必即时总结经验。注意储存货物，待价而沽，处处小心为是。

求名：比较顺利，具备基本条件，踏踏实实，埋头苦干，不追求身外之物，即可吉祥。

婚恋：阴盛。以柔克刚，女方柔顺，美好姻缘，白头到老。

决策：忠厚、温和，待人真诚，热心助人，因此也能得到他人的帮助，可往往因不提防小人而受到伤害，但无大碍。性格灵活，工作方法多样，可以左右逢源，得到赞许。

时运：为人厚道，声名远传。

财运：满载而归。

家宅：家庭安稳；婚嫁大吉。

身体：柔软运动。

家运：幸福平静之象。

疾病：病情严重，为腹、肠胃、肌肉等慢性病（腹疾、脾胃之疾、饮食停滞，从而食不化）。

胎孕：生贵子，女儿亦为福。

子女：儿女众多，和睦幸福也。

周转：须耐心去求，否则难成。

买卖：勿急，交易可成。

等人：不会来，须再待些时日。

寻人：此人为色情之事出走，于西南方附近之地也。

失物：难以寻回，大部分均不知下落。

外出：宜结伴而行。可去陌生的地方。

考试：希望不大。

诉讼：防房地产之争，宜和解，有始无终之兆。

求事：不称意亦不理想，另寻。

改行：改行不利，宜固守本份。

开业：开业者再观望，目前尚未筹备妥当，不宜。`,
    description: `这个卦是同卦（下坤上坤）相叠，阴性。象征地（与乾卦相反），顺从天。承载万物，伸展无穷无尽。坤卦以雌马为象征，表明地道生育抚养万物，而又依天顺时，性情温顺。它以“先迷后得”证明“坤”顺从“乾”，依随“乾”，才能把握正确方向，遵循正道，获取吉利。
    大地包容，坤顺承天。主静止、包容、顺从。事业需要耐心积累，切勿急躁。`,
    pinyin: 'kūn'
  },
  '010001': {
    no: 3,
    name: '上坎下震 水雷屯（屯卦）起始维艰',
    qian: '下下卦',
    original: '屯。元亨，利贞。勿用有攸往，利建侯。',
    meaning: `这个卦是异卦（下震上坎）相叠，震为雷，喻动；坎为雨，喻险。雷雨交加，险象丛生，环境恶劣。“屯”原指植物萌生大地，万物始生，充满艰难险阻，然而顺时应运，必欣欣向荣。

大象：屯者难也，万事欲进而不得进。

运势：身处困境，步步为营，有初难后解之意。逆势，多有困惑，但不可妄进，宜守不宜进。坚定意志，凡事不可为一己之利而执意强行，皆有不成损破之象。宜步步为营，排除困难，始可通达，有初难后解之象。

事业：起初多有不利，要知难而进，小心翼翼，勇往直前，灵活机动，可望获得大的成功，时机到来时一定要抓住，却也不得操之太急，且仍有困难，务必有他人相助，故平时应多施恩惠。

经商：创业初期步履艰难，多有挫折。坚定信念最重要，不要为表面现象所迷惑，应积极进取，行动果断，打开出路。若仍无法摆脱困境，则应退守保全，等待机会，再展宏图。

求名：积极争取，主动追求，可以成功。

婚恋：好事多磨，忠贞纯洁，大胆追求，能够成功，婚姻美满。

决策：初始困难，但若具有坚忍不拔的毅力和锲而不舍的奋斗精神，前途不可估量，但往往不为他人理解而陷于孤独苦闷，事业会因此处于困难状态，需要得到贤德之人的帮助才能摆脱。如能以乐观主义精神处世，能取得成就。

时运：宜守不宜进。

财运：创业维艰。

家宅：修缮住宅；初婚不和。

身体：保存元气。

家运：多波折，若能努力排除困难，可得通顺。

疾病：病在肠胃，足部或泌尿系统，不宜掉以轻心。

胎孕：不安，产母有虚惊，但可无虑。

子女：有辛苦，但以后可得安逸。

周转：困难重重，须用心忍耐奔波。

买卖：不利，交易有损。

等人：不会来。

寻人：出走者不知去向，难寻。东或北方去矣。

失物：难以寻回。

外出：慎重为好，有危险，宜改日动身。

考试：不理想。

诉讼：小事粘滞纠缠，大事反无大害，宜和解。

求事：不利。

改行：不宜。

开业：不宜，有困难亦难成也。`,
    description: `这个卦是异卦（下震上坎）相叠，震为雷，喻动；坎为雨，喻险。雷雨交加，险象丛生，环境恶劣。“屯”原指植物萌生大地。万物始生，充满艰难险阻，然而顺时应运，必欣欣向荣。
    起始维艰。象征着开始时的困难。需要耐心和毅力，度过初期的艰难时期。`,
    pinyin: 'zhūn'
  },
  '100010': {
    no: 4,
    name: '上艮下坎 山水蒙（蒙卦）启蒙奋发',
    qian: '中下卦',
    original: '蒙。亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。',
    meaning: `这个卦是异卦（下坎上艮）相叠，艮是山的形象，喻止；坎是水的形象，喻险。卦形为山下有险，仍不停止前进，是为蒙昧，故称蒙卦。但因把握时机，行动切合时宜，因此，具有启蒙和通达的卦象。

大象：蒙者，昏而无所见也，故宜“启蒙”。

运势：初时迷惑不知方向，须忍耐待机而动，凡事多听取别人意见，则运可通。气运不发，多迷惑。初时不顺，须忍耐待机，渐可佳。切勿贸然行事或为人认保、作保，否则必有损失。凡事宜从上辈教诲，则运可通也。

事业：事业开始，混乱无序，危机四伏，以勇敢坚毅的行动可以扭转局面。然而必须接受严格教育，培养这种奋发图强的精神。务必脚踏实地，最忌好高骛远，否则会陷入孤立无援的境地。

经商：务必小心谨慎，不得急功近利，尤其应树立高尚的商业道德，以良好的信誉提高竞争力而取胜。

求名：必须接受良好的基础教育，陶冶情操。且动机纯正，可以达到目的。

婚恋：注意考察对方品德，不可以金钱为诱铒。夫妻需相互宽容、理解。

决策：有时会陷入迷惘困顿的境地，加上胆小、不果断，往往误事。如能接受长辈的教诲，甚至严酷的考验，抛弃疑惧的心理，等待适当时机，必然一帆风顺。

时运：蓄积德行，出而用世。

财运：矿山生意，果决则吉。

家宅：君子居吉；婚姻之始。

身体：驱去邪热，可保平安。

家运：初时辛苦，上下无法沟通，只要以诚相待，必有开运之时。

疾病：病情不明，反覆难治。为肠胃、腹水之疾及传染病。

胎孕：胎孕无碍。

子女：应注重子女教养，将来方得幸福之象。

周转：困难，防止上当受骗。

买卖：不利，有损失。

等人：可能走错路，会迟到。

寻人：受诱惑而出走，因本身蒙昧无知而受骗。在东北或北方，日前难寻。

失物：遍寻不获。似乎在大门下陷之处遗失，忘记带走，可试问人。

外出：等候有利时机再行动，等待期间应积极做准备。

考试：不理想。

诉讼：因外人引起事端，目下未明，有理讲不清。

求事：未能如愿，再等时机。

改行：改行不宜

开业：开业者不宜。再等一段时间，筹备好资金再做打算。`,
    description: `这个卦是异卦（下坎上艮）相叠，艮是山的形象，喻止；坎是水的形象，喻险。卦形为山下有险，仍不停止前进，是为蒙昧，故称蒙卦。但因把握时机，行动切合时宜，因此，具有启蒙和通达的卦象。
    匪我求童蒙。象征着蒙昧和启蒙。需要学习和教导，循序渐进。`,
    pinyin: 'méng'
  },
  '010111': {
    no: 5,
    name: '上坎下乾 水天需（需卦）守正待机',
    qian: '中上卦',
    original: '需。有孚，光亨，贞吉。利涉大川。',
    meaning: `这个卦是异卦（下乾上坎）相叠，下卦是乾，刚健之意；上卦是坎，险陷之意。以刚逢险，宜稳健之妥，不可冒失行动，观时待变，所往一定成功。

大象：云登天上而未雨，不能急进，等待时机之象。

运势：智者必须待时而行，急进反见凶险。宜退守正道，不宜冒险前进，投机急取反而失利。须知贪小失大，智者必须待时也。

事业：关键在于审时度势，耐心等待，事成于安祥，切勿冒险，欲速不达。自己要充满自信，临危不惧，坚守中正，必可化险为夷。情况有利时，仍得居安思危。

经商：行动之初，情况困难，必须以极大的耐心，创造条件和机会，行事光明磊落，观时待变，实现愿望。事情接近成功时，更应小心谨慎，切莫功亏一篑。

求名：时机尚不成熟，应耐心等待。这时应坚定信念，不为闲言流语所动摇，努力丰富自己，再求助可靠的人便可成功。

婚恋：慎重，切不可草率行事，逐渐培养感情，以诚实、热情相待，会发生变故，仍可以有良好的结局。双方都应懂得以柔克刚的道理。

决策：前途光明，有雄心大志，且可实现。为此需要积蓄实力，等待时机，大器晚成。本人具有坚强的意志，冷静的头脑。前进途中会遇到困难和险阻，必须十分谨慎，坦然对待小人的中伤，在灾祸在面前能镇静自若。不轻举妄动，冷静选择方向。为人谦和、坦率，多有他人相助，促使事业成功。当时机成熟后，必然一帆风顺。

时运：时机尚未成熟，耐心等待。

财运：资本未集，无法开张。

家宅：平安是福。

身体：调节饮食，健康有望。

家运：初为多事之秋，须凭智慧耐心挽救颓势。

疾病：病情拖延，须留心治疗，为头、胸、肺、泌尿系统等病。

胎孕：临产之时才占卜，表示会有障碍。防克产母。

子女：得子迟。

周转：不能预期而得，有延滞。

买卖：有口舌不可成就，亦勿贪小而失大。

等人：迟到。

寻人：此出走之人因感情之事，在西北或北方。

失物：即时不能寻回，需经过一段时间将会出现。

外出：充分准备齐全后，可平安无事。

考试：要多用功。

诉讼：暂时未能了结，以和为贵。

求事：不宜急取，急亦不得，再等待，再寻求。

改行：不宜。

开业：不宜。`,
    description: `这个卦是异卦（下乾上坎）相叠，下卦是乾，刚健之意；上卦是坎，险陷之意。以刚逢险，宜稳健之妥，不可冒失行动，观时待变，所往一定成功。
    有孚光亨。象征着等待时机。需要耐心等待，时机成熟时方可行动。`,
    pinyin: 'xū'
  },
  '111010': {
    no: 6,
    name: '上乾下坎 天水讼（讼卦）慎争戒讼',
    qian: '中下卦',
    original: '讼。有孚窒惕，中吉，终凶。利见大人，不利涉大川。',
    meaning: `这个卦是异卦（下坎上乾）相叠。同需卦相反，互为“综卦”。乾为刚健，坎为险陷。刚与险，健与险，彼此反对，定生争讼。争讼非善事，务必慎重戒惧。

大象：乾天升于上，坎水降于下，相背而行而起讼。

运势：事与愿违，凡事不顺，小人加害，宜防陷阱。百事闭塞不通，伤害频繁，受中伤而又易陷于奸计，不如意之运也。得饶人处且饶人，得过且过，莫再争讼，否则皆不利也。

事业：起初顺利，有利可图，继而受挫，务必警惕，慎之又慎，不得固执已见，极力避免介入诉讼纠纷的争执之中。与其这样，不如退而让人，求得化解，安于正理，可免除意外之灾。陷入争讼，即使获胜，最后还得失去，得不偿失。

经商：和气生财，吃亏是福，切勿追求不义之财。商业谈判应坚持公正、公平、互利的原则，尽量避免发生冲突。这样便会有好结果。

求名：不利。自己尚缺乏竞争实力，应坚守纯正，隐忍自励，自强自勉，切莫逞强。依靠有地位的人的帮助，及早渡过难关。

婚恋：虽不尽人意，倒也般配，彼此理解，未尝不可。双方应以温和的方式处理生活。

决策：争强好胜，不安于现状，为改变命运和超越他人而奋斗。头脑聪颖，反应敏捷，有贵人相助。但缺乏持之以恒的毅力，容易露出锋芒，得罪他人，带来诉讼之灾。宜承认现实，顺其自然，知足，适可而止。接受教训，引以为戒，可功成名就。

时运：功名受阻，不宜树敌。

财运：开始谨慎，终可获利。

家宅：君子必求淑女。

身体：预防胜于治疗。

家运：家庭内部不和，有口舌争端之害，并有散离之象。

疾病：病情严重，为腰、血液、泌尿系统、头部疾患。

胎孕：生产无惊阻，安也。

子女：父子之间存有歧见，无法沟通之象。子女生来劳碌，与父母缘薄，多辛劳忧苦也。

周转：不得要领，难成。

买卖：因处理不当，有冲突争端，常招损失，不利也。

等人：不会来。就算会来，双方必有争执事情发生。

寻人：此人因争执事由负气出走，并有生命危险，又寻找不易，尽量往西北与北方寻找。

失物：不会出现。

外出：途中多有变故，宜改日出行。

考试：不理想。

诉讼：两败俱伤，宜找中间人调解，久争无益。

求事：难成。

改行：不利。

开业：不宜。`,
    description: `这个卦是异卦（下坎上乾）相叠。同需卦相反，互为“综卦”。乾为刚健，坎为险陷。刚与险，健与险，彼此反对，定生争讼。争讼非善事，务必慎重戒惧。
    有孚窒惕。象征着争论和诉讼。需要谨慎处理人际关系，避免冲突。`,
    pinyin: 'sòng'
  },
  '000010': {
    no: 7,
    name: '上坤下坎 地水师（师卦）行险而顺',
    qian: '中上卦',
    original: '师。贞，丈人吉，无咎。',
    meaning: `这个卦是异卦（下坎上坤）相叠。“师”指军队。坎为水、为险；坤为地、为顺，喻寓兵于农。兵凶战危，用兵乃圣人不得已而为之，但它可以顺利无阻碍地解决矛盾，因为顺乎形势，师出有名，故能化凶为吉。

大象：养兵聚众，出师攻伐之象，彼此有伤，难得安宁。

运势：困难重重，凡事以正规行事，忌独断独行、投机取巧，提防潜在敌人。事虽有不顺、但要引以为镜，记取教训。不要图私利而投机取巧。凡事应以正规而行，事物多变动，切忌独立而行。困难多端，靠自己努力，摒除一切困难为上策。

事业：阻力很大，困难很多，处于激烈的竞争状态，要与他人密切合作，谨小慎微，行为果断，切忌盲目妄动，适度即可，注意保全自己。机动灵活，严于律已。从容沉着对付一切，必能成功。

经商：已有一定的积蓄，可以从事大的营销活动，但必卷入激烈商战，以刚毅顽强的精神和高尚的商业道德，辅以灵活的方法，勿贪图小利，勿掉以轻心，加强与他人的沟通，必可摆脱困境，化险为夷。

求名：具备很好的条件，但须有正确的引导，务必严格要求自己，克服不利因素的干扰，经过扎实努力，必可名利双全。

婚恋：慎重、专注，否则会陷入“三角”纠纷。痴情追求可以达到目的。

决策：天资聪颖，性格灵活，具有坚强的意志，对事业执着追求，迎难而进。可成就大事业。喜竞争，善争辩，富有冒险精神，不免带来麻烦，务老成持重，不贪功，以中正为要。

时运：包容别人，修行待时。

财运：有财有库，善自珍惜。

家宅：旧亲联姻，可喜可贺。

身体：腹胀之症，调气无忧。

家运：外柔顺而内险恶，故家内常生不和，需慎重处理。行正道可化险为安。

疾病：病况严重，提防心脏或腹腔肿瘤等。

胎孕：喜中有忧。或有不安或不孕。

子女：大出息之象。

周转：无望，另觅别处。

买卖：有阻，不太顺意，寅午戌日交易可成。

等人：来者不善。

寻人：此人因家内失和而出走，速往北方或西南找，否则有危险。

失物：不会出现，即或寻回，也已损坏。

外出：“行险而顺”。虽有可能遇到麻烦，但结果一定十分顺利，可放心出行。

考试：很认真，但不理想，继续努力终有成就。

诉讼：宜进不宜退，内心虽忧，但得贵人之助。

求事：独立无望，有人扶持则可。

改行：不宜。

开业：须待时机行事，勿过急。`,
    description: `这个卦是异卦（下坎上坤）相叠。“师”指军队。坎为水、为险；坤为地、为顺，喻寓兵于农。兵凶战危，用兵乃圣人不得已而为之，但它可以顺利无阻碍地解决矛盾，因为顺乎形势，师出有名，故能化凶为吉。
    贞丈人吉。象征着军队和组织。需要有纪律和领导力。`,
    pinyin: 'shī'
  },
  '010000': {
    no: 8,
    name: '上坎下坤 水地比（比卦）诚信团结',
    qian: '上上卦',
    original: '比。吉。原筮，元永贞，无咎。',
    meaning: `这个卦是异卦（下坤上坎）相叠，坤为地，坎为水。水附大地，地纳河海，相互依赖，亲密无间。此卦与师卦完全相反，互为综卦。它阐述的是相亲相辅，宽宏无私，精诚团结的道理。

大象：一阳统五阴，比邻相亲相辅，和乐之象。

运势：平顺，可得贵人提拔，凡事宜速战速决，不可过份迟疑。平顺可得贵人提拔，凡事宜速战速决，不可过份迟疑。

事业：顺利能够成功，向前发展，可以得到他人的帮助和辅佐，以诚实、信任的态度去做事。待人宽厚、正直，主动热情，向才德高尚的人士学习，听取建议。

经商：愿望能够实现，且有较丰厚的利润，但需要与他人密切合作，真诚交往，讲究商业道德，遵守信义，如唯利是图，贪心不足，或自以为是，会导致严重损失。

求名：有成功的希望，不仅要靠个人的努力，更为重要的是他人的赏识和栽培。

婚恋：美好姻缘，相亲相爱，彼此忠诚，白头到老。

决策：心地善良，待人忠诚、厚道，乐于帮助他人，也能得到回报。工作勤恳，对自己要求严格，可以实现自己的理想，但要多动脑筋，多思考，善于判断是非，尤其要注意选择朋友，一旦结上品行不端的人，会成为自己的祸患。如果与比自己高明的人交朋友，并取得帮助，会终身受益。

时运：众人相贺，荣显之极。

财运：善人相扶，大发利市。

家宅：百年好合。

身体：心腹水肿，宜早求治。

家运：合家和乐，家运亨通。

疾病：新病宜速就医，久病则危，为腹、肾、耳等疾。

胎孕：孕安。

子女：儿女温顺且侍亲至孝，亲情融合之象。

周转：必成、找同年之兄弟、朋友可成。

买卖：莫太贪心。交易反覆难成，勿贪则有利可成。

等人：会来。

寻人：不在杏花处，则是有妇人相留，不可寻，恐生不测之祸。此人会自己回来。

失物：不会再现。通常均已遭损毁。

外出：旅途平安，一路顺风。

考试：金榜题名。

诉讼：宜以和解态度面对，虽小人多，但可胜诉。

求事：有贵人帮助，可成。

改行：有利，可得友人支持。

开业：可大发利市，但须注意有人背叛。`,
    description: `这个卦是异卦（下坤上坎）相叠，坤为地；坎为水。水附大地，地纳河海，相互依赖，亲密无间。此卦与师卦完全相反，互为综卦。它阐述的是相亲相辅，宽宏无私，精诚团结的道理。
    吉。象征着亲近和团结。与他人和睦相处，共同进步。`,
    pinyin: 'bì'
  },
  '110111': {
    no: 9,
    name: '上巽下乾 风天小畜（小畜卦）蓄养待进',
    qian: '下下卦',
    original: '小畜。亨。密云不雨，自我西郊。',
    meaning: `这个卦是异卦（下乾上巽）相叠，乾为天，巽为风。喻风调雨顺，谷物滋长，故卦名小畜（蓄）。力量有限，须待发展到一定程度，才可大有作为。

大象：蓄养之量有限，力不从心，故宜忍耐蓄养实力，静待时机。

运势：运势反覆，有口舌之争，但难于短期内解决，须忍耐，静待时机。有蓄聚、阻止之意。 一阴畜五阳，虽有云雨而不下，雨之不下，大地不能得到滋润，故此运势有反覆、有口舌、又难以急调，诸事宜忍耐，等待时机。尤其女人得此卦更应在行为上，对事或对人有所节制。

事业：时机尚不成熟，应当耐心而积极地积存力量，切不可冒险行动。遇到挫折不可灰心，鼓起勇气战胜困难，坚持原则，加强团结合作，提前做好各项准备，会有所成。

经商：已有一定的基础，但有失去危险，一定要特别慎重，争取与他人真诚合作，共同获利，决不贪心，适可而止，但更不能满足现状，不图进取。

求名：树立远大目标，尽最大努力去争取，虚心求教他人，取得真诚帮助，实现自己的理想，警惕小人的破坏。

婚恋：双方必须十分忠诚，第三者插足的现象极有可能发生。

决策：不很顺利，前进途中会遇到一些意想不到的困难。但由于本人性格坚强，具有战胜不利条件的意志。因此，可以实理自己的理想。但极有可能遭到小人的伤害，必须得到志同道合者的真诚相助，才能可能排除障碍。对所得应满足，适可而止，切不可过度追求，以免满招损。

时运：平平无奇，受人牵制。

财运：外表不错，内多耗损。

家宅：小康，须防口舌；娶得淑女。

身体：风火之症；小孩吉，大人凶。

家运：不和且多是非，衰而不振，多劳，要耐心应对，以待时机。雨过天必晴。

疾病：危，重病，注意肝胆，头部病变。

胎孕：宜防流产。

子女：因子女而劳碌之象，但晚年有福也。

周转：有女人从中阻碍，不成也。

买卖：景气不好，买卖难成或利薄。

等人：不会来，临时变卦。

寻人：因感情或家庭不和出走，只在原处。东南或西北之向。

失物：似乎遗失的是金器或现金支票等物，有被硬物夹住，或者第三格的地方。

外出：准备尚未充分，不得仓促出行，尤其忌长途旅行，会有意外的灾害。应另择他日外出。

考试：不理想。

诉讼：会因证据不足而败诉。

求事：希望渺小。

改行：不宜。

开业：不宜，已开业者则困难、口舌多。`,
    description: `这个卦是异卦（下乾上巽）相叠，乾为天；巽为风。喻风调雨顺，谷物滋长，故卦名小畜（蓄）。力量有限，须待发展到一定程度，才可大有作为。
    密云不雨。象征着积蓄和等待。暂时收敛锋芒，等待时机。`,
    pinyin: 'xiǎo xù'
  },
  '111011': {
    no: 10,
    name: '上乾下兑 天泽履（履卦）脚踏实地',
    qian: '中上卦',
    original: '履。履虎尾，不咥人。亨。',
    meaning: `这个卦是异卦（下兑上乾）相叠，乾为天，兑为泽，以天喻君，以泽喻民，原文：“履（踩）虎尾，不咥（咬）人”。因此，结果吉利。君上民下，各得其位。兑柔遇乾刚，所履危。履意为实践，卦义是脚踏实地的向前进取的意思。

大象：柔弱遇刚强，欲行却难行之象，难且危也。

运势：先劳而后逸，始惊而后安，百事不宜急进，须以和待人，有惊无险。先劳而后逸，始惊而后安，百事不宜急进，须以和待人，有惊无险。

事业：起初很不顺利，受到种种威胁，若能提高警惕，谨小慎微，脚踏实地，逐个地去克服困难，不改变自己的决心，一定可以达到目的。办事有自知之明，务必量力而行，不可不顾实际，尤其不得逞强，急于求成。

经商：宜待观动静，勿为小利而动摇自己计划，尤其不得贪得无厌，遵循商业道德，了解全面信息。

求名：务必有恒心，孜孜以求，不为财富利诱，不为世俗干扰，坚持自己的志向和理想，可以取得成功。

婚恋：双方安贫乐道，可和睦相处，若一方为富贵所动，会发生婚变。

决策：诸事必须小心慎重，不利的情况经常会出现，但若能处理得好，总会是有惊无险，化险为夷。为此，办事必须认认真真，遵循正道，虚心听取别人的建议，量力而行，切莫自负逞强，一定会有好的结果。

时运：依序升进，不可攀缘。

财运：明察货品，待时而售。

家宅：门庭严整。

身体：疏通气血。

家运：新婚而刚建立家庭者，多碍、劳苦。但此卦有先苦后甜之象，和气可生财，过些时日即可雨过天晴也。

疾病：病虽重，但注意调理亦可愈，防头、口、肺等疾。

胎孕：临盆产妇占得则吉，否则有受惊吓之象，需安胎。

子女：初运有劳苦，障碍、困难之象，但以后能获得幸福也。

周转：虽有些困难，但不必急躁，谦恭而施则可成也。

买卖：虽有是非但终可成，牛马猴之月或日方成。

等人：迟来。

寻人：走失之人有生命危险，在西方或西北方向，难寻，须争取时效。申未日可见。

失物：赶快去找有可能寻回，留意行过的路上，或者有鞋的地方。

外出：有惊无险，可以外出，但非紧急情况可以缓行。

考试：不理想。

诉讼：敌强而我弱之象，宜步步为营。

求事：有贵人提拔，可发展，称心。

改行：不宜。

开业：不宜。`,
    description: `这个卦是异卦（下兑上乾）相叠，乾为天；兑为泽，以天喻君，以泽喻民，原文：“履（踩）虎尾、不咥（咬）人。”因此，结果吉利。君上民下，各得其位。兑柔遇乾刚，所履危。履意为实践，卦义是脚踏实地的向前进取的意思。
    履虎尾。象征着谨慎和进退。行事需要谨慎，把握分寸。`,
    pinyin: 'lǚ'
  },
  '000111': {
    no: 11,
    name: '上坤下乾 地天泰（泰卦）应时而变',
    qian: '中中卦',
    original: '泰。小往大来，吉亨。',
    meaning: `这个卦是异卦（下乾上坤）相叠，乾为天，为阳；坤为地，为阴，阴阳交感，上下互通，天地相交，万物纷纭。反之则凶，万事万物，皆对立，转化，盛极必衰，衰而转盛，故应时而变者泰（通）。

大象：天地阴阳之气相交感，上下和睦，流通无阻。

运势：诸事吉祥顺利，凡事宜内求，不宜外求，防乐极生悲。诸事如意吉祥，前途事业均顺利。切不可骄傲或任意从事，亦宜自惕勿太活跃，始能免于灾难。凡事宜求内在之实，不求外在之虚，否则有破。

事业：坚持由小而大，循序渐进的原则，事业已达到顺利的境地，更应小心从事，居安思危，积极寻求、开拓新的事业，方可继续前进，若因循守旧，不思进取，必遭失败。

经商：顺利。务必注意市场动向，开拓新的领域，展开新的竞争。为此，要密切与他人进行合作，争取各方面的帮助，但需谦虚谨慎，警惕巧言令色的小人。

求名：具有成功的条件，但一定得更加努力，刻苦追求，最忌聪明反被聪明误。

婚恋：美满姻缘。谈恋爱却不可不认真对待。

决策：吉祥如意。适应能力强，各项事业能成功。能谋善断，长于人际关系，能团结他人共创业绩，灵活机动，很能适应形势的变化，不断向新的领域迈进。但在人生途中必须兢兢业业，尤其不可麻痹大意，在择朋选友方面更应慎重，切防小人倒运。

时运：一切顺利，居安思危。

财运：买卖均宜，买入较佳。

家宅：盛但须防衰，婚嫁大吉。

身体：运动合宜。

家运：家庭和合，有通亨之象，凡事宜检点得失，不可胡为，否则招灾不利。

疾病：久病不利，注意肠肺及头部之症。

胎孕：生贵子。安而无灾。生女亦均无碍。

子女：亲子和睦，幸福圆满。留心教养，勿使太任性，否则沦于不幸之破运。

周转：可成。

买卖：交易有益，得利。

等人：会来。

寻人：在朋友或亲戚家里，有信息也。可寻。

失物：不会出现。

外出：一帆风顺。

考试：上榜有望，宜再努力勿懈。

诉讼：是非由小事化大，终可和解。

求事：吉利亨通。

改行：吉。

开业：开业者吉利之象。`,
    description: `这个卦是异卦（下乾上坤）相叠，乾为天，为阳；坤为地，为阴，阴阳交感，上下互通，天地相交，万物纷纭。反之则凶。万事万物，皆对立，转化，盛极必衰，衰而转盛，故应时而变者泰（通）。
    小往大来。象征着通达和和谐。各方面都很顺利，可以大展宏图。`,
    pinyin: 'tài'
  },
  '111000': {
    no: 12,
    name: '上乾下坤 天地否(pǐ)（否卦）不交不通',
    qian: '中中卦',
    original: '否。否之匪人。不利君子贞。大往小来。',
    meaning: `这个卦是异卦（下坤上乾）相叠，其结构同泰卦相反，系阳气上升，阴气下降，天地不交，万物不通。它们彼此为“综卦”，表明泰极而否，否极泰来，互为因果。

大象：天气上升，地气下降，天地之气不交，主闭塞不通。

运势：上下不和，百事不通，凡事宜忍，须知否极泰来。凶且衰，君子以险德避难，不可荣以禄也。运势不通达，诸事不顺，有损失且波折多。故宜守固正道，若稍偏差，则灾害至也。

事业：陷入逆境，事业处于衰退阶段，多有不顺利。受小人干扰而不得志，多挫折。应坚持正道，勿与小人合流，团结志同道合者，自保以等待时机。保持自信心，戒慎恐惧，形势定会好转，事业终能成功。

经商：遇到强大的竞争对手，处于不利地位，信息不灵造成重大损失。应格外小心谨慎，坚持守势，等待有利时机到来，再努力发展自己的事业。

求名：条件还不成熟，再努力一阵子，并得到他人的帮助，理想可以实现。

婚恋：容易出现节外生枝的事情，甚至发生挫折和变故，双方若都充满信心，好的结果会出现。

决策：本人聪慧，精明，勤奋努力，但不注意人际关系，加上小人的排斥，命运或遭厄运。意志坚强，具有奋斗精神，且克服了不足，尽管付出的代价很高，必能成全事业。

时运：诸事不顺，不可妄动。

财运：适宜买入，后可获利。

家宅：勤俭免祸；仳离之象。

身体：气血不通，节制饮食。

家运：夫妻彼此不能协调，是非很多，劫财又带衰，慎之。

疾病：占病为凶兆，病在脑、肺及肠胃等，慎防癌症。

胎孕：不安。

子女：与双亲感情不睦，任其自然发展吧。

周转：告贷无门。

买卖：多有损失，但有贵人应在午未申日。

等人：不会来，因别的事情而违约。

寻人：因感情不睦而出走，去向不明，难寻。东南方。

失物：寻不回。

外出：会遇到不少麻烦和困难，宜推迟或提前行动。

考试：不理想。

诉讼：各走极端，有口难言，宜及时求和。

求事：先难后易，须有耐心去争取胜利，否则凶。

改行：难如愿。

开业：最好另择吉日。然此卦有先难之困，若能舒之则利。`,
    description: `这个卦是异卦（下坤上乾）相叠，其结构同泰卦相反，系阳气上升，阴气下降，天地不交，万物不通。它们彼此为“综卦”，表明泰极而否，否极泰来，互为因果。
    否之匪人。象征着闭塞和阻隔。当前困难重重，需要耐心等待。`,
    pinyin: 'pǐ'
  },
  '101111': {
    no: 13,
    name: '上离下乾 天火同人（同人卦）上下和同',
    qian: '中上卦',
    original: '同人。同人于野，亨。利涉大川，利君子贞。',
    meaning: `这个卦是异卦（下离上乾）相叠，乾为天，为君；离为火，为臣民百姓，上天下火，火性上升，同于天，上下和同，同舟共济，人际关系和谐，天下大同。

大象：二人同心，其利断金，君子正心诚意，与人和同之象。

运势：如意吉祥，与人共事，上下皆和，又得长辈提拔。得此卦为诸事开通、平安、吉祥、如意之象，有同情心，互爱、亨通之象，故宜好好掌握时机，维持盛泰。若有稍涉偏私或为私情之爱则有破兆，应以事业为重。

事业：顺利、平安，尤其是在与他人的合作方面会十分成功，宜广泛开展人际活动，建立广泛的联系，克服狭隘的门户之见，照顾各方面的利益，求大同，存小异，坚持正确的原则，必能成就大事业。

经商：以真诚合作、精诚团结的态度与同行共事，公平竞争，必可获得自己应得的利益。

求名：自己必须刻苦努力，尤其要取得师长和志同道合的朋友指教、帮助，自己虚心进取，完全能够达到目的。

婚恋：多情、善交际，认识的异性朋友多，故需慎重选择，注意维护双方关系和家庭和睦。

决策：性格开朗、乐观，为人热情，人际关系好，社交能力强，要善于同他人合作，尤其要协调多方面的关系，要有原则性，与不良风气斗争，有魄力，敢作敢为，富有自我奉献精神，并具有统御能力，适于担任一定的负责。

时运：朋友支持，升迁顺利。

财运：合资有利，可以进取。

家宅：合家欢喜。

身体：燥热之症，另求良医。

家运：上下和乐，运势亨通，可得意外之财，宜把握良机，努力求取。

疾病：病轻，不久可愈，注意心脏，头肺等疾。

胎孕：无碍。与六亲和睦，得缘之吉卦。

子女：上下皆能和睦之象。

周转：顺利，并可进取大业，利也。

买卖：利益大，与人共事吉。

等人：一定会来，且会带来好消息。

寻人：此人非故意出走，自己会回来。

失物：遗失似文件眼镜等物，可能被压在底层，尽快找寻，则可取回。

外出：很平安、顺利，并可以结交新朋友，获得帮助。

考试：成绩优良。

诉讼：凡事以和为贵。

求事：吉利。

改行：吉利亨通。

开业：吉利亨通。`,
    description: `这个卦是异卦（下离上乾）相叠，乾为天，为君；离为火，为臣民百姓，上天下火，火性上升，同于天，上下和同，同舟共济，人际关系和谐，天下大同。
    同人于门。象征着团结和合作。与他人合作共事，可成大事。`,
    pinyin: 'tóng rén'
  },
  '111101': {
    no: 14,
    name: '上乾下离 火天大有（大有卦）顺天依时',
    qian: '上上卦',
    original: '大有。元亨。',
    meaning: `这个卦是异卦（下乾上离）相叠。上卦为离，为火；下卦为乾，为天。火在天上，普照万物，万民归顺，顺天依时，大有所成。

大象：太阳在天，遍照大地万物，但五阳争一阴，须知有盈即缺。

运势：得时得运，昌荣大吉，但防物极必反，盛极而衰。得时得运，隆盛昌荣也。然卦象藏有盛极必衰的预兆，不得不慎，以期保持其全盛之枢纽，可众望所归。有走红、赚钱之势，须谨慎不可骄纵。

事业：事业已经取得一定的成就，最忌得意忘形，胡作非为。务必止恶扬善，坚守中正，交往正直的朋友，戒惧谨慎，兢兢业业，真正做到大而不盈，满而不溢，事业可望迈上新的台阶。

经商：兴隆昌盛，已摆脱困难状态，进入兴旺发达的阶段，如能克制贪财的心理，确守诚信原则，公平待人，克勤克俭，尤其应时刻注意市场动向，适时转轨，可望长久。

求名：已经小有名气，切勿就此满足，停顿不前，尤其不可陷入世俗圈内，应继续努力，在真正朋友的帮助下，更上一层楼。

婚恋：条件优越，可供选择者多，以慎重为好。对于家庭双方应尽力维护。

决策：性格坚强，勇于战胜困难，奋斗向上，前进途中困难和厄运很多，唯有认真对待才能不断取得成功，如放松警惕，骄傲自满，将带来惨重失败。朋友很多，交际广泛，对事业很有帮助，但其中也有拆台的小人。

时运：亨通无比，大放异彩。

财运：放手去做，财富自来。

家宅：积善之家，子孙保之。

身体：虚火上升，小心诊治。

家运：生平富贵吉利。切勿因富而凌贫，过于傲气凌人者不利也。

疾病：治疗可愈，防高血压、心脏、头肺病患。

胎孕：生贵子女，宜往大医院。

子女：儿女有成，父母欢欣之象。

周转：大有所得。

买卖：交易有获大利之象，但亦宜审慎行事。

等人：会带来好消息。

寻人：此人为感情或金钱之事出走，宜速找寻，否则恐有走极端之险。以东南再南方再西北三向寻之。

失物：找寻费时，惟可失而得。

外出：平安，可动身。

考试：会取得好成绩

诉讼：可圆满解决。

求事：顺利可行。

改行：可以，依计划进行。

开业：开业吉利。`,
    description: `这个卦是异卦（下乾上离）相叠。上卦为离，为火；下卦为乾，为天。火在天上，普照万物，万民归顺，顺天依时，大有所成。
    元亨。象征着光明和昌盛。事业正旺，但需谦逊。`,
    pinyin: 'dà yōu'
  },
  '001000': {
    no: 15,
    name: '上坤下艮 地山谦（谦卦）内高外低',
    qian: '中中卦',
    original: '谦。亨，君子有终。',
    meaning: `这个卦是异卦（下艮上坤）相叠，艮为山，坤为地。地面有山，地卑（低）而山高，是为内高外低，比喻功高不自居，名高不自誉，位高不自傲。这就是谦。

大象：山应在地面上，而今在地下，代表谦逊之德。

运势：吉利平安，前途无限，但必须去除骄横之气。吉利平安，欣欣向荣之象，谦者前途大利，骄者横行招败。故以君子谦德，纵涉大川而无险也，卦利君子。正所谓谦受益满招损也。

事业：尚未被人器重，但因品德高尚，终会为人发现。自己不必有意表现，尤其不可放弃谦虚的美德，埋头苦干，一定会得到他人的帮助，在事业上大有作为。

经商：较为顺利，但不会获暴利，须逐步积累，故应极其小心谨慎，诚心与他人合作，遵守商业道德，通过自己的勤劳努力，取得商业的发展。

求名：天资聪明，但因性格不善于表现自己，起初往往被埋没，自己只要不灰心，继续努力钻研业务，保持谦逊好学精神，更大的成功正在未来。

婚恋：美满的婚姻应由双方共同去努力争取。否则，恋爱不成功，家庭不能和睦。

决策：具有内高外低的谦虚美德，善于团结他人，也能得到别人的帮助，事业很顺利，遇到困难，很快可以化险为夷，有惊无险。由于能够认真吸取别人的长处，进步很快，会畅通无阻，但需要特别注意学业、德业和修养。

时运：眼前平顺，步步高升。

财运：物价合理，利益保障。

家宅：近山之居，合家平安。

身体：内郁之症，放宽心胸。

家运：幸福之吉运。

疾病：防旧病发，腹部或背部之疾，但仍属吉象。

胎孕：生男儿无灾。生女儿亦无灾。

子女：子女多温顺，事亲孝，可贺也。

周转：诚实谦恭，可成也。

买卖：终成，有是非。获薄利，益也。

等人：准时到达。

寻人：未见，待一段时间自回。

失物：难以发现，有失窃的可能。

外出：顺利，但应准备充分，途中小心，不可忽视安全。

考试：金榜题名。

诉讼：宜速和解，拖延不利。

求事：吉利，可成。

改行：可行。

开业：开业者吉利，但诸事勿太急，以谦则受益。`,
    description: `这个卦是异卦（下艮上坤）相叠，艮为山，坤为地。地面有山，地卑（低）而山高，是为内高外低，比喻功高不自居，名高不自誉，位高不自傲。这就是谦。
    谦谦君子。象征着谦虚和礼让。谦虚做人，终得善报。`,
    pinyin: 'qiān'
  },
  '000100': {
    no: 16,
    name: '上坤下震 雷地豫（豫卦）顺时依势',
    qian: '中中卦',
    original: '豫。利建侯行师。',
    meaning: `这个卦是异卦（下坤上震）相叠，坤为地，为顺；震为雷，为动。雷依时出，预示大地回春。因顺而动，和乐之源。此卦与谦卦互为综卦，交互作用。

大象：雷出于地上，阳气奋发，万物欣欣向荣。

运势：如意安泰，可得长辈扶助，但须防色难，凡事应有备而战。此卦象征万物欣畅，如意安泰，可得上辈之助。切不可因繁华而怠惰，或沉醉于声色欢场之中。好运不常有，当好好把握。

事业：十分顺利，事业可以获得成功，但必须符合实际，顺应潮流，且得自己努力奋斗，树立远大目光，尤其不可因事业的顺利而放松谨慎小心的态度，陷于懒散享乐。否则，必将后悔莫及。

经商：时运已到，应大胆行动，即使发生挫折，也可以很快化险为夷。应加强同他人的合作，开诚布公，共同开发事业。

求名：天资聪颖，如能坚守正直的品德，严格要求自己，努力上进，不因有成绩骄傲满足，停止前进，而是兢兢业业，不惰不怠，必定可以有重大成功。

婚恋：十分顺利，一生顺利和吉祥，但万不可掉以轻心，更不可玩弄感情，否则将会出现悲剧。

决策：一生顺利，不会出现大的波折，容易比较顺利得到自己应该得到的。但关键在于自己的努力和奋斗，不得耽于安乐，不可玩物丧志。豁达、大度更有利于健康和长寿。一旦遇到意外的灾害，只要时时严格要求自己，坚守纯正，乐不忘忧，居安思危，必可转危为安。

时运：春雷发动，诸事吉祥。

财运：新货上市，必有大利。

家宅：祈神祭祖，可保平安。

身体：祷告静心。

家运：吉象。切不可迷于情而招破相。

疾病：凶险之卦，注意腹腔、肝胆之疾。

胎孕：安康，会喜得贵子。

子女：儿女均能相亲相爱，前程美好。

周转：稍有阻，过后顺利。

买卖：好时机。秋更吉，有贵人。

等人：途中有碍，一定会来。

寻人：东方或西南方可寻，或他人自来相寻。

失物：难以寻回。

外出：充分准备，从容出发，会十分顺利和平安。

考试：金榜题名。

诉讼：有始而无终，易被多人连累，破财、受惊。

求事：可得上辈提拔，有希望。

改行：吉，大有可为。

开业：开业者大吉大利之象。`,
    description: `这个卦是异卦（下坤上震）相叠，坤为地，为顺；震为雷，为动。雷依时出，预示大地回春。因顺而动，和乐之源。此卦与谦卦互为综卦，交互作用。
    利建侯。象征着喜悦和享乐。适度娱乐，不可过度。`,
    pinyin: 'yǜ'
  },
  '011001': {
    no: 17,
    name: '上兑下震 泽雷随（随卦）随时变通',
    qian: '中中卦',
    original: '随。元亨利贞，无咎。',
    meaning: `这个卦是异卦(下震上兑)相叠，震为雷，为动;兑为悦，动而悦就是“随”。随指相互顺从，己有随物，物能随己，彼此沟通。随必依时顺势，有原则和条件，以坚贞为前提。

大象：震木在兑泽之下，木必随水漂荡，随者，顺也。

运势：有去旧迎新之吉象，宜与人合作，可获厚利，忌三心两意，或独断独行。物事均有去旧迎新之吉象，凡事与他人互相通达、协商，可名利双收。倘若三心二意，或独立单行，不听人言劝，有自招灾祸之虞。

事业：对社会和人生有正确的估价，重视人际关系，善于同他人合作，事业会很顺利。为了保证取得更进一步的成功，不得贪图小利，向比自己优秀的人学习，择善而从，心存诚信、努力开拓事业。

经商：顺利。在与他人的真诚合作下，能够达到预期的目的。在竞争中应保持清醒头脑，从大处、长远考虑，遵守商业道德，保持至诚的态度对待顾客和同行，会保持竞争优势。

求名：在自己刻苦钻研的基础上，虚心向有德有才的师长学习，借助外界的力量，促使自己更快的进步，实现个人的理想。

婚恋：双方情投意合可以成功，家庭和睦，但若迷恋于情爱，会影响双方的事业，务必注意。

决策：个人成长道路并不十分顺利，但由于谦虚、随和，人际关系好，尤其能够得到长辈的器重，各种事都能在他人的帮助和关心下成功。但务必注意追随他人应有的立场和原则，不可趋炎附势，招致祸凶。

时运：明年运行，五年方展。

财运：堆积存货，明春有利。

家宅：防止惊惧。

身体：休养为宜;牢狱之灾。

家运：本身有相当不错的收入，富有之象。但不可过于放纵，守操节为宜。

疾病：病重，须长期治疗，注意口腔、肝、足患等症。

胎孕：无碍，无惊险。

子女：亲情融洽，与六亲和睦，幸福之象。

周转：和气相商有利，意气用事则难成。

买卖：勿顽强固执，则交易有利。否则失之，有阻。

等人：会迟到。

寻人：不必去找了，过些时日会自己回来，勿急。

失物：即将疏忽之时，会突然察觉。

外出：吉利。可以改变处境。

考试：成绩理想。

诉讼：宜决意和解，目前无忧，但不久须防有祸。

求事：虽吉，然若能谦逊待人，多接受别人意见，会得人提拔。

改行：有充份计划者可行。

开业：吉利。`,
    description: `这个卦是异卦（下震上兑）相叠，震为雷、为动；兑为悦。动而悦就是“随”。随指相互顺从，己有随物，物能随己，彼此沟通。随必依时顺势，有原则和条件，以坚贞为前提。
    元亨利贞。象征着顺从和跟随。顺应时势，随机应变。`,
    pinyin: 'suí'
  },
  '100110': {
    no: 18,
    name: '上艮下巽 山风蛊（蛊卦）振疲起衰',
    qian: '中中卦',
    original: '蛊。元亨，利涉大川。先甲三日，后甲三日。',
    meaning: `这个卦是异卦(下巽上艮)相叠，与随卦互为综卦。蛊本意为事，引申为多事、混乱。器皿久不用而生虫称“蛊”，喻天下久安而因循、腐败，必须革新创造，治理整顿，挽救危机，重振事业。

大象：风入山下，闭而不出，即物腐生虫，意气不通，因循败事。

运势：诸事不如意，艰难迷惑，宜大胆革新，否则引来内忧外患。诸事不如意、积弊已深，未能进展，气运杂乱。逢此宜鼓起勇气，大胆加以革新，有内忧外患之象。

事业：运气处于不佳状态，或因外界条件，或因个人因素所致。唯有谨慎分析原因，找出弊端，坚决，大胆，不惜冒险，战胜阻力。这时一要头脑冷静，二要向高明的人请教，必能创造业绩。

经商：诸多不利困扰着自己，不宜继续走老路。应全面分析市场动向，当机立断，另外找寻出路。

求名：会遇到许多困难和不利，应看作是对自己的考验，要以百倍的勇气，继续奋斗。同时，虚心寻找自己的不足，加以补救。

婚恋：不顺利。双方如情投意合，则应全力以赴促成此事，夫妇应共同努力维系家庭。

决策：生不逢时，家道或事业有中落现象，个人陷入多事之秋。唯有正视现实，勤奋勉励，不屈不挠，有所作为，甚至不惜冒险，挽救败落状况。必要时还需耐心等待时机。

时运：力图振作，可改旧观。

财运：不宜堆积，应即贩卖。

家宅：整顿家风;恐有私情;生育不顺。

身体：蛊毒之症，小心咒诅。

家运：家庭易生烦心之事，不彻底改革有破家、损财之象。

疾病：宜把握治疗时机，冬季占得险象，为内脏恶性疾病。

胎孕：胎有惊。

子女：双亲不堪其忧之苦象耳。

周转：信用不好，周转无望。

买卖：交易不成，另谋生计为要。

等人：中途有变，不会来。

寻人：因家庭感情失和而出走，或与人私奔，于东南或东北。

失物：找不回来，遗失似是木制工艺品，在门口或旅馆遗失，或者是寄失了。

外出：宜推迟或提前。否则会出现危险，务必小心谨慎。

考试：落榜。

诉讼：慎防桃色纠纷，会拖一段时间，不易解决。

求事：不利。

改行：弃旧迎新，或革新内部人事。

开业：开业者不宜，有损财或官符之灾。`,
    description: `这个卦是异卦（下巽上艮）相叠，与随卦互为综卦。蛊（gu）本意为事，引申为多事、混乱。器皿久不用而生虫称“蛊”，喻天下久安而因循、腐败，必须革新创造，治理整顿，挽救危机，重振事业。
    元亨。象征着整顿和改革。需要整顿混乱局面，重建秩序。`,
    pinyin: 'gǔ'
  },
  '110000': {
    no: 19,
    name: '上兑下坤 地泽临（临卦）教民保民',
    qian: '中上卦',
    original: '临。元，亨，利，贞。至于八月有凶。',
    meaning: `这个卦是异卦（下兑上坤）相叠。坤为地，兑为泽，地高于泽，泽容于地。喻君主亲临天下，治国安邦，上下融洽。

大象：池泽之水灌溉地面万物，相辅相成，生生不息。

运势：诸事亨通，上下和合，前途有望，但不宜过于急进。运势渐增，诸事亨通如意，前途有望，仕途有成，可得贵人相助，上下安合。以和顺可奏大功，宜诚心待人，可诸事顺畅，急进或忘形者，有破财之象。

事业：正是成功的极好时机，务必抓紧，不可失去良机。但却不可就此满足，时运会很快消失，一定要从长计议，注意总结经验，团结他人，共同开拓新领域。

经商：会十分顺利，并有收获，但须随时注意市场动向，兢兢业业，防止出现意外的事故，尤其应妥善处理人际关系。

求名：自己的努力已到了收获的季节，应更加虚心，严格要求自己，谨慎小心地实现自己的目标。很可能出现意外，应以刚强的意志去从容对付，过于软弱将失去机会。

婚恋：加紧进行，全力以赴，双方以诚信相待，美满、和谐。

决策：头脑灵活，善于同他人交往，并有主见，具有领导才能。务必加强个人的全面修养，诚信待人，树立良好的个人威望，尤其要有远大的眼光，长久的计划，可以保证事业的发达和前程的光明。

时运：活水流行，好运方来。

财运：经营有成，获利可期。

家宅：家业正旺；两姓和合。

身体：疾病拖延，不致危险。

家运：幸福圆满，切勿意气用事，否则有反。

疾病：病情较轻，为肠胃，口腔之疾，并防泌尿生殖系统病变。

胎孕：生贵子。求佛及家神则安。产妇慎饮食。

子女：得孝顺之儿女。

周转：可成。

买卖：防口舌，勿过急，和顺交易有利。

等人：有好消息且准时到。

寻人：西方或西南方，不必急，目下其人已动，自回。

失物：不能立即发现，很久才能找回。可能被埋在地下，是件会发声或震动的物件。

外出：在准备充分的情况下，立即行动，不必再犹豫。

考试：金榜题名。

诉讼：宜柔不宜刚，因本欲欺他人，反伤自己。

求事：顺利可成。

改行：吉利。

开业：开业正得其时，大吉大利。`,
    description: `这个卦是异卦（下兑上坤）相叠。坤为地；兑为泽，地高于泽，泽容于地。喻君主亲临天下，治国安邦，上下融洽。
    元亨利贞。象征着临近和监督。密切关注，把握机会。`,
    pinyin: 'lín'
  },
  '000011': {
    no: 20,
    name: '上坤下巽 风地观（观卦）观下瞻上',
    qian: '中上卦',
    original: '观。盥而不荐，有孚顒若。',
    meaning: `这个卦是异卦（下坤上巽）相叠，风行地上，喻德教遍施。观卦与临卦互为综卦，交相使用。在上者以道义观天下；在下者以敬仰瞻上，人心顺服归从。

大象：风运行于坤地之上，喻有周游观览之意。阴长阳消，正道衰微，万物难行。

运势：处身于变化之中，宜多观察入微，心身苦恼，并防外来诱惑。处在有危险不稳的时运，耍多观望时势之利弊，待机行事，于人事物，须以诚待之，才能感化而幸免陷入困难也。

事业：事业已出现不顺利的迹象，务必谦虚慎重，高瞻远瞩，尤忌短期行为，心胸开阔，注意搞好人际关系，团结他人，不宜轻率行动。必要时不妨投靠德行高的人，以图再度发展。

经商：市场形势不稳定，正处于变动，应谨慎小心，随时观察动向，从长计议，做好退却的准备。

求名：贵在自知之明，虚心向他人求教，端正处世态度，尤其不可自我满足，更须守中持正，树立远大理想，勿丧失个人追求的目标，勿偏离正道。

婚恋：不顺利，双方应经受住考验，从长计议，会有理想的结果。

决策：具有组织能力，适宜担任负责工作，但人生旅途多曲折，必须注意培养自己的预见性和观察力，办事务必公正，实事求是，注意人心动向，关心他人。尤其不可以陷入小人之道和近视行为之中。应有决断精神，不可盲从，必要时可进行策略依附。

时运：出外游览，不易闲居。

财运：贩卖洋货，须防风险。

家宅：供养神佛。

身体：风湿之症，运动调养。

家运：正处于下坡时段，要知固守进退之机，听取长辈意见有助也。

疾病：有渐恶化之象，病情变化多，为腹、神经系统病症。

胎孕：孕有不安之象。

子女：儿女将来有成就幸福也。

周转：虽有好言，实际内在空虚。无指望居多。

买卖：交易有碍。应在戌亥日可成，否则难成。

等人：观望必有等待，而来者有随他人去之象。

寻人：此人到处漂泊，行踪不定，有险象。目前在西南方，宜丑未日见。

失物：若能细心四察，可以找回来。

外出：有风险，择日而行。

考试：不理想。

诉讼：小人当道，愈争论惹起纷争愈多，但终会和解。

求事：不易。

改行：擅自主张不宜，若由他人提拔则可。

开业：开业者不宜。`,
    description: `这个卦是异卦（下坤上巽）相叠，风行地上，喻德教遍施。观卦与临卦互为综卦，交相使用。在上者以道义观天下；在下者以敬仰瞻上，人心顺服归从。
    盥而不荐。象征着观察和等待。观察形势，等待时机。`,
    pinyin: 'guān'
  },
  '100101': {
    no: 21,
    name: '上离下震 火雷噬嗑（噬嗑卦）刚柔相济',
    qian: '上上卦',
    original: '噬嗑。亨。利用狱。',
    meaning: `这个卦是异卦（下震上离）相叠。离为阴卦；震为阳卦。阴阳相交，咬碎硬物，喻恩威并施，宽严结合，刚柔相济。噬嗑为上下颚咬合，咀嚼。

大象：上唇与下唇间有物，必须咬断，方能合拢，乃诸事被阻，务必去除，方可成功。

运势：诸事阻隔，纷争难免，宜守常规，不为利诱，问题可解决。诸事不遂心，多受阻害。有纷争，无法前进之时，宜守原则，不为利诱，以免被人中伤。然而一般人多有无法逃避利诱者，故必受祸，若能和气处事为安，更须突破困难方可通达。

事业：困难与阻力非常大，应以坚强的意志，果敢的行为，公正无私的态度去战胜种种厄运，争取事态好转。为了早日化险为夷，必要时可采取强硬手段，甚至诉诸法律。

经商：处于不利的时候，头脑冷静，明察形势，寻求机遇，不为眼前小利所诱，不发非分之财。认真听取忠告，遵守法纪，秉公办事，不得徇私情，更警惕不得触犯刑律。

求名：自己的努力尚不为人所知，不可急于求成，受到挫折应看作是对自己的考验，持之以恒，必能成功。

婚恋：初不顺利，须有顽强精神可以取得满意的结果，不可以个人的情绪左右家庭事务。

决策：一生不平坦，会遇到挫折和磨难，但应看作是对个人的考验，应认真总结经验教训，以更为坚强的意志，不屈不挠，继续前进。经过锻炼，各方面都会有较大的进展，终将进入光明境地，取得重大成就。

时运：好运初动，声名直上。

财运：买卖皆成，货物畅销。

家宅：小心火灾；百年好合。

身体：须防郁热，失物不保。

家运：家庭有不和现象，亦常有无法沟通之阻碍。除非彼此能够排除成见，否则无法融洽相处。

疾病：病情严重，注意足部，心脏、神经系统病变。

胎孕：胎有惊。

子女：儿女倔强、反抗。

周转：卦已明示有困难，但诚心或可圆满。

买卖：多阻挠且多是非。但若积极推进，不要放弃，则有利，可成。

等人：受到阻碍，不能来。

寻人：必因发生争端或涉嫌重大事件而出走。去庙观市井求之，东、南方。

失物：有被人捷足捡走的可能，寻回的机会不大。

外出：另择他日为佳。若非出门不可，务必充分准备，小心为是。

考试：不佳。

诉讼：宜采取主动，据理力争。

求事：多生枝节，不利。唯有积极去谋求方有所成就。

改行：有碍，但耐心排除可成。

开业：开业吉，中途有是非，宜耐心解决。`,
    description: `这个卦是异卦（下震上离）相叠。离为阴卦；震为阳卦。阴阳相交，咬碎硬物，喻恩威并施，宽严结合，刚柔相济。噬嗑（shihe）为上下颚咬合，咀嚼。
    亨。象征着决断和行动。果断行事，但需谨慎。`,
    pinyin: 'shì hé'
  },
  '101100': {
    no: 22,
    name: '上艮下离 山火贲（贲卦）饰外扬质',
    qian: '中上卦',
    original: '贲。亨。小利有攸往。',
    meaning: `这个卦是异卦（下离上艮）相叠。离为火为明；艮为山为止。文明而有节制。贲卦论述文与质的关系，以质为主，以文调节。贲，文饰、修饰。

大象：日落西山，照耀通明，华美灿烂，同时喻光明力量渐消，阴暗的力量扩大。

运势：表面风光，内里空虚，必须充实自己，凡事宜踏实、按部就班。卦象是象征其人外表好看，内在空虚，因此，必须充实自己，凡事深思远虑，与人和睦相处，能获得意外利益。切忌因小失大，更无须为了掩饰外观而造成不必要的损失。凡事踏实，按部就班为是。

事业：顺利，小有成绩，宜即时总结经验，图谋更大的发展。树立信心，不计较一时的得失。追求实质性的内容，慎重行事，不要随波逐流，寻求有实力的人物提携自己。

经商：开始会遇到困难，不应灰心，宜全面分析形势，大胆开拓，勇敢地投入，联合他人，共同合作，根据市场，运转业务。

求名：不可过多地注重外表，而应着重于内在的素质。大胆地推荐自己，但应坚持自己的理想。

婚恋：慎重选择，有合适者，则应迫切追求，不可三心二意，务必专一。注重对方的内在气质，勿为表面现象所欺骗。

决策：喜爱注重外表，缺乏追求内在气质的恒心。生性较为浮躁，好务虚名，往往因此而碰壁，或半途而废。在事实的教育下，改变不切实际的做法，明察社会和人生，会有所收敛，变得自持，注重自身修养，成全事业，中年以后会大有作为，老年仍可发挥余热。

时运：上有阻力，不可任意。

财运：经理精明，须防套牢。

家宅：小心火灾。

身体：郁火上升，慎用寒剂。

家运：外美内虚而不为外人所知，应及时整顿家庭经济，使其安稳、充实，更须安份自持，莫以虚浮来掩饰空虚。踏实为上策。

疾病：病情危重，为心脏、胸腹等病。

胎孕：孕有不安之象。

子女：子女身体虚弱，美丽而得人缘。

周转：不宜大，小调尚可。

买卖：有贵人，速决有利。

等人：会来。但远方者不来。

寻人：已在东北或南方亲友家，可寻。

失物：在家中遗失，将可寻回。不妨试试注意门脚的地方。

外出：慎远行。但只要准备充分，注意安全，不会出麻烦。

考试：不理想。但人家以为你读得不错。

诉讼：宜速求解决，不可拖延，可得贵人调解。

求事：条件勿太苛求，可成。

改行：改行宜，但勿夸大或太过。

开业：开业者吉利之象。`,
    description: `这个卦是异卦（下离上艮）相叠。离为火为明；艮为山为止。文明而有节制。贲（bi）卦论述文与质的关系，以质为主，以文调节。贲，文饰、修饰。
    亨小利有攸往。象征着文饰和装饰。外表美化要适度。`,
    pinyin: 'bì'
  },
  '000001': {
    no: 23,
    name: '上坤下震 山地剥（剥卦）顺势而止',
    qian: '中下卦',
    original: '剥。不利有攸往。',
    meaning: `这个卦是异卦（下坤上艮）相叠。五阴在下，一阳在上，阴盛而阳孤；高山附于地。二者都是剥落象，故为“剥卦”。此卦阴盛阳衰，喻小人得势，君子困顿，事业败坏。

大象：山附于地喻山石崩而落于地面上，五阴迫一阳，正义被损。

运势：恶运缠身，宜重新部署，不宜自作聪明，防被女子及小人连累。运带破、带衰，有不利之灾祸，不可抱持野心，自作聪明，否则自掘坟坑。得此卦者，必有与欢场女子耗费钱财而又被陷害之苦恼，且有受部下连累而损财，为不得志之时运也。

事业：时运不佳，乃大势所趋，个人只能顺应时势而暂停行动，静观待变，不可冒险，积极创造条件，增强实力，谨慎隐忍，勿与小人同流。时来运转，成就事业，为期不远。

经商：已从高峰转入低落，进入不景气时期，需要认真总结经验教训，进行整顿，尤其不可孤注一掷。景气形势一旦到来，可顺势从容再起。

求名：成功的可能性不大，不宜执意强求，应继续创造条件，努力提高自己，充实处世的本领，增强实力，待机东山再起。

婚恋：务须慎重考虑，除非有十分般配者，不要随便进行。双方应注意维护家庭的和睦。

决策：一生曲折较多，往往隐入不顺利的境况，甚至绝境，但可绝处逢生。只要冷静分析形势，顽强拼搏，一定会彻底改变命运，获得美好的结果，为他人惊羡。关键是不可急于求成，尤其不可冒险。须顺应时势，并防小人陷害。

时运：时运不佳，安心自守。

财运：出口获利，剥人之财。

家宅：不离己宅，寄居可买。

身体：魂不附体，千万小心。

家运：正处于没落之时，辛苦劳心，有心挽回者可得安，否则有别离之险象。

疾病：病情恶化之象，防头痛、肠胃、性病等疾。

胎孕：虚惊之凶象。

子女：缘薄，不和，体弱。

周转：无望。

买卖：难成。若成亦有损。

等人：不会来。

寻人：在东北方的山上或水边寻之。

失物：目前还隐藏在家中地上，可惜无法发现，不久会被扫走。

外出：暂缓为好。可在充分准备之后动身。

考试：落榜。

诉讼：因财而起纷争，小人当道，宜避之则吉。

求事：顺而止，要谨慎行事，不可粗心大意。

改行：不利，必损财。

开业：开业者有阻碍，切勿意气用事，否则有害，宜再待时。`,
    description: `这个卦是异卦（下坤上艮）相叠。五阴在下，一阳在上，阴盛而阳孤；高山附于地。二者都是剥落象，故为“剥卦”。此卦阴盛阳衰，喻小人得势，君子困顿，事业败坏。
    不利有攸往。象征着剥落和衰退。事物衰退之时，需要韬光养晦。`,
    pinyin: 'bō'
  },
  '100000': {
    no: 24,
    name: '上震下坤 地雷复（复卦）寓动于顺',
    qian: '中中卦',
    original: '复。亨。出入无疾，朋来无咎。反复其道，七日来复，利有攸往。',
    meaning: `这个卦是异卦（下震上坤）相叠。震为雷、为动；坤为地、为顺，动则顺，顺其自然。动在顺中，内阳外阴，循序运动，进退自如，利于前进。

大象：雷在地中振发，喻春回大地，一元始，万象更生。

运势：开运亨通之象，万事不宜急进，按部就班可成。一阳来复，万事苏伸，不久就会好转。初时不宜急进，脚踏实地则有一本万利、开运亨通之象也。

事业：已经渡过了困难时期，开始进入积极行动的阶段。但务必抓住时机，当机立断，却不可急躁，且应时常反省个人行动，严于修身，勇往直前，可望成功。

经商：可大胆投资，与志同道合的伙伴坦诚合作，打开市场，勿因挫折而退缩。更可以打入外地，坚持商业道德，循序渐进，一定会有所赢利。

求名：时机正在成熟，不要急于求成，继续奠定基础，机遇一旦到来，务必要抓住，必将转运。最忌自伤意志。

婚恋：顺利。但切不可性急，应冷静考虑。家庭的美满幸福，靠严于律己维持。

决策：性格活泼，精力旺盛，但因急躁情绪会造成事业损失。一定要冷静思考，勇于改正错误，必能重振事业。此时应抓住时机，明确方向，灵活机敏，脚踏实地改变处境。一旦出现意外，宜当机立断，暂行退让。如能准确驾驶自己，努力奋斗，成就事业十分顺利。

时运：好运初来，静待发动。

财运：暂停售物，必可获利。

家宅：待春再迁；婚嫁初春可成。

身体：有痰上火，冬令宜防。

家运：昌隆茂盛，渐曙光明之象。

疾病：病防发，但可治，为肝、肠胃、神经系统病变。

胎孕：主产母有惊惧之灾。

子女：辛劳之后必得享福，儿女将来会出人头地。

周转：难求，反覆终可入手。

买卖：有是非，故勿太急，可有利。

等人：会迟到。

寻人：自身反覆终人不动，但七日内可回。

失物：有失而得之可能。

外出：无灾无祸，且有收获。

考试：愈考愈好。

诉讼：多人之事，但经多次扰攘才可解决。

求事：勿太急，可成。

改行：可行，但宜沉着，勿急躁。

开业：开业者可行，但宜沉着，勿急躁。`,
    description: `这个卦是异卦（下震上坤）相叠。震为雷、为动；坤为地、为顺，动则顺，顺其自然。动在顺中，内阳外阴，循序运动，进退自如，利于前进。
    元亨。象征着返回和重复。万物复苏，重新开始。`,
    pinyin: 'fù'
  },
  '100111': {
    no: 25,
    name: '上乾下震 天雷无妄（无妄卦）无妄而得',
    qian: '下下卦',
    original: '无妄。元，亨，利，贞。其匪正有眚，不利有攸往。',
    meaning: `这个卦是异卦（下震上乾）相叠。乾为天为刚为健；震为雷为刚为动。动而健，刚阳盛，人心振奋，必有所得，但唯循纯正，不可妄行。无妄必有获，必可致福。

大象：雷动于天，阳气舒发，为真实无虚妄之意。

运势：凡事宜守正，若行为不检者，必招灾祸。无妄的道理是提醒要真实无虚，踏实。故若做事操守而能坚贞固执者吉。若不行正道，行为不检点者，必然有灾祸至也。切忌沉醉于利、欲之中，慎之。

事业：贵自知之明，从个人实际出发，不抱非分之想，脚踏实地，勤奋努力，检点行为，防意外灾祸。不计较得失，诚心追求，待机而动，事业必成。

经商：切勿勉为其难，遵循市场规律，讲究商业道德，屏弃投机心理，勿贪暴利，经过辛勤努力，日积月累，必将成功。

求名：以良好的动机，刻苦努力，丢弃幻想，但问耕耘，不问收获，终将有所获。

婚恋：双方务以诚相待，绝不可抱以轻率的态度，亦不宜急于求成、顺其发展，水到渠成。

决策：精力充沛，富有上进心，可有作为。但务必勤勉努力，诚心诚恳，奋发向上，刻苦钻研。不可因小有成就而得意忘形。不必追求所得，而应追求实干。遵循规律办事，等待时机再行动。尤其应清除非份的念头。这样，可实现自己的理想。

时运：正当好运，诸事皆宜。

财运：货到财来，自然开心。

家宅：屋运甚旺；门当户对。

身体：保持运动，自可消化。

家运：有不和之情况，因受外界诱惑而心乱，须谨慎，否则导致破运。

疾病：不宜意气用事，应尽力疗养为宜，属呼吸系统，头、足之疾病。

胎孕：或有惊，终无碍。

子女：注意与其父不和而离家出走。

周转：诚心有望，不诚免谈。

买卖：若不要过份苛求，有利。

等人：一定会来。但有不欢而散之象，宜以和为贵。

寻人：已走远，不易寻找，东北或西北之向。

失物：找不到，似已遗失。

外出：不存妄想则平安无事。为谋私利或邪念而行则大为不利，不宜行。

考试：笔试有利，口试不利。

诉讼：因女人或死亡之事起纷争，宜和解，否则招凶。

求事：毫无头绪，勿过于草率为宜。

改行：不宜勉强。

开业：开业者可行。`,
    description: `这个卦是异卦（下震上乾）相叠。乾为天为刚为健；震为雷为刚为动。动而健，刚阳盛，人心振奋，必有所得，但唯循纯正，不可妄行。无妄必有获，必可致福。
    元亨利贞。象征着天真无妄。行事要真诚不妄为。`,
    pinyin: 'wú wàng'
  },
  '111001': {
    no: 26,
    name: '上艮下乾 山天大畜（大畜卦）止而不止',
    qian: '中上卦',
    original: '大畜。利贞，不家食，吉。利涉大川。',
    meaning: `这个卦是异卦（下乾上艮）相叠。乾为天，刚健；艮为山，笃实。畜者积聚，大畜意为大积蓄。为此不畏严重的艰难险阻，努力修身养性以丰富德业。

大象：天之大而在山之中，以小阻大，以阴畜阳，为止为养。

运势：处事不可好高骛远，宜脚踏实地，可成大业，忌目空一切。大凡诸事不可好高鹜远，脚踏实地、务实行事，始能成就大业。以蓄德为主可吉，若因得势而气盛凌人，目空一切者，终招失败之象。

事业：务必端正行为，修养德行。行为应大胆、果断，但需适可而止，注意休整，决不可冒险闯进。宜注意吸收前人的经验教训，有所畏而不行，否则必有危害。再取得成就之后，应适可而止，不可贪图眼前小利而走向反面。

经商：本着循序渐进的原则，把握正当的商业道德，会有重大收获。此时，切忌贪心不足，而应见机而退，保守事业，深思熟虑，再图发展，一味自信冒进，决不可取。

求名：注意积累学问，提高德行，勿三天打鱼两天晒网，持之以恒，且以学问、知识报效国家，抱负终将实现。

婚恋：顺利。建立在共同勤俭持家的基础上，相互坦诚而待，美满幸福。

决策：蓄财的人，但决不可抱投机取巧心理，得靠个人诚实工作，多动心机，真诚与他人合作，共创事业，困难时仍应持正道，尤其不可粗心大意，牢记成就大阻力也大的道理。

时运：守静二年，方可展运。

财运：暂时株守，良机必至。

家宅：家业日隆；婚姻大吉。

身体：健康有力。

家运：须知蓄者以备急需也。明此道理，持之力行，则可亨通。

疾病：病虽重，但可治，防胸肺，腹或手部之病，易积劳成疾。

胎孕：占得此卦主生贵子。

子女：儿女必声扬家风，可得幸福之象。

周转：可成。

买卖：再谈可成交 ，且有获大利之象也。

等人：不会来。

寻人：途中虚险，若一人等待必有凶。若是出走者，不必寻，会自回。

失物：有机会寻回。似是在圆形有盖盛存之物中。

外出：不宜守于家中，出行必得，且畅通无阻。不过应处处小心谨慎。

考试：上榜。

诉讼：因房地产引起，有破财之象，但纠纷可解。

求事：不利，宜再待时。

改行：不宜。

开业：开业者要有不怕挫折之决心全力以赴，有利可得。`,
    description: `这个卦是异卦（下乾上艮）相叠。乾为天，刚健；艮为山，笃实。畜者积聚，大畜意为大积蓄。为此不畏严重的艰难险阻，努力修身养性以丰富德业。
    利贞。象征着积蓄和储存。当前适合积累实力，不宜轻举妄动。`,
    pinyin: 'dà xù'
  },
  '100001': {
    no: 27,
    name: '上震下震 山雷颐（颐卦）纯正以养',
    qian: '上上卦',
    original: '颐。贞吉。观颐，自求口实。',
    meaning: `这个卦是异卦（下震上艮）相叠。震为雷，艮为山。山在上而雷在下，外实内虚。春暖万物养育，依时养贤育民。阳实阴虚，实者养人，虚者为人养。自食其力。

大象：形如口腔之象，取其饮食之道，须慎言，注重日常生活。

运势：处事欠缺周详考虑，不宜心怀阴谋，要守正道而善方吉。先苦后甜，失败后成功型，物质金钱运佳，乐善好施，贵人多助。不断提升修养自己，容易得到社会好的名声。

事业：凡事得靠个人追求，自己奋斗，而不能依赖他人。更不得用不光彩的手段谋求财物。只要遵循正道，自食其力，谨言慎行，一定会有好的机遇。这时，经过一番艰苦奋斗，能够成功。

经商：不得急于求成，应谨慎小心，循序渐进，诚以待人，真诚与他人合作，因时制宜，不断追求新的开拓方向，必要时可适当冒险。

求名：以丰富自身知识为目的，知足安乐，刻苦努力，成功的希望极大。

婚恋：不可急于求成，关键在于加强自己的修养。一旦选中应全力追求，尤其不可三心二意。

决策：注意道德修养，乐于尽力而为地去帮助他人，救人急难，不贪求不应得到的财物。因此，能受到他人的尊重，也能不断得到外来的援助，个人事业十分顺利，成功的可能性很大。尤其不可粗心大意，牢记成就大阻力也大的道理。

时运：生机显达，谨言慎行。

财运：内外升降，未必流通。

家宅：小心防火；贤妇从夫。

身体：上寒下热，五日乃愈。

家运：陷于痛苦深渊，有身败名裂之象，宜改进言行，冷静反省，力求幸福才是。

疾病：占病为凶，久病者险，为肠胃、咽喉、手足之疾。

胎孕：宜求香火保佑。

子女：过份溺爱反有害。尤其须注意儿女健康，以免日后因身体虚弱而不能获福。

周转：是否成功，要看自己是否有诚心。

买卖：守旧为宜，不宜谋求新事，否则不利。

等人：难来，中途有碍。

寻人：不久相逢。东北或东之向。

失物：尽快去找，似被物件上下夹着。

外出：应慎重，不宜过多外出。如无充分准备，仓促出行，将可能会遇到凶险。

考试：尚可。

诉讼：我告他人终不能成，宜速和解。

求事：不成。

改行：不宜，勿勉强。

开业：开业者不利，须再待时。`,
    description: `这个卦是异卦（下震上艮）相叠。震为雷，艮为山。山在上而雷在下，外实内虚。春暖万物养育，依时养贤育民。阳实阴虚，实者养人，虚者为人养。自食其力。
    贞吉。象征着养育和滋养。注重修养，培养实力。`,
    pinyin: 'yí'
  },
  '011110': {
    no: 28,
    name: '上巽下兑 泽风大过（大过卦）非常行动',
    qian: '中下卦',
    original: '大过。栋桡。利有攸往，亨。',
    meaning: `这个卦是异卦（下巽上兑）相叠。兑为泽、为悦，巽为木、为顺，泽水淹舟，遂成大错。阴阳爻相反，阳大阴小，行动非常，有过度形象，内刚外柔。

大象：中间四阳爻，为结实之梁，但初末为阴爻，力弱不支，则势将摧折。

运势：有力不从心，负担过重之象，多烦恼，防官非及水险。诸事衰退，多烦恼，防官非及水险。有力而不从心，负担过重之象。逢挫折而将坠落之时运，故得此卦者，凡事切忌轻举妄动，否则有过。

事业：事业出现隐患，甚至危机四伏，务必十分小心谨慎，唯有坚守中道，以谦虚和悦的手段，胆大心细，求助他人相助。必要时可采取非常手段，不拘常规，予以冒险。

经商：操之过急，发展过快，宜收缩调整。竞争处于不利地步，切勿过度自信，更不得刚愎自用，宜随时观测风向，待机行动。在有确切把握之下，不妨冒险，争取时机的好转。

求名：最忌不务实际，追求不切实际的虚名，以致盛名不符。唯以谦逊态度，谨慎行动，潜心努力，不怕世人眼舌，一往直前，追求最初的目标。

婚恋：自知之明最为重要，不可急于求成，应慎重考虑，并以正当手段，促成事情的成功。但也不排除必要的精明手段。

决策：处在非常时期，若不能妥善处置，则极为不利，针对实际情况，既不可轻举妄动，也不可优柔寡断，而应刚柔相济，虚心征求他人意见，慎重行动，大胆追求，却又不怕流言，争取时局好转。

时运：收敛自省，未可求名。

财运：低价高涨，不易把握。

家宅：防止倾斜；老少配婚。

身体：肝肾皆累，不易治好。

家运：困难重重，摇摇欲坠之衰运。夫妻感情不睦，且均有向外发展之趋势，若想挽回此破象，双方宜改正自己的缺点，否则破裂也。

疾病：严重，须耐心治疗，为肺、神经系统，女占得妇科经带之疾。

胎孕：女儿或男儿均与六亲缘薄，育养困难。

子女：子女与双亲间感情薄弱，又缺乏谅解，有症结也。

周转：无啥希望。

买卖：不可做超过自己本身财力之生意交易，否则定有折损，亦不成。

等人：不会来。

寻人：不易找到，可向东南方或西方，难寻。但若动用人手共寻找，可见。

失物：无法发现，不能物归原主。

外出：行动务必慎重，但不可过于拘泥，必要时不妨采取特殊行动。

考试：苦恼也，不佳。

诉讼：有文书之烦，即使求和也未能如愿。

求事：困难很多。

改行：不宜图不相应之事。

开业：开业尚属虚，且待时候。`,
    description: `这个卦是异卦（下巽上兑）相叠。兑为泽、为悦，巽为木、为顺，泽水淹舟，遂成大错。阴阳爻相反，阳大阴小，行动非常，有过度形象，内刚外柔。
    栋桡。象征着过度和失衡。行事过度，需要调整。`,
    pinyin: 'dà guò'
  },
  '010010': {
    no: 29,
    name: '上坎下坎 坎为水（坎卦）行险用险',
    qian: '下下卦',
    original: '坎。习坎，有孚，维心亨，行有尚。',
    meaning: `这个卦是同卦（下坎上坎）相叠。坎为水、为险，两坎相重，险上加险，险阻重重。一阳陷二阴。所幸阴虚阳实，诚信可豁然贯通。虽险难重重，却方能显人性光彩。

大象：两水重叠，坎水为险，进固险，退亦险，进退两难。

运势：危机重重，宜沉著应付，保持心境开朗，凡事莫与人争。危机重重，宜容忍自重，保持心境开朗，沉着应付，则可有脱险之机。吃得苦中苦，方为人上人，凡事莫与人争长短，否则有不幸灾害。

事业：陷入重重艰难险阻之中，险况丛生。既不得冒险，也不可束手待毙，应以积极态度，努力创造条件，改变处境，化险为夷。务必实心实意，充满信心，不图侥幸，不辞艰险，宜静观待变，运用智慧，突破险境，转危为安。

经商：十分不利，甚至陷入面临破产的境地，但内心应沉着踏实，保持头脑冷静，身陷险境而心不陷，勿轻举妄动，先求自保以观变，把握时机以脱险。

求名：不为他人理解，怀才不遇，千万不可自暴自弃。不改初衷，泰然自若，循序渐进，终可为人理解和发现。

婚恋：多遭不利，应冷静分析原因，积极改变自身条件。双方同舟共济，共渡难关。

决策：不幸。然而是转运前的考验。只要能不因困境而失常，且不图侥幸，保持信心，勿自陷险境。镇定自若，不轻举妄动，洞察时机，必可转危为安，成出险之功。

时运：逐步升迁，随时防患。

财运：财如流水，商运亨通。

家宅：邻居营造；亲上加亲。

身体：水泻之症，虔心祷告。

家运：时运不济，陷于困境之中，不和，且有分裂之忧，凡事宜慎重行事。

疾病：病重宜速治，否则难救，注意肾脏，膀胱生殖器病。

胎孕：临产有虚惊，难产之象。

子女：子女多劳苦，宜忍辱负重，会有出人头地的一天。子女宜防水厄之灾。

周转：难成。

买卖：亏损。

等人：不来。

寻人：此人因家庭不和或不得志而出走，速寻北方水边。

失物：找不回来。有失窃可能，或沉在水底。因坎水有困难之意。

外出：大胆外出，另辟新路，必有所成，且得到他人相助。

考试：不理想。

诉讼：有盗贼之讼，或田土之争，有理说不清，凶象。

求事：不利。

改行：不宜，应暂时守住本行。

开业：开业者不利，有陷入困难之象。`,
    description: `这个卦是同卦（下坎上坎）相叠。坎为水、为险，两坎相重，险上加险，险阻重重。一阳陷二阴。所幸阴虚阳实，诚信可豁然贯通。虽险难重重，却方能显人性光彩。
    有孚维心。象征着陷入困境。处境困难，需要坚守正道。`,
    pinyin: 'kǎn'
  },
  '101101': {
    no: 30,
    name: '上离下离 离为火（离卦）附和依托',
    qian: '中上卦',
    original: '离。利贞，亨。畜牝牛，吉。',
    meaning: `这个卦是同卦（下离上离）相叠。离者丽也，附着之意，一阴附丽，上下二阳，该卦象征火，内空外明。离为火、为明，太阳反复升落，运行不息，柔顺为心。

大象：两离火相重，上下通明之象，火有气，但无形，主不实不定之意。

运势：外观极盛，烈日当空之象，凡事不宜急进及意气用事。虽然目前外观极盛一切顺利，可能为假象、虚象，而且双火之燃，其内部、内情已有所损，又双火之烈，如烈日中天，故凡事宜守之，勿太急进，待人以谦和、理性，否则必有所损失。宜顺从长辈，勿因急躁而妄动或意气用事，则可欣欣向荣也。

事业：已快进入顶点，盛极而衰，务必总结经验教训，趋善避邪，以顺自养，居危知危，激励志气，切勿妄动。尤应求助中正的人援助，以期重振事业。

经商：不要急于求成，宜兢兢业业，忧深虑远，考察市场行情，公平竞争，不可投机取巧，争取与他人密切合作。

求名：方向未确定之前，不可到处乱撞，应持之以恒，执意追求，虚心向有才德的长者请教。

婚恋：自己寻找对象恐怕有困难，最好请可靠的朋友、长辈帮忙，不得急躁。双方应相互尊敬，最忌生邪念。

决策：乐天知命，顺应自然，年轻时急于上进，未能实现理想，但坚持中正、谦和，可无灾祸，时常警觉，更可化险为夷。在危难时要寻求依托，但要慎重选择对象。晚年应知天命，尤不可不顾时势而轻举妄图动。

时运：努力修德，前途光明。

财运：与火有关，皆有所得。

家宅：贵人之屋；可得继室。

身体：热病严重，小心大去。

家运：富有幸福之运，必须保持仁和谦恭，骄傲自大者易招致失败，宜谦逊处世。

疾病：急病可解，久病则凶，宜耐心调养、为心脏眼科血疾。

胎孕：胎有不安。产母不宜出外游。

子女：子女幸福，但有娇生惯养之嫌，勿疏于教导为上。

周转：可得到上辈的帮助渡过难关。

买卖：交易必得利，忌用不法手段。

等人：一定会来。

寻人：此人因受到诱惑或煽动而出走。南方可寻，且小有是非。

失物：动作快，可寻回。

外出：可行动，事先应准备充分，不可仓促上路。

考试：成绩不错。

诉讼：只宜人侵己，不宜己侵人，主动者不利。

求事：尊重长辈安排。待时机可获良好事业。

改行：可极力推展。

开业：开业者吉象。`,
    description: `这个卦是同卦（下离上离）相叠。离者丽也，附着之意，一阴附丽，上下二阳，该卦象征火，内空外明。离为火、为明、太阳反复升落，运行不息，柔顺为心。
    利贞亨。象征着光明和文明。光明在前，前途光明。`,
    pinyin: 'lí'
  },
  '011100': {
    no: 31,
    name: '上兑下艮 泽山咸（咸卦）相互感应',
    qian: '中上卦',
    original: '咸。亨，利贞，取女吉。',
    meaning: `这个卦是异卦（下艮上兑）相叠。艮为山；泽为水。兑柔在上，艮刚在下，水向下渗，柔上而刚下，交相感应。感则成。

大象：少男在少女之下，彼此感应，象征新婚，两性交感。

运势：如意吉祥，但勿为不正当感情而意乱情迷。吉祥如意。但勿为不正当的感情而意乱迷惑，或过于冲动。然得此卦时，会有男贪女爱之争，非名正者必遭损，宜慎之。

事业：和为贵，和则万事兴，务以诚感人，以诚待人。广泛交往朋友，谦虚礼让。树立大志向，坚持主见，不可盲目随大流。不利时应安居待机，不可妄动强求。

经商：有利可图。但应以纯正之心，以诚待人，加强合作。市场若不景气，决不可妄动，不可强求，而应静待发展，虚心听取不同意见。

求名：志向应宏大，脚踏实地，虚心请教他人，使人悦而应，帮助、重用自己。切莫自我封闭，更不得冷漠孤僻，以广阔的胸怀发展自身。

婚恋：成功的可能性极大。双方很有感情，但动机务必纯正，婚姻方可幸福、永久。

决策：吉祥如意。人际关系好，善于交际。以真诚的态度，无私的心去处世，不会有不利的地方。与他人合作应坚持原则。办事不可优柔寡断。不顺利时，应停止行动，总结经验，以图发展。待人诚恳，但不可与玩弄口舌的小人交往，防止受骗。

时运：谦虚待人，可保功名。

财运：转运贩卖，必可图利。

家宅：知其所止；两性合好。

身体：虚弱宜补。

家运：目前非常融洽，而后亦然。如夫妇间另有不正当之交往者，宜明哲保家，避免有越轨情事为宜。

疾病：防泌尿系统病，肠胃病及性病等，须疗养得法，否则不利。

胎孕：有兴家和泰之运。

子女：感情极融洽，幸福。

周转：可成。

买卖：交易可成有利。

等人：会带来好消息。

寻人：因色情之事出走，不久会出现。其人有在住处动身不得之忧，恐有些是非。

失物：尽速找寻，可以取回，延误时机，则找不回来。

外出：虽希望外出，但暂时不宜远行。待时机成熟时再出行。

考试：成绩佳。

诉讼：提防桃色纠纷，诸事宜和解，有贵人相助。

求事：皆能如偿所愿。

改行：吉利，可进行。

开业：大吉大利。`,
    description: `这个卦是异卦（下艮上兑）相叠。艮为山；泽为水。兑柔在上，艮刚在下，水向下渗，柔上而刚下，交相感应。感则成。
    亨利贞。象征着感应和交流。与人交往要真诚。`,
    pinyin: 'xián'
  },
  '110001': {
    no: 32,
    name: '上巽下震 雷风恒（恒卦）恒心有成',
    qian: '中上卦',
    original: '恒。亨，无咎，利贞。利有攸往。',
    meaning: `这个卦是异卦（下巽上震）相叠。震为男、为雷；巽为女、为风。震刚在上，巽柔在下。刚上柔下，造化有常，相互助长。阴阳相应，常情，故称为恒。

大象：震者为动，宜向外发展，巽为入，为内向，一内一外，各居本位，故能永恒不变，喻夫妇之道。

运势：万事亨通，能恒久努力，安守本份则吉，妄动则招灾。诸事亨通而没有犯错方能恒久。其象利于正常固守，并须有毅力持行。雷风者，知守常则吉，妄动者则不能亨通。

事业：诸事无不成于恒，持之以恒，必有成效。恒乃成功之本。为此，务必动机纯正，守静而勿躁动，不可急于求成，也不可固守死道，应从个人实际出发。最忌人云亦云，最宜随机应变。如此，诸事顺而成。

经商：大胆行动，有所往必有所利。注意市场行情和周围的情况。随时变化经营策略，但不得改变常理常道，坚持慎重选择的方向，勿追随潮流。忌不自量而冒险强求。

求名：有始有终，善始善终，立于正道，坚持不懈，学习方面尤应提高涵养，必可成。

婚恋：好事多磨，有曲折，唯不可见异思迁，和睦相处，勿固执己见。

决策：循序渐进，不要在一开始时期望过高，但不能因此放弃追求，应脚踏实地，从实际也发，不要好高骛远，更不可不自量，勿冒险激进，勿反复无常。坚信宇宙常新，不断修正自己的见解，补充新内容。

时运：努力耕耘，不可躁进。

财运：贸易之地，不可更改。

家宅：方向不改；百年好合。

身体：气喘有痰，仍服旧方。

家运：全家上下均各循正轨而行，幸福家庭也。

疾病：为慢性及须长期治疗之疾。注意肝之疾。

胎孕：胎有烦恼，但无碍。

子女：与双亲感情融治，幸福之至。

周转：不成问题。

买卖：有贵人，得力终成。利益双收。

等人：迟到。

寻人：外出之人平安无事，会自己回来。

失物：不能寻回。

外出：果敢行动，有利。

考试：会得高分。

诉讼：小人招祸，但宜速战速决，不利拖延，宜和解。

求事：向东南有利。

改行：忌做无妄之事，需注意风险。

开业：吉利可行。`,
    description: `这个卦是异卦（下巽上震）相叠。震为男、为雷；巽为女、为风。震刚在上，巽柔在下。刚上柔下，造化有常，相互助长。阴阳相应，常情，故称为恒。
    亨无咎。象征着持久和恒常。保持恒心，坚持到底。`,
    pinyin: 'héng'
  },
  '111100': {
    no: 33,
    name: '上乾下艮 天山遁（遁卦）遁世救世',
    qian: '下下卦',
    original: '遁。亨，小利贞。',
    meaning: `这个卦是异卦（下艮上乾）相叠。乾为天，艮为山。天下有山，山高天退。阴长阳消，小人得势，君子退隐，明哲保身，伺机救天下。

大象：山在天之下，阴渐长，而阳渐消，宜退避三舍。

运势：小人道长，君子道消，凡事宜退不宜进，穷则独善其身，修身养性。小人道长，君子须远离小人，诸事宜守。艮者，止也，言行物事要谨慎，才能得安而运泰。若遇小人之害，见陷于是非之地，勿管闲事，识时务为俊杰。

事业：时运不佳，应考虑退隐，勿与不正派的人同流合污。但不是消极逃避，而是为保存实力，总结经验，把握时机，待机而出。切忌贸然行事，造成不必要的损失。同时勿为眼前小利禄所诱惑。

经商：市场进入衰落的状况，行情不佳。决不可执意追求，盲目投入，而应沉着冷静，坚持商业道德，远离小人、奸商，保存自己的实力，等待市场行情好转，再图发展。

求名：明哲保身，甘居退隐。全力总结提高，为复出做准备。

婚恋：勿急于解决，更不可妄动强求。时机成熟时，须以纯正的态度去正确对待。

决策：处于衰败时期，小人得志。盲目行动必遭不利。虽不必以恶报恶，但更不可同流合污，因小失大，因权宜轻重，韬光养晦，保存实力，断然离去，不可犹豫不决。潜心发展个人实力，隐忍待机。只要能坚定正道，坚持中正，必可在时机成熟时复出，成就大业。

时运：最好退隐，君子有吉。

财运：物价涨跌，相去甚远。

家宅：须防作祟；婚姻不宜。

身体：避居吉地。

家运：须多积德行善，可得安祥。若常争端则衰运，且有别离之象、离婚之象。若曾数经波折之君子，历尽沧桑，则有先恶??后吉之运。

疾病：病重，注意血气不调、头、背、筋骨不良之疾。

胎孕：母子不安，慎之。

子女：儿女体质虚弱，有亲子不和之象。

周转：不成，有碍。

买卖：宜守，不能进取大事，否则失败。

等人：遁，藏也。不能来。

寻人：下落不明，为家庭之事而离乡背井，寻亦难觅。

失物：失落远处，不能寻回。

外出：不宜积极行动，而应等待时机，创造条件，争取早日而行。

考试：不理想。

诉讼：强行争取亦不利，宜罢手逃避反吉。

求事：须待时机。

改行：不得时。

开业：开业不利。`,
    description: `这个卦是异卦（下艮上乾）相叠。乾为天，艮为山。天下有山，山高天退。阴长阳消，小人得势，君子退隐，明哲保身，伺机救天下。
    亨小利贞。象征着退避和遁逃。适时退避，保存实力。`,
    pinyin: 'dùn'
  },
  '001111': {
    no: 34,
    name: '上震下乾 雷天大壮（大壮卦）壮勿妄动',
    qian: '中上卦',
    original: '大壮。利贞。',
    meaning: `这个卦是异卦（下乾上震）相叠。震为雷；乾为天。乾刚震动。天鸣雷，云雷滚，声势宏大，阳气盛壮，万物生长。刚壮有力故曰壮。大而且壮，故名大壮。四阳壮盛，积极而有所作为，上正下正，标正影直。

大象：雷声响亮，光明天际，为正大光明之象，又为强烈地动之象，为六冲卦之一。

运势：运势虽强，但已届极盛之时，宜心平气和，否则反招失败，须知物极必反。刚强过盛者，若不思正与顺，则有躁动之害耳。虽运势强大，时至当盛之期，但忌血气方刚。处事欠思虑而遭破运，宜力持和平、顺气，勿得罪人，否则会因此而招来失败，切勿贪妄。

事业：处世凭智不凭力，有勇更有谋，切忌蛮干，该守不守，自取其凶。不可逞强，否则自取凶险。对小人应有防犯，尤其不得忽视小人的奸诈。对事业应勇往直前，但切忌冒进。

经商：处在高涨阶段，形势很好。但决不可逞强，更不可妄动，应主动增强与他人的合作。提高警惕，认识物极必反的道理，做事业衰退的准备。

求名：务必注意妥善地运用自己的力量，不可自恃刚健强壮而冒进，尤其不可自负。适当发挥自己的才干，加上外力的援助，必有所作为。

婚恋：决不可因自己条件好而高傲。切勿错过好姻缘。

决策：强健适中，不可过分消耗自己的力量。在事业顺利的时刻，尤其不可妄动。更应注意，很可能已经处于进退维谷的状态，务必自保待机，及早有所准备。

时运：成名不难，不可骄傲。

财运：得价即售，不可过贪。

家宅：小心防火；相敬如宾。

身体：保养脚部。

家运：已壮大且富有，但亦有似成而空之感。

疾病：生平少病者遇此卦则不利，注意急性呼吸道感染和脑疾等。

胎孕：子母有难非喜。

子女：儿女有自视太高，目中无人之情。

周转：勿再三借贷，如此反而不利。

买卖：可成功与获大利，但往后要小心，有反遭不利之情况。

等人：迟来。

寻人：为斗气而出走，若寻找途中不见，则难查下落，东方或西北方。

失物：不能取回。

外出：慎重外出，不可莽撞，否则不吉利。

考试：有好成绩，但勿太骄傲。

诉讼：忌与人斗气，宜和解收场，否则两败俱伤。

求事：可顺利，勿太刚强行事。

改行：可，不过勿太勉强。

开业：吉利。`,
    description: `这个卦是异卦（下乾上震）相叠。震为雷；乾为天。乾刚震动。天鸣雷，云雷滚，声势宏大，阳气盛壮，万物生长。刚壮有力故曰壮。大而且壮，故名大壮。四阳壮盛，积极而有所作为，上正下正，标正影直。
    利贞。象征着强盛和壮大。势头正盛，但不可过于刚强。`,
    pinyin: 'dà zhuàng'
  },
  '000101': {
    no: 35,
    name: '上离下坤 火地晋（晋卦）求进发展',
    qian: '中上卦',
    original: '晋。康侯用锡马蕃庶，昼日三接。',
    meaning: `这个卦是异卦（下坤上离）相叠。离为日，为光明；坤为地。太阳高悬，普照大地，大地卑顺，万物生长，光明磊落，柔进上行，喻事业蒸蒸日上。

大象：日出地面，普照大地，有光明上进之象。

运势：事业、名望、财运皆吉，所谓有加官晋爵之兆。事业繁荣，声誉渐高，于人、事、物均获宏利之际，与人共事者吉。但要知进德虚怀，即是诸凡对人、事宜谨守德操，不可傲溢心怀，否则有破象也。但财运旺。

事业：顺利。应遵守正道，迎难而上，克敌制胜，因势利导。树立良好的人际关系，深得人心。全力以赴，不得有丝毫犹豫不决，更忌优柔寡断，而应败不馁，勇往直前。注意和衷共济，共同前进。

经商：行情好，市场竞争顺利。但也会遇到一些困难，要迎难而上，因势利导，克敌制胜，争取众人支持。前进中的挫折不可免，只要动机纯正，必可转危为安。

求名：经过刻苦努力与奋斗，已具备开拓事业的基础，却因无人引荐，暂时不得志，决不可因此自暴自弃，须耐心等待时机。同时，更加积极地创造条件。

婚恋：吉星高照。会有理想的结果，但决不可自恃条件优越而抱无所谓的态度或过于挑剔。

决策：处于不断上升的形势，不会有过大的阻力。但务必争取众人信任，获取人心，再接再厉，只要动机纯正，克服侥幸心理，必有喜从天降。

时运：好运新来，步步高升。

财运：光亮之业，最有利润。

家宅：阳光之屋。

身体：自知之明。

家运：虽如日中天，切不可过于骄纵、蛮横，若为人不行正道，虽然光明就在眼前，且兴隆幸福，又难免夫妇失和，家运不振。

疾病：久病者凶，近病无妨，注意胃肠、心脏之疾。

胎孕：平。

子女：多才智，聪明而贤孝。

周转：可获得强大资金。

买卖：进取得利，并获得巨财。

等人：女者会来，男者不一定会来。

寻人：见于西南方或南方。

失物：动作快，可以寻回来。似是在地上的箱子之类藏着。

外出：克服犹豫心理，大胆前进，可无往而不顺。

考试：科甲登榜。

诉讼：最终能圆满解决。

求事：受人提拔，可有成就。

改行：可行。

开业：吉利。`,
    description: `这个卦是异卦（下坤上离）相叠。离为日，为光明；坤为地。太阳高悬，普照大地，大地卑顺，万物生长，光明磊落，柔进上行，喻事业蒸蒸日上。
    康侯用锡马。象征着前进和晋升。事业上升，但需谨慎。`,
    pinyin: 'jìn'
  },
  '101000': {
    no: 36,
    name: '上坤下离 地火明夷（明夷卦）晦而转明',
    qian: '中下卦',
    original: '明夷。利艰贞。',
    meaning: `这个卦是异卦（下离上坤）相叠。离为明，坤为顺；离为日；坤为地。日没入地，光明受损，前途不明，环境困难，宜遵时养晦，坚守正道，外愚内慧，韬光养晦。

大象：太阳掩没在坤地之下，大地黑暗，有失明之象。

运势：百事阻滞，小人加害，遇事多迷惑，宜守，静待时机而动。逆势下降，时运未济，万事劳苦，逢小人加害，光明受到掩蔽而失光明，所以多艰难之运也。有万事阻滞，遇事迷惑、受灾。故宜守贞固之道，忍耐自重，等待时机 。

事业：处于不利的环境，宜心境坦然地处置险恶的条件，增强心理素质，承受各种压力。表面柔顺小心，内心洞察事理，当离去则离去，避免灾祸，脱离危险。防患于未然，坚持逆境中奋斗。

经商：认真观察市场动态，待机行动，但须坚持商业道德，即使处于不利情况下，也要冒险向前，特别是要向南方发展，会大有收获。

求名：内心保持大志，行动刻苦忍耐，奋斗于逆境，自守其志，收敛聪明而不外露，于混乱中更应坚持正义，守愚藏拙。

婚恋：必须全面分析对方情况，不能因小失大。注意大节。

决策：处在不佳的状况下，环境困难，前途不明。但若能坦处厄运，能伸能屈，前景会变光明。尤其应加强修养，隐忍行志，外愚内慧，可以遇难呈祥。如能谨慎行事，处处小心，更能有所作为。

时运：明哲保身，以避灾厄。

财运：明无利润，暗中分红。

家宅：父子分居为宜；不是明媒正娶。

身体：肝大郁积，注意保养。

家运：衰弱、多劳，家人受累，恐有诈欺、官符。须知邪恶之人定有因果，凡事心地坦荡可渡难关也。

疾病：凶象。为潜伏已久之疾，注意心脏、腹部之疾或神经病。

胎孕：产母有惊。

子女：受子女牵连，陷于痛苦深渊之中。

周转：不成。

买卖：难成，用谋方就。

等人：不来。

寻人：西南或南方，虽在附近但难寻。

失物：不能立即寻回。正当要遗忘这件事时，会意外地有所发现。

外出：最好不要马上行动，再等待一个时期，做好充分准备。

考试：无望。

诉讼：败象，宜和解了事，愈争愈苦。

求事：日下无希望，须再待时，需防被骗、失财、失身。

改行：不利。

开业：不宜，亦不成事。`,
    description: `这个卦是异卦（下离上坤）相叠。离为明，坤为顺；离为日；坤为地。日没入地，光明受损，前途不明，环境困难，宜遵时养晦，坚守正道，外愚内慧，韬光养晦。
    利艰贞。象征着晦暗和隐藏。处于困境，需要隐忍。`,
    pinyin: 'míng yí'
  },
  '101011': {
    no: 37,
    name: '上巽下离 风火家人（家人卦）诚威治业',
    qian: '下下卦',
    original: '家人。利女贞。',
    meaning: `这个卦是异卦（下离上巽）相叠。离为火；巽为风。火使热气上升，成为风。一切事物皆应以内在为本，然后伸延到外。发生于内，形成于外。喻先治家而后治天下，家道正，天下安乐。

大象：风吹火之象，助火之威，喻家人同心协力，发展事业。

运势：平安大吉，与人合作则易成，更有喜庆之象，如添丁婚嫁等。平安无事，且有喜事之象，与家人共事者大利。

事业：成功与否取决于家庭的情况。严格治家，防止“后院”起火出现意外事故，这是事业成功的先决条件。夫妇和睦，共同合作，必可脱贫致富。事业应由内而外，循序渐进，持之以恒，而后必有所成。

经商：以治家方式用于商业活动。对待公司员工应严宽结合，以严为主。宜集中领导，主事一人，共同合作，日积月累。

求名：以勤苦努力和安贫乐道为主，更应有家庭的支持。家道兴盛的同时，个人的事业也就容易成功。

婚恋：和睦的家庭，是一切的基础，而妻子又是家道的根本。择妻应慎重，和乐兴家。

决策：因好的家庭和妻子的支持而顺利成功，务必保持这种优势，否则，由盛转衰在顷刻之间。尤其应预防家庭变故。持家重在谦和待人，勤俭积蓄以致富。亲人相互和睦、友好。

时运：旺运当头，言行小心。

财运：囤积货品，后有高价。

家宅：小心火灾；亲上加亲。

身体：痰多气喘，难以根治。

运势：平安无事，且有喜事之象，与家人共事者大利。

家运：万事畅达如意，和乐之象。

疾病：注意心脏或胆病，必须小心调理。

胎孕：不碍。

子女：儿女孝顺。

周转：难调，但可成，宜找自家亲人为佳。谨守诚信可无阻。

买卖：有超值的利益可得，交易可成。

等人：会来，且有吉事相告。

寻人：因赌气出走，不久便见。

失物：会出现。隐藏在家中。可能是被家人收起来了。

外出：在家千日好，外出一时难，准备充分后再行动。

考试：上榜有名。

诉讼：虽产生大疑虑，若行事合理则无碍。

求事：有良好机会，勿失。

改行：勿急。

开业：开业者可照计划而行，吉利也。`,
    description: `这个卦是异卦（下离上巽）相叠。离为火；巽为风。火使热气上升，成为风。一切事物皆应以内在为本，然后伸延到外。发生于内，形成于外。喻先治家而后治天下，家道正，天下安乐。
    利女贞。象征着家庭和睦。家庭和谐，事业顺遂。`,
    pinyin: 'jiā'
  },
  '110101': {
    no: 38,
    name: '上离下兑 火泽睽（睽卦）异中求同',
    qian: '下下卦',
    original: '睽。小事吉。',
    meaning: `这个卦是异卦（下兑上离）相叠。离为火；兑为泽。上火下泽，相违不相济。克则生，往复无空。万物有所不同，必有所异，相互矛盾。睽即矛盾。

大象：离火向上，兑泽则向下，一上一下，两相乖违，又二女同居，不得正之象。

运势：气运欠佳，诸事难成，有水火不容之象，宜处变不惊。水火不相容，则气运不通，势行低落，诸事难成。凡事有违叛之时，若能处变不惊，不逞强出头，尚可转危为安。有家内不和，亲友疏散之情。宜力持温和，忍耐去克服困难，始可渡危。

事业：事业开创困难，处境艰辛。如能志同道合，相互信任，目的可以达到。但起初成功的多是小事，小事积累可成大事。事成于协力合作，败于众志相异。应加强团结，委曲以求相通，最忌内部相互猜疑。

经商：应以心平气和的态度投入市场竞争，求大同而存小异。对竞争对手不应敌视，可和而不流，群而不党。尤其不能惹起纠纷，极力避免灾祸。

求名：以真诚的心努力上进。对于恶人必要时亦不可完全不交往，应采取宽大包容的态度，适度往来。对志同道合者也不必完全一致，可异中求同。

婚恋：双方必须真诚相待。否则，第三者极易介入，夫妻相疑则家破。

决策：处于矛盾、对应状态。必须注意以宽宏大度、平和、柔顺的态度对待人生。这样才能心平气和，柔而上进。认清合必有离，离必有合；同中有异，异中有同的道理。否则，刚极暴躁，明极生疑。暴疑皆可致命。

时运：上下不通，以正处之。

财运：人弃我取，尚有小利。

家宅：迁避为宜；择而娶之。

身体：上火下湿，实在难治。

家运：困苦离亲之象，不和睦之情。家运衰颓，虽可得小利，但也入不敷出。

疾病：轻症宜速就医，重症则危，更防断症错误，注意心脏，寒热失调之症。

胎孕：无碍。

子女：子女不和，有骨肉无情之不幸，且其子女六亲缘薄无靠。

周转：难以如愿。

买卖：多阻碍，难成，若成者亦必损。

等人：不会来。

寻人：因口角负气出走，其志不同故不易寻。

失物：不能找回。有失窃的可能。

外出：顺利。途中可以得到善人相助。

考试：落榜。

诉讼：宜速求和解，迟则理屈辞穷。

求事：无希望。

改行：不宜。

开业：不利。`,
    description: `这个卦是异卦（下兑上离）相叠。离为火；兑为泽。上火下泽，相违不相济。克则生，往复无空。万物有所不同，必有所异，相互矛盾。睽即矛盾。
    小事吉。象征着乖离和背离。人际关系不睦，需要调适。`,
    pinyin: 'kuí'
  },
  '001010': {
    no: 39,
    name: '上坎下艮 水山蹇（蹇卦）险阻在前',
    qian: '下下卦',
    original: '蹇。利西南，不利东北。利见大人，贞吉。',
    meaning: `这个卦是异卦（下艮上坎）相叠。坎为水，艮为山。山高水深，困难重重，人生险阻，见险而止，明哲保身，可谓智慧。蹇，跋行艰难。

大象：前路险陷，后有高山，进退维谷，如跛者举步为艰。

运势：多灾多难，进退两难，此时宜守正道，不可轻举妄动，动反招祸。衰运，多灾难，进退两难之处境，要自重而不可妄动，此时应守正道待时也。凡事杂乱，更防小人之害，绝不可涉险境，否则灾害必至。

事业：诸事开头难，坚持下去，会有好的结果。人生不易，首先得求助自己，修德养性。志高自信，奋勇进取。逢到困难，得求友人相助，行动不可冒险，要以柔克刚，待机候时，量力而行。

经商：逐步起业，冒险行事，自寻苦恼。宜加强商业道德，真诚同他人合作，陷入困境时，不得见死不救，而应奋不顾身。联合行动，可活跃于市场竞争之中。

求名：循序渐进，加强自身修道。居静观动，待变，伺机而动，能进则进。内心坦然，不可为追逐名利而冒险。与贤能结合，追随高人，必能转危为安。

婚恋：不很顺利，不得急，宜慎重选择。但应有自知之明。

决策：艰难不利。但可视为考验。奋进向前，充满信心，切勿自寻苦恼，交结贤人，相互帮助，坚守中正之道，可遇难呈祥，结得善果。

时运：处于艰困，更加奋勉。

财运：财不流通，难以得利。

家宅：防水冲损；婚姻有悔。

身体：足部有疾，小心保养。

家运：六亲无情，有贫困、不幸之象，运差者，其险难脱，善者宜致力克服挽救。宜注意家人有重病、血光之厄运。

疾病：病重，不可疏忽医治，注意肾、胃、手部四肢损伤。

胎孕：胎不安，孕有灾。

子女：子女手足情薄，六亲少靠，劳碌之命也。

周转：难调，多不成也。

买卖：失利，交易不成。

等人：不会来。

寻人：速报警帮寻，得贵人则可回。

失物：搜索有困难阻滞而停止，不能寻回。

外出：出门可能有难，利于西南行。如外出遇难，可得救助，转危为安。

考试：落榜。

诉讼：终必有险，更防血光。不宜起讼，动则招咎。

求事：眼前毫无希望。

改行：不宜。执意强行并非良策。

开业：开业者不宜，有是非、损耗之象。`,
    description: `这个卦是异卦（下艮上坎）相叠。坎为水；艮为山。山高水深，困难重重，人生险阻，见险而止，明哲保身，可谓智慧。蹇，跋行艰难。
    利西南。象征着艰难和险阻。前进困难，需要谨慎。`,
    pinyin: 'jiǎn'
  },
  '010100': {
    no: 40,
    name: '上雷下坎 雷水解（解卦）柔道致治',
    qian: '中上卦',
    original: '解。利西南。无所往，其来复吉。有攸往，夙吉。',
    meaning: `这个卦是异卦（下坎上震）相叠。震为雷、为动；坎为水、为险。险在内，动在外。严冬天地闭塞，静极而动。万象更新，冬去春来，一切消除，是为解。

大象：春雷大作，大地解冻，喻冬去春来生机再现。

运势：宜把握良机，快速处理身边困境，更宜出外求谋，因贵人在远方，以西南为吉方。顺势而行，速把握良机、坚持努力，快速处理可成。贵人在远方，有助，宜出外营谋。大运在西南。

事业：元气初复，宜休养生息，安静平易为佳，宜宽宜和。当准备就绪则应立即行动，争取主动，不可拖廷，所往必有功利，但切勿贪得无厌。克勤克俭，刚柔相济，以柔为主。远避小人，团结君子，相互依托，共成事业。

经商：行动贵神速，积极而为，方可摆脱险境。行商宜循正道，切勿招摇过市，此乃愚蠢行动，必自招灾祸。

求名：初出茅庐，应继续充实自己。待机行动。尤应远小人，近君子和有才德的人，以期迅速提高自己。

婚恋：应适时进行。夫妻和衷共济，可家庭和睦，免除灾难。

决策：稳妥为宜，亦不应冒险，因一切尚在元气初复阶段。为争取大发展，务必宽以待人，以柔致治，广交贤者，遣散小人，以中庸、正直的方式，张驰结合的手段，开拓方兴未艾的事业。

时运：灾难已解，声名大起。

财运：天时地利，人和为贵。

家宅：祈祷解厄；婚姻吉祥。

身体：药到病除。

家运：初有困难，但难关已过。开花结实之兆。

疾病：久病可治愈，注意肝、肾、足疾。

胎孕：孕安。

子女：初时因子女牵累而劳苦，但其子女越长运越好，故苦后得甘，已可得到幸福。

周转：速进行可成，延迟不利。

买卖：即速交易，可名利双收。

等人：一定来。

寻人：北方寻之可见。

失物：遗失之物似有被支解破坏的可能，故寻回的机会不大。

外出：一旦准备充分，立即行动，捷足先登必有所获。

考试：题榜在望。

诉讼：一般纠纷皆可解决，宜当机立断，不可拖延。

求事：有贵人相助。

改行：速改有利。

开业：开业者有很大的展望。`,
    description: `这个卦是异卦（下坎上震）相叠。震为雷、为动；坎为水、为险。险在内，动在外。严冬天地闭塞，静极而动。万象更新，冬去春来，一切消除，是为解。
    利西南。象征着解除和化解。困难即将解除，柳暗花明。`,
    pinyin: 'xiè'
  },
  '100011': {
    no: 41,
    name: '上艮下兑 山泽损（损卦）损益制衡',
    qian: '下下卦',
    original: '损。有孚。元吉。无咎。可贞。利有攸往。曷之用，二簋可用享。',
    meaning: `这个卦是异卦（下兑上艮）相叠。艮为山；兑为泽。上山下泽，大泽浸蚀山根。损益相间，损中有益，益中有损。二者之间，不可不慎重对待。损下益上，治理国家，过度会损伤国基。应损则损，但必量力、适度。少损而益最佳。

大象：山高水深，各得其所，因损得益之象。

运势：现况诸事不顺，有破财之象，虽先损失，但后反而得益，因祸得福。诸事不如意，若倾于利欲不当之心则有灾，散财之损。必须能够悟其所损，方能挽回局势。与人共事商量则可收损失之象。

事业：开拓事业要有所投入，投入多少应事先精心算计，力求损益得当。诸事皆应有节度，切忌欺诈、贪婪。天下事克己最难，务必严格要求自己，刻苦奋斗，手段灵活，争取事业成功。

经商：全面调查市场行情，计算投入和收益的比例。不必过于计较利润的多少，获利即可。真诚与他人合作，彼此信任，手段灵活，切勿自我封闭。

求名：为了成长进步，务必有所投入，且应付诸实践。以损增益，成就理想。

婚恋：全面权衡对方的长处与短处，应从大处着眼。

决策：为人聪颖，善于权衡利弊。顺应自然发展规律，积极主动与他人合作，助人为乐，适度投入，资助他人，而自己要宁俭勿奢。如此，诸事都可以十分顺利。

时运：心平气和，才有发展。

财运：和气生财，损己利人。

家宅：地势宜平；夫妇得正。

身体：修身养性。

家运：正处于受损之时，审慎挽救颓势也。

疾病：现况病情虽重，积极治疗可愈。身体较衰弱，注意肠胃、咽喉、贫血等疾。

胎孕：产母有凶象。

子女：儿女多诚实孝顺，幸福之格。

周转：可达目的。

买卖：虽有损，但终得利。

等人：可能会迟到。

寻人：在东北或西方友人家中，可寻。否则会自回。

失物：不能寻回。

外出：有益可行。注意节省费用，防止损多于益。

考试：多努力，榜上可题名。

诉讼：有斗争之象，损失破财，和解反而获益。

求事：可慢慢受重用。

改行：可行，勿急躁，宜周密行事。

开业：吉利，宜有耐力。`,
    description: `这个卦是异卦（下兑上艮）相叠。艮为山；兑为泽。上山下泽，大泽浸蚀山根。损益相间，损中有益，益中有损。二者之间，不可不慎重对待。损下益上，治理国家，过度会损伤国基。应损则损，但必量力、适度。少损而益最佳。
    有孚。象征着损益和取舍。有所损失才有所得，需要智慧取舍。`,
    pinyin: 'sǔn'
  },
  '001110': {
    no: 42,
    name: '上震下巽 风雷益（益卦）损上益下',
    qian: '上上卦',
    original: '益。利有攸往，利涉大川。',
    meaning: `这个卦是异卦（下震上巽）相叠。巽为风；震为雷。风雷激荡，其势愈强，雷愈响，风雷相助互长，交相助益。此卦与损卦相反。它是损上以益下，后者是损下以益上。二卦阐述的是损益的原则。

大象：强风配快雷，声威增长之象，长男配长女，夫妇合体，增益儿孙之象。

运势：现正当吉运，可得贵人之助而成功，宜施惠于人，施比受更有福。乘盛吉之运，可得他人之助而诸事顺畅，家业有成。大致吉利之运也。

事业：大胆投入，勇于支持他人事业，必相得益彰。勇敢前进，敢作敢为。只要心地善良、纯洁、谦虚，事业必定与日俱增，前程无可限量。助人宜即时，要在应急。开拓事业，内部团结一致，人心所向，树立恒心，不怕冒险犯难。

经商：勿追求小利，让利于顾客，反而必获丰厚利润，切忌贪心不足！在遇到危险时应向他人求教，争取诚实的援助。

求名：真心实意地施惠于他人，自己必然可以得到诚心诚意的回报，并且获得支持，事业必成。

婚恋：相亲相爱，良缘天定。

决策：心胸开阔，乐于助人。人际关系好，得到众人的支持。自己贵在树立恒心，克服三心二意。尤其要向比自己优秀的人学习，借助对方的力量，充实和发展自己。树立必要的冒险精神。平日要施善于人。因此，即使遇到危险也会得到他人救助。

时运：得意之时，改旧换新。

财运：贸易要快，才有利益。

家宅：小心风雷；婚姻好合。

身体：肝火太盛。

家运：有喜悦之象，发达之意。

疾病：可治愈，提防肝胆、肠胃之疾，或性病等。

胎孕：胎有不安。

子女：得家人之喜爱，天真顽皮。

周转：可成。

买卖：可得大利。

等人：迟来。因有好事相告。

寻人：难逢，防有害。若出走者会自回。

失物：有望可寻回。

外出：有利可获。大胆外出行动。

考试：成绩优良，父母有喜悦之象。

诉讼：有牢狱之灾，或事因女人、房地产引起，宜和解。

求事：大好时机，勿错过。

改行：有利。

开业：开业者则大有利图。`,
    description: `这个卦是异卦（下震上巽）相叠。巽为风；震为雷。风雷激荡，其势愈强，雷愈响，风雷相助互长，交相助益。此卦与损卦相反。它是损上以益下，后者是损下以益上。二卦阐述的是损益的原则。
    利有攸往。象征着增益和发展。有利于开展事业，扩大发展。`,
    pinyin: 'yì'
  },
  '011111': {
    no: 43,
    name: '上兑下乾 泽天夬 （夬卦） 决而能和',
    qian: '上上卦',
    original: '夬。扬于王庭，孚号，有厉。告自邑，不利即戎，利有攸往。',
    meaning: `这个卦是异卦（下乾上兑）相叠。乾为天为健；兑为泽为悦。泽气上升，决注成雨，雨施大地，滋润万物。五阳去一阴，去之不难，决（去之意）即可，故名为夬（guài），夬即决。

大象：泽水积满而泛滥成灾，滔天之势。又五阳爻之盛势必除去唯一阴爻，故一阴孤立。

运势：目前虽吉，但困难及变动正在蕴酿中，宜提高警觉，忌骄傲，防口舌是非。日前虽然鸿运当头，终会遇到困难与危险，凡事不可轻举妄动，宜随时警惕自己，留心意外灾害。住所可能会有变动，亦有文书、契约之失利，易生错误。慎勿傲气或自以为是，不谦和者定有灾。

事业：处在兴盛阶段，但已孕育着普遍的危险。务必施恩泽给他人，勿居功自傲，主动团结他人，不干冒险的事。时时提高警惕，防止小人的破坏。但不可莽撞，应持和缓的手段去决断小人，避免过犹不及。

经商：市场正在走向衰落的状态，不宜大量活动，随时注意转向。开拓新领域时，加强同他人的合作。但务必充分注意别有用心的奸诈小人趁机捣乱和破坏。

求名：虚心求教，充实自身实力。但应量力而行，不可盲目自大，更不可同小人合流，图虚名而败坏事业。

婚恋：防止上介绍人的当，也应注意对方的目的。

决策：性格矛盾，往往表面刚强而内心虚弱，在关键的时刻，败坏事业。虚心听取他人劝告，切勿鲁莽，多谋深思，用柔和的态度待人处世。

时运：气运过盛，散财为吉。

财运：利己利人，财散人聚。

家宅：须防水患；婚姻不成。

身体：调养气息。

家运：夕阳虽好，却近黄昏，往后有陷于惊动、痛苦之境。因此卦有盛极必反之象。

疾病：病情重宜速治，防头部、呼吸系统、肿瘤等疾。

胎孕：无灾。母胎宜节食物，且勿发怒气，否则有难产之虑。

子女：有先吉后凶之象。

周转：不可急躁，须诚意，光明之态度可成，否则有不利之象。

买卖：须诚信交易，有失败破财之害。

等人：不必等了，不会来。

寻人：宜速寻找，延误不利。

失物：相信失物已经损坏，不能寻回。

外出：不宜过于频繁，以逸待劳最佳。外出旅行吉利。

考试：不理想。

诉讼：不宜与人争执，因势孤力弱，宜寻求法律途径解决。

求事：有困难，或得不到好职位。

改行：改行者要慎重考虑。

开业：开业者不利，如已备妥，小心难关重重。`,
    description: `这个卦是异卦（下乾上兑）相叠。乾为天为健；兑为泽为悦。泽气上升，决注成雨，雨施大地，滋润万物。五阳去一阴，去之不难，决（去之意）即可，故名为夬（guài），夬即决。
    扬于王庭。象征着决断和果断。当机立断，不可犹豫。`,
    pinyin: 'guài'
  },
  '111110': {
    no: 44,
    name: '上乾下巽 天风姤（姤卦） 天下有风',
    qian: '上卦',
    original: '姤。女壮，勿用取女。',
    meaning: `这个卦是异卦（下巽上乾）相叠。乾为天，巽为风。天下有风，吹遍大地，阴阳交合，万物茂盛。姤（gǒu）卦与夬卦相反，互为“综卦”。姤即媾，阴阳相遇。但五阳一阴，不能长久相处。

大象：风无孔不入，所吹到之处，暴露其间之物体，无一不与之相遇，为邂逅之意。

运势：阴长阳消，注意桃色纠纷，诸事阻滞，宜慎重行事。阴长阳衰，男人谨防因色受祸，诸事不如意，不能上进，沉于女色之凶象也。凡事进取宜慎重。

事业：合时宜，循时序。但潜在着危机，阴阳不协调。务必依附于强者，多方联系，增强势力，防止小人渔利，争取形势好转。诸事宜及早准备，等待时机，一旦成熟立刻行动。

经商：市场正从红火的状态走向衰危，及早脱身为妙，强行发展有危险。无正直的人相助，却有小人在暗中盘算。对此，务必保持清醒的头脑，寻求可靠的合作伙伴，隐忍待时，以图商业活动的再发展。

求名：性格不很合群，内心自视过高，不免处于困境而不得志。应投靠真诚正直的人，在其支持下成功。

婚恋：严格考察对方的道德品质，避免陷入“三角”纠纷。夫妻以诚相待，可转危为安。

决策：吉利。可在有利的环境中顺利发展，但决不可冒险行事，以免适得其反。其次在于随时提防身边小人的陷害。为此，在邪恶未成势之前即应制止，宁可孤立也不可与小人结伴。

时运：正当好运，名扬四海。

财运：到了远方，自可获利。

家宅：小心狂风；婚姻得正。

身体：小心中风。

家运：家运渐衰，不祥之兆。有女人口舌，亦有感情之因，损财之运。

疾病：病情重，有恶化情况，注意泌尿生殖系统、胸肺科病。

胎孕：孕无碍。然须注意子女均有品性不良之趋向。

子女：子女多有志行不坚定，给父母亲增加麻烦，不幸之象，难管教也。

周转：有意外阻挠，难调，另谋他法为宜。

买卖：不能如意，受奸诈之害而导致失败也。

等人：女方会来，男方不一定会来，因为途中遇到别的女人之故。

寻人：会在意想不到的地方相遇。寻人不易，西北方。

失物：尽快寻找，可失而得。失物似被重重物件压在最底部。

外出：有困难，虽无大灾祸，但无人相助。

考试：不理想。

诉讼：提防桃色纠纷，是非谣言拨弄。

求事：难成。

改行：不利。

开业：不宜，强行必受小人之害。`,
    description: `这个卦是异卦（下巽上乾）相叠。乾为天；巽为风。天下有风，吹遍大地，阴阳交合，万物茂盛。姤（gòu）卦与夬卦相反，互为“综卦”。姤即遘，阴阳相遇。但五阳一阴，不能长久相处。
    女壮。象征着偶遇和相遇。机遇来临，把握时机。`,
    pinyin: 'gòu'
  },
  '000110': {
    no: 45,
    name: '上兑下坤 泽地萃（萃卦）荟萃聚集',
    qian: '中上卦',
    original: '萃。亨，王假有庙。利见大人，亨，利贞。用大牲吉。利有攸往。',
    meaning: `这个卦是异卦（下坤上兑）相叠。坤为地、为顺；兑为泽、为水。泽泛滥淹没大地，人众多相互斗争，危机必四伏，务必顺天任贤，未雨绸缪，柔顺而又和悦，彼此相得益彰，安居乐业。萃，聚集、团结。

大象：泽在地上，水聚于泥土中，滋养草木，生长茂盛。

运势：吉运昌盛，又得长辈提携，事业大利，但须防财务纠纷。昌隆，得信于人，承上辈照顾，事业吉昌，但宜小心财务上的纠纷。

事业：兴旺发达，团结和睦。正在蒸蒸日上，但水多泛滥，人多竞争必然激烈。盛则必衰，切勿骄傲，谨慎小心为好。但也不得犹豫不决，宜勇往直前，开拓新的业务。务必以高尚的品德服众。

经商：真诚合作，团结互助。鼓励是事业兴旺发达的标志。大胆开拓市场，稳妥前进，有备无患，必可取得不断发展。

求名：光靠个人努力，建树不会很大，定要取得他人的帮助，加上个人的条件方可达到理想的境界。

婚恋：勿急于求成，相亲相爱，美满幸福。

决策：善于团结他人共同合作，具有领导才能。但心胸宽阔，眼光务必远大，以诚信、中正为本，不失原则，尤其要严格要求自己，宽容他人，遭到他人反对时，应认真反省自己，得出教训，以这种心境处世为人，终生可平安，事业必通达。

时运：安不忘危，自可无忧。

财运：财聚之象，有聚有散。

家宅：防水入屋；洁身自爱。

身体：胸腹水涨，早些调理。

家运：家庭融洽如意。防财务歧见之意外。

疾病：凶象，宜速诊治，防胸腹及咽喉之病变。

胎孕：胎安。然产母病多，注意保养身体。

子女：手足相敬如宾。

周转：可得到上辈支持。

买卖：可获利。

等人：一定会来，且有佳音相告。

寻人：会自己回来，不用担心。

失物：多半能失而复得。

外出：出行虽可能遇到小麻烦，但不要害怕，应以大局为重，积极行动。

考试：常保佳绩。

诉讼：宜解不宜结。

求事：可顺利，有成就。

改行：吉利。

开业：开业适时，可按计划进行。`,
    description: `这个卦是异卦相叠（下坤上兑）。坤为地、为顺；兑为泽、为水。泽泛滥淹没大地，人众多相互斗争，危机必四伏，务必顺天任贤，未雨绸缪，柔顺而又和悦，彼此相得益彰，安居乐业。萃，聚集、团结。
    亨。象征着聚集和集合。众人聚集，利于谋事。`,
    pinyin: 'cuì'
  },
  '011000': {
    no: 46,
    name: '上坤下巽 地风升（升卦）柔顺谦虚',
    qian: '上上卦',
    original: '升。元亨。用见大人，勿恤，南征吉。',
    meaning: `这个卦是异卦（下巽上坤）相叠。坤为地、为顺；巽为木、为逊。大地生长树木，逐渐成长，日渐高大成材，喻事业步步高升，前程远大，故名“升”。

大象：树木从地上不断向上，有进升之势。

运势：名利双收，发展开运之象，宜向南方发展。诸事向上发展，开运之象，南方有吉庆，可名利双收也。

事业：十分顺利，不断发展，依时而进，逐步上升，前程远大，但应逐步发展，切莫因顺利而冒进。谨慎小心，修养德行，追随有德行的前辈，真诚对待事业。

经商：遵守商业道德，从小处着手，逐渐开拓，通过自己的勤劳，真诚竞争，稳重为好，切莫冒失而成大错。

求名：努力学习，加强修养，以自己的聪明才智，必能得志，若有人引荐，前途更为广阔。但应注意节制。

婚恋：双方以诚相待，逐步培养情感，一定可以成功。

决策：如意随愿。聪明、灵活、具有良好的成功基础，严格要求自己，谦虚和顺，虚心向长辈求教，逐步、稳健地发展自己的事业，将犹如树木的成长，终于会成栋梁之才。但在成长过程中，务必处处谨慎，坚持真诚和正直，大胆前进。

时运：大地春回，日益高升。

财运：储蓄积财，可成富人。

家宅：改造大厦；以妾作嫡。

身体：肝火渐旺，早些调养。

家运：渐进而升至繁荣，积小以成大之吉运。

疾病：病情重，注意腹部，胆管之疾。

胎孕：不宜修造动土，修造必犯产母。

子女：子女渐有成功之象，可贺。

周转：勿太过急，可成。

买卖：多有利，应于亥卯日。

等人：迟到。

寻人：动身则见，但恐自身有阻，与他人同去可，宜向北方。会自己回来。

失物：不易寻回，失物有被束之高阁的可能。

外出：十分顺利，尤其是南行，不会有灾祸。

考试：进步，进取有利。

诉讼：宜持平和态度处理，可争取主动，胜算在握。

求事：有利。

改行：吉利。

开业：吉利，渐渐获利。`,
    description: `这个卦是异卦相叠（下巽上坤）。坤为地、为顺；巽为木、为逊。大地生长树木，逐步的成长，日渐高大成材，喻事业步步高升，前程远大，故名“升”。
    元亨。象征着上升和进步。事业上��期，把握机会。`,
    pinyin: 'shēng'
  },
  '010011': {
    no: 47,
    name: '上坎下兑 泽水困（困卦）困境求通',
    qian: '中上卦',
    original: '困。亨，贞，大人吉，无咎。有言不信。',
    meaning: `这个卦是异卦（下坎上兑）相叠。兑为阴为泽喻悦；坎为阳为水喻险。泽水困，陷入困境，才智难以施展，仍坚守正道，自得其乐，必可成事，摆脱困境。

大象：水在泽下，万物不生，喻君子困穷，小人滥盈之象。

运势：诸事不如意，所谓龙游浅水遭虾戏。不如意，被小人欺，劳而无功，破损之灾。一事难成，运衰也。宜守己待时。

事业：境况十分不佳，遭受到很大的困难。人生面临巨大的考验，如采取不正当的手段，会愈陷愈深。相反，如身陷困逆境地而不失节操，自勉自坚，泰然处之，不失其志，终能成事。

经商：面临激烈竞争，很有破产的可能。切勿失望，而应在困境中奋斗。为此，只能靠平日加强修养。认真反省自己的行为，总结教训，重新奋起，但也不宜浮躁，应缓慢而进。同时，更要警惕因致富发财，得意忘形而陷入新的困境。

求名：欲速则不达。应以谦虚的态度，缓慢前进，应有坚定的志向，唯有志才能促成事业的成功。

婚恋：以乐观态度冷静处理，尤应注重人品。

决策：聪明智慧，但怀才不遇。若不因困境而失去信心，坚持努力上进，放弃侥幸心理，锲而不舍，虽不一定能守全实现自己的理想，但终会有所成。

时运：身名皆困，不如安命。

财运：财乏势危，不如归去。

家宅：安全第一；女寡之象。

身体：肾水已亏，险在眼前。

家运：家庭之主有屈于下风，被内助压迫者，亦常生反弹，吵架滋事。为黑暗时期，宜忍辱负重，期待黎明到来。若不谨守正道者，有失和、破??兆也。

疾病：危重之象，注意口腔咽喉，泌尿系统，甚至性病。

胎孕：胎安。将来劳碌命格。

子女：劳苦之命，但行为端正者，终可得福也。

周转：求人不如求己，凡事需量入为出。若为女色破财，当然求助无门。

买卖：不能如愿，有挫折。

等人：受到阻碍，不来或迟到。

寻人：途中可遇，来者自来也。

失物：不能寻回。

外出：困难多，慎重考虑。

考试：不理想。

诉讼：凡事不宜过于执着，防牢狱之灾。

求事：不得时亦不得意，再待时机。

改行：不宜。

开业：开业者须再待时。`,
    description: `这个卦是异卦（下坎上兑）相叠。兑为阴为泽喻悦；坎为阳为水喻险。泽水困，陷入困境，才智难以施展，仍坚守正道，自得其乐，必可成事，摆脱困境。
    亨贞。象征着困境和困难。身处困境，需要坚持。`,
    pinyin: 'kùn'
  },
  '110010': {
    no: 48,
    name: '上坎下巽 水风井（井卦）求贤若渴',
    qian: '上上卦',
    original: '井。改邑不改井，无丧无得。往来井井。汔至，亦未繘井，羸其瓶，凶。',
    meaning: `这个卦是异卦（下巽上坎）相叠。坎为水；巽为木。树木得水而蓬勃生长。人靠水井生活，水井由人挖掘而成。相互为养，井以水养人，经久不竭，人应取此德而勤劳自勉。

大象：水被植物吸收，滋养树身又象征汲器入井取水，有节约重覆之意。

运势：井为静物，不能移动，故凡事不能进取主动，又缺乏冲劲，不如处之泰然更有利。缺乏衡力，因井为静而不能移之物。故凡事已无法进取，不如守之泰然。

事业：处于平稳状态。既不宜贸然前进，也不必后退，而应以积极的态度努力进修，提高自己，充实个人实力，待机而起，将大有成就。最怕的是停顿不前，否则将会因不合时宜而被淘汰。

经商：市场情况良好，可继续按照原来的方针。同时，继续本着勤劳、奋进的精神，诚心诚意地开拓市场，特别注意与人的合作，相互协助，在实践活动中丰富和积累经验。

求名：本着正当的目的，为社会做贡献，因此而努力学习。应特别注意向贤德的人求教，以便被发现而受到推荐。

婚恋：不必过急，会有般配的伴侣。

决策：聪明、机敏、乐于助人。同时，也会有机会充分施展个人的才能。只要能学习“水井”的精神，真诚奉献，不断丰富自己的才能，一定会受到社会的重视。

时运：木水相生，功名有望。

财运：利大于本，自然可喜。

家宅：修屋防水；阴阳得正。

身体：肾水过胀，立即调治。

家运：诸事宜心平气和处理，守其井水，供来往人用，为守旧之义。诸事宜防有变。

疾病：病情较重且拖延，可能复发。

胎孕：宜防有不成之兆。防产母有灾，作福祈保可平安。

子女：儿女有顺良之象，宜防血光。

周转：无望，再待时另调。

买卖：尚可，但不可大作为。小交易有利。

等人：迟来。

寻人：东南或北方可寻。

失物：不能寻回。

外出：没有十分的必要和充分的把握不可随意出行。

考试：尚可。

诉讼：有刑罚之象，且受人牵连，及防房地产之诉讼。

求事：安于本份，换新的工作也是小工作。

改行：不利，守之尚可。

开业：开业者不宜，此卦有破损之象。`,
    description: `这个卦是异卦（下巽上坎）相叠。坎为水；巽为木。树木得水而蓬勃生长。人靠水井生活，水井由人挖掘而成。相互为养，井以水养人，经久不竭，人应取此德而勤劳自勉。
    改邑不改井。象征着循环和滋养。坚守本分，滋养生息。`,
    pinyin: 'jǐng'
  },
  '101110': {
    no: 49,
    name: '上兑下离 泽火革（革卦）顺天应人',
    qian: '上上卦',
    original: '革。己日乃孚。元亨利贞。悔亡。',
    meaning: `这个卦是异卦（下离上兑）相叠。离为火、兑为泽，泽内有水。水在上而下浇，火在下而上升。火旺水干，水大火熄。二者相生亦相克，必然出现变革。变革是宇宙的基本规律。

大象：兑为金，被离火所烧，变革之象。

运势：凡事均在变动之中，宜去旧立新，以应革新之象。不稳定，多变化之际，凡事均有所变动，故需弃腐朽而立新者，宜下决心改革。但仍须谨慎改革之道，善改则吉，恶改则凶。

事业：正处在转折的关键时刻，必须密切注意各种信息，认真思考。首先巩固自己的地位，完善个人的行为。时机成熟后，立即行动，积极进行变革。但应注意动机纯正，手段正当，不保守也不妄进，事业必定发达。

经商：市场竞争十分激烈。为了立于不败之地，一定要敢于大胆求新，适时改变自己的经营方向，受到挫败，马上总结经验，重新奋起，拓展商业活动，但要注意竞争方式。

求名：首先要努力提高自己，完善个人的学识和品德。同时，服从上级指挥搞好工作，二者的关系一定要得到妥善处理。

婚恋：可能会出现一些节外生枝的麻烦事，应冷静处理，感情专注。

决策：十分吉利、顺利。以自己的聪明才智，顺应形势，根据时代特点，依理而动，变革渐合时宜的事物，壮大自己的事业。但应谨慎，时机不成熟不可妄动，尤忌急功近利。行动之前应三思而行。

时运：改变之时，顺时而动。

财运：消耗过多，迁地贸易。

家宅：小心防火；改娶之象。

身体：肾水干枯，肝火上升。

家运：多事之秋。慎重改变自己的生活方式，方能建立新的气象。

疾病：病情多变，宜改换求医方法，注意心脏，眼目和咽喉之疾。

胎孕：胎安。

子女：子女与母亲有缘薄之象。

周转：要及时改变方针。

买卖：改变经营方式为宜。

等人：因中途变卦不会来。

寻人：速改变方向，向西、南方寻找。

失物：因有弃旧迎新之意，故相信不能寻回。

外出：十分顺利，积极活动，扩大人际关系。

考试：越来越好。

诉讼：要改变旧有对策，才可圆满解决。

求事：不可守旧，改变职事有利之时机也。宜速把握良机。

改行：大吉大利。

开业：大吉大利。`,
    description: `这个卦是异卦（下离上兑）相叠。离为火；兑为泽，泽内有水。水在上而下浇，火在下而上升。火旺水干；水大火熄。二者相生亦相克，必然出现变革。变革是宇宙的基本规律。
    巳日乃孚。象征着革新和变革。改革创新，谨慎行事。`,
    pinyin: 'gé'
  },
  '011101': {
    no: 50,
    name: '上离下巽 火风鼎（鼎卦）稳重图变',
    qian: '中下卦',
    original: '鼎。元吉，亨。',
    meaning: `这个卦是异卦（下巽上离）相叠。燃木煮食，化生为熟，除旧布新的意思。鼎为重宝大器，三足稳重之象。煮食，喻食物充足，不再有困难和困扰。在此基础上宜变革，发展事业。

大象：木之上有离火，为燃炊烹饪之象，鼎有去旧立新，改过迁善之意。

运势：时运仍佳，事业可成，但诸事不宜迟滞，及防有诉讼之累。能解决困难，取得事物之稳定而名利双收，会有不错的成就，最好找外人来共事、合伙。

事业：具备开拓事业的各种条件。耳聪目明，头脑冷静，应以端正的态度为人处世，严于律己，慎终如始，刚柔兼备，与有才德的人合作，勿妄进失度，则会无往不利。

经商：经过一番奋斗，已经可以比较顺利地发展自己的商业活动，遇到困难也能够克服。如果坚持商业道德，参与正常竞争活动，无轻举妄动和邪思，刚中自守，商业可大发展，但若不量入为出，坐吃山空，必败业。

求名：首先应积功累德，严于律己，不陷入与他人的怨仇之中，柔而上行，循序渐进。得到知人者的善用，更是前途广大。

婚恋：个人条件比较理想，顺利，但勿不切合实际。

决策：天资聪颖，反应敏捷，头脑灵活，具备随机应变，随时应变和随势应变的能力。因此，前程远大，即使暂时不受重视，无出路也无防，最终可实现抱负。

时运：功名日进，贵不可言。

财运：自然得利，不劳而获。

家宅：小心火灾；正配内助。

身体：肝火上冲，顺气以治。

家运：生平幸福之运，吉也。

疾病：病情有变，但无大碍，为胆石，心脏，消化系统病。

胎孕：不安，不久便产。男女将来皆豪杰，母宜保。

子女：子女均才能出众，将成大功立大业之趋势也。

周转：可成。

买卖：有大利可得。

等人：一定会来。

寻人：南方或东南方。不必操心，会自己回来。

失物：过一段时间后可寻回，惟已变形。

外出：无重大事情不宜外出。为发展事业外出顺利。

考试：登科上榜。

诉讼：由小事引起，宜和解了事。

求事：大利，有上辈提拔。

改行：有得天独厚的条件，速进行。

开业：吉利通达之象。`,
    description: `这个卦是异卦（下巽上离）相叠。燃木煮食，化生为熟，除旧布新的意思。鼎为重宝大器，三足稳重之象。煮食，喻食物充足，不再有困难和困扰。在此基础上宜变革，发展事业。
    元吉。象征着变革和创新。改革创新，但需循序渐进。`,
    pinyin: 'dǐng'
  },
  '100100': {
    no: 51,
    name: '上震下震 震为雷（震卦）临危不乱',
    qian: '中上卦',
    original: '震。亨。震来虩虩，笑言哑哑。震惊百里，不丧匕鬯。',
    meaning: `这个卦是同卦（下震上震）相叠。震为雷，两震相叠，反响巨大，可消除沉闷之气，亨通畅达。平日应居安思危，怀恐惧心理，不敢有所怠慢，遇到突发事变，也能安然自若，谈笑如常。

大象：重雷发向，千里传声，有惊无险之象，亦有变动之意。

运势：表面昌盛风光，内里正处多事之秋，动荡不安之境。表面似盛泰，但正处于多事之秋，宜慎重，勿自视过高，无益也。有动荡、不安、惊惧之象耳。

事业：处于不顺利、甚至面临危险的局面，对此务必提高警惕，有备方可无患，一旦出现突发事件，可以泰然处之，并且可以由此引吸取教训，一方面使损失减少，另一方面可以迅速复原，使事业迈上新的高度。

经商：在激烈的商场竞争中，随时可能出现问题，陷入困境。冷静、从容地应付到来的现实，坚持不偏不激的中正原则，以刚毅的态度，从容不迫地去战胜困难。经过一番危机后，一定可以获得巨大利益。

求名：很可能会遭到挫折。不必灰心，而应自我反省，找出问题的症结所在。

婚恋：恋爱和家庭都可能出现变故，应以冷静态度处理，会有理想的结果。

决策：处于人生的转折关头。应正确地总结过去，为开拓新的事业奠定基础。在前进的道路上应随时心怀恐惧，勤勤恳恳，坚持正确原则，在困难中前进，命运亨通。

时运：运势正强，谨慎免咎。

财运：所积财物，皆得售出。

家宅：保护宅基，祭祷为宜；佳偶。

身体：肝火太盛，不宜劳累。

家运：家中常有变动惊惧、不平等、多争吵，影响家运进展，宜审慎处理家务事也。

疾病：注意肝、神经系统、足疾，病情反复。

胎孕：临产妇得之无碍。

子女：子女多有性刚者，但皆争气，奋发，并有少年劳苦老来福之象，有成有福。

周转：抱持可有可无之心态，因此卦有被反悔之象。

买卖：不可有始无终，否则难成。

等人：会来，而且会提早到。

寻人：此人临时起意而出走，但亦会马上回来。

失物：可能是受某些事惊吓而遗失，令你惊惶失措，尝试于会发声的东西或电器处寻找。

外出：大胆出行，不必理会小的灾祸。

考试：可榜登科甲。

诉讼：反覆难平，宜收敛脾气，心平气和。

求事：不利。

改行：改行吉利，为变动之时机也。

开业：吉利，可依计划而行。`,
    description: `这个卦是同卦（下震上震）相叠。震为雷，两震相叠，反响巨大，可消除沉闷之气，亨通畅达。平日应居安思危，怀恐惧心理，不敢有所怠慢，遇到突发事变，也能安然自若，谈笑如常。
    亨。震来虩虩。象征着震动和行动。行动要果断，但需谨慎。`,
    pinyin: 'zhèn'
  },
  '001001': {
    no: 52,
    name: '上艮下艮 艮为山（艮卦）动静适时',
    qian: '中下卦',
    original: '艮。艮其背，不获其身。行其庭，不见其人。无咎。',
    meaning: `这个卦是同卦（下艮上艮）相叠。艮为山，二山相重，喻静止。它和震卦相反。高潮过后，必然出现低潮，进入事物的相对静止阶段。静止如山，宜止则止，宜行则行。行止即动和静，都不可失机，应恰到好处，动静得宜，适可而止。

大象：两重高山并峙，故宜止不宜进，阻塞之象。

运势：凡事不宜妄动，前路受阻，只好待机而动。应当洁身自爱，依赖心不要太重，否则不利。凡事不可轻举妄动，诸事宜守，相辅得吉。儒家有言：『静亦定，动亦定』，此非言死等，宜中正德行，固守贞常之道，凡事有定之理也。

事业：在经过一段发展后，应进行调整，暂时停止行动，总结经验教训。不可因贪名利而妄进。自我克制，自我约束，谨言慎行，不要盲目追求他人。经过休整后，在适当时机到来时，再大显身手。

经商：进入停滞不前的状态，切勿盲目冒进，而宜适时停止，进入安静退守，不要受外界干扰，尤其是应该保持内心和理智上的宁静，更不要轻易与他人合作。等待时机，必有光明前途。

求名：应保持纯正的目的，静守正道。勿为功名诱惑，秉守忠厚，可得成功。

婚恋：重感情，彼此以诚相待，可白头到老。

决策：性格沉静、内向，不喜好活动，也不善于交际，为人忠诚老实，讲信义。注意听取他人的建议，明哲保身。机遇不到，不宜积极活动，该止则止，勿抱不切实际的想法。

时运：运势平平，不宜妄进。

财运：守好本业，不可贪财。

家宅：不宜改造；命由前定。

身体：带病延年。

家运：不和，家运停滞不发，改正自己以谋求开运之道，内有动荡、困境。

疾病：难治，注意肠胃血管硬化及结核病。

胎孕：难产之虞。

子女：子女多有不和、不相辅之数。

周转：难成。

买卖：有些小是非，失利之象，但可成。

等人：不会来。

寻人：西南方，难寻。

失物：可以寻回，但要等一段时间。藏在家中、旅馆、寺院、山中某处。

外出：慎重为好，宜另择佳日。

考试：落榜。

诉讼：因小事而化大，宜速求和，忌土姓人。

求事：固守本份为宜。

改行：不利。

开业：开业不宜，须再待时。`,
    description: `这个卦是同卦（下艮上艮）相叠。艮为山，二山相重，喻静止。它和震卦相反。高潮过后，必然出现低潮，进入事物的相对静止阶段。静止如山，宜止则止，宜行则行。行止即动和静，都不可失机，应恰到好处，动静得宜，适可而止。
    艮其背。象征着停止和限制。适时停止，审时度势。`,
    pinyin: 'gèn'
  },
  '110100': {
    no: 53,
    name: '上巽下艮 风山渐（渐卦）渐进蓄德',
    qian: '上上卦',
    original: '渐。女归吉，利贞。',
    meaning: `这个卦是异卦（下艮上巽）相叠。艮为山，巽为木。山上有木，逐渐成长，山也随着增高。这是逐渐进步的过程，所以称渐，渐即进，渐渐前进而不急速。

大象：山上种有树木，逐渐生长，比喻循序渐进。

运势：逐渐走向光明前途，凡事宜打根基，可得吉庆，但须防色情之难及文书错失。逐渐顺利，光明开运之象。凡事务必掌握时机，循序渐进，可得吉庆。须防款项交易之差错及色情之灾。

事业：在经过一个相对静止的时期后，重新开始了事业的新阶段。这时最怕的是急躁冒进，务必循序上进，脚踏实地。同时注意品德修养，以沉着、谦逊的态度对待事业，可无往而不利。

经商：正处在稳步向前发展的阶段，要把握时机，既不可盲目乐观，也不要停步不前，而应采取逐步前进的策略，量力而行。遵守商业道德，以良好的服务，开拓市场。

求名：效法树木植根山上，逐渐生长的精神。在品德和学业两个方面，扎扎实实地提高自己。同时，肩负起改善社会风俗的责任。求名应以渐进为宜，切不可急进。

婚恋：不可操之过急。幸福、美满，夫妻白头和谐。

决策：时来运转的时刻已经到来，切莫错过良机。务必小心谨慎，渐进有益有利。以谦和的态度处世，可以得到强有力的支持，会获得重大成功。

时运：时来运转，可以得意。

财运：逐渐得利，多行善事。

家宅：君子居之；贤女可妻。

身体：安居调养。

家运：渐曙光明、幸福之象，诸事宜以顺乎自然为吉，反则有克也。

疾病：恶化之象，注意胃、肠、背痛等。

胎孕：无碍。

子女：儿女多坚强笃实，态度温顺，将来有成就。

周转：不成亦勿放弃，久调可成。

买卖：渐进有利，过急不利，欲速则不达。

等人：迟到。

寻人：在东南或东北二方，过些时日可寻得。

失物：多数不能寻回。

外出：准备充分，从容外出，一路平安。

考试：会取得好成绩。

诉讼：宜进不宜退，据理力争可胜。

求事：可寻得良好工作。

改行：吉利。

开业：吉利，渐有发展之象。`,
    description: `这个卦是异卦（下艮上巽）相叠。艮为山；巽为木。山上有木，逐渐成长，山也随着增高。这是逐渐进步的过程，所以称渐，渐即进，渐渐前进而不急速。
    女归吉。象征着渐进和发展。循序渐进，稳步前行。`,
    pinyin: 'jiàn'
  },
  '001100': {
    no: 54,
    name: '上震下兑 雷泽归妹（归妹卦）立家兴业',
    qian: '下下卦',
    original: '归妹。征凶，无攸利。',
    meaning: `这个卦是异卦（下兑上震）相叠。震为动、为长男；兑为悦、为少女。以少女从长男，产生爱慕之情，有婚姻之动，有嫁女之象，故称归妹。

大象：震长男在上，兑少女在下，女必归从，归即是出嫁，但少女配长男，非正常组合。

运势：处事有违常理正道，先得其益，但随后祸事百端。祸出百端，事物有违常理。初时有悦，不久反凶，祸害随至。

事业：正在进入新的阶段，很快将会出现另一番景象。这时首先必须具备远大眼光，识破利弊和吉凶，有备始能无患。其次是坚守纯正的品德和正确的原则。

经商：开拓新的市场即将成功，在未来的商业活动中必须注意经营的方向和种类，加强与他人合作。

求名：务必以坚定的决心，努力提高自己，为成名立业奠定基础，最可怕是儿女情长影响了自己的前途和事业。

婚恋：顺其自然，不可违背原则，尤其不可强求，宁可晚婚也要选择理想的对象。夫妻经过生活考验，可和谐到老。

决策：对于人生必须坚持公正纯洁的品德，正确对待婚姻和家庭，以幸福美满的家庭为基础，开拓和发展自己的事业。

时运：进不以道，难以持久。

财运：货价尚可，结局未必。

家宅：已婚不宜居母家；勿眈情欲。

身体：大限将至。

家运：外观风光幸福，其实家内正起风波，有失和、祸害等不幸情况。

疾病：病危重，极易恶化，为中风、肝病、气管及性病等。

胎孕：无碍。秋占不利。

子女：儿女有沉于情欲之中者。

周转：希望渺小。

买卖：表面上不错，其实亏了老本。

等人：不会来。

寻人：在东方或西方。

失物：失物虽有被归还的可能，但自身仍有损失。

外出：十分顺利，即便发生意外也会有人相助。

考试：有重新再读一年之况。

诉讼：事牵连于女性，宜力求和解，但我方必有损失。

求事：放弃算了，再另做打算。

改行：不宜。

开业：开业者宜暂停，静候时机。`,
    description: `这个卦是异卦（下兑上震）相叠。震为动、为长男；兑为悦、为少女。以少女从长男，产生爱慕之情，有婚姻之动，有嫁女之象，故称归妹。男婚女嫁，天地大义，人的开始和终结。上卦与渐卦为综卦，交互为用。
    征凶。象征着归宿和结合。需要谨慎选择，避免冒进。`,
    pinyin: 'guī mèi'
  },
  '101001': {
    no: 55,
    name: '上离下震 雷火丰（丰卦）日中则斜',
    qian: '上上卦',
    original: '丰。亨。王假之，勿忧，宜日中。',
    meaning: `这个卦是异卦（下离上震）相叠，电闪雷鸣，成就巨大，喻达到顶峰，如日中天。告戒：务必注意事物向相反方面发展，盛衰无常，不可不警惕。

大象：雷电交加，声势壮大，又离日动于天际，普照大地，皆为盛大之象。

运势：运势极强，为收获之时，但不宜贪得无厌，须知足常乐，要防是非、损财甚至火险。运势极强，为收获之时，但不宜贪得无厌，须知足常乐，要防是非，损财甚至火险。

事业：处于十分顺利的鼎盛时期，各方面都很顺利，成就很大。但务必注意开始出现的衰败症状，防微杜渐，严防骄傲自满。同时，不必盲目追求不切实际的事情，全力保持当前状况的延长。

经商：由于准确地把握了市场动态，商情对自己十分有利，可以大胆发展，但一定要密切注意行情，分析信息，稍有不慎，破产可能在一夜间。一旦破产应立即总结教训寻求真诚的合作者，早日走出困境。

求名：经过努力和奋斗，已获得成就，应注意保持和稳步发展，切勿追求虚名。

婚恋：可以成功，也会美满幸福，但若一方自持条件变化而动摇，则会导致不利。

决策：由于个人天资聪颖，条件好，因此各方面十分顺利。但务必深刻认识人生无常的真理，一切应保持适度，切记物极必反。更不应自我封闭，陷入困境，切莫灰心。

时运：气势正旺，谨慎小心。

财运：获利甚丰，须防诉讼。

家宅：宜向东南；天作之合。

身体：肝火上升，静养为宜。

家运：繁华幸福，但为人处事宜守分寸为要。

疾病：病况重，注意肝足疾及血压，心脏等疾。

胎孕：无碍。

子女：对子女宜多加教养，免招不幸。

周转：耐心应对，则可在短时间内达成。利在寅午未申日。

买卖：正直经营可获利。贪则有失。

等人：会来。亦会因故而很快离去。

寻人：此人会自觉不安而自己回来。

失物：尽快找寻，可失而复得。

外出：十分顺利。但应提高警惕，防止乐极生悲。

考试：及格有望。

诉讼：自己虽势如破竹，胜券在握，但也应提高警惕。

求事：有利。

改行：改行不可三心二意。

开业：开业者吉利。`,
    description: `这个卦是异卦（下离上震）相叠，电闪雷鸣，成就巨大，喻达到顶峰，如日中天。告诫；务必注意事物向相反方面发展。治乱相因，盛衰无常，不可不警惕。
    亨。象征着丰盛和繁荣。当前形势大好，但需谨防骄傲。`,
    pinyin: 'fēng'
  },
  '001101': {
    no: 56,
    name: '上离下艮 火山旅（旅卦）依义顺时',
    qian: '下下卦',
    meaning: '飞鸟树上垒窝巢，小人使计举火烧，君占此卦为不吉，一切谋望枉徒劳。',
    description: `这个卦是异卦（下艮上离）相叠。此卦与丰卦相反，互为“综卦”。山中燃火，烧而不止，火势不停地向前蔓延，如同途中行人，急于赶路。因而称旅卦。
    小亨。象征着旅行和变动。行事谨慎，注意安全。`,
    pinyin: 'lǚ'
  },
  '110110': {
    no: 57,
    name: '上巽下巽 巽为风（巽卦）谦逊受益',
    qian: '中上卦',
    meaning: '一叶孤舟落沙滩，有篙无水进退难，时逢大雨江湖溢，不用费力任往返。',
    description: `这个卦是同卦（下巽上巽）相叠，巽（xùn）为风，两风相重，长风不绝，无孔不入，巽义为顺。谦逊的态度和行为可无往不利。
    小亨。象征着顺从和入巽。顺应形势，循序渐进。`,
    pinyin: 'xùn'
  },
  '011011': {
    no: 58,
    name: '上兑下兑 兑为泽（兑卦）刚内柔外',
    qian: '上上卦',
    meaning: '这个卦象真可取，觉着做事不费力，休要错过这机关，事事觉得随心意。',
    description: `这个卦是同卦（下泽上泽）相叠。泽为水。两泽相连，两水交流，上下相和，团结一致，朋友相助，欢欣喜悦。兑为悦也。同秉刚健之德，外抱柔和之姿，坚行正道，导民向上。
    亨利贞。象征着喜悦和愉快。保持愉快心情，但不可过度。`,
    pinyin: 'duì'
  },
  '010110': {
    no: 59,
    name: '上坎下兑 风水涣（涣卦）拯救涣散',
    qian: '下下卦',
    meaning: '隔河望见一锭金，欲取岸宽水又深，指望资财难到手，昼思夜想枉费心。',
    description: `这个卦是异卦（下坎上巽）相叠。风在水上行，推波助澜，四方流溢。涣，水流流散之意。象征组织和人心涣散，必用积极的手段和方法克服，战胜弊端，挽救涣散，转危为安。
    亨。象征着分散和涣散。需要整顿，重新集中。`,
    pinyin: 'huàn'
  },
  '011010': {
    no: 60,
    name: '上兑下坎 水泽节（节卦）万物有节',
    qian: '上上卦',
    meaning: '时来运转喜气生，登台封神姜太公，到此诸神皆退位，纵然有祸不成凶。',
    description: `这个卦是异卦（下兑上坎）相叠。兑为泽；坎为水。泽有水而流有限，多必溢于泽外。因此要有节度，故称节。节卦与涣卦相反，互为综卦，交相使用。天地有节度才能常新，国家有节度才能安稳，个人有节度才能完美。
    亨。象征着节制和规范。凡事要有节制，但不可过分拘束。`,
    pinyin: 'jié'
  },
  '110011': {
    no: 61,
    name: '上巽下兑 风泽中孚（中孚卦）诚信立身',
    qian: '下下卦',
    meaning: '路上行人色匆匆，急忙无桥过薄冰，小心谨慎过得去，一步错了落水中。',
    description: `这个卦是异卦（下兑上巽）相叠。孚（fú）本义孵，孵卵出壳的日期非常准确，有信的意义。卦形外实内虚，喻心中诚信，所以称中孚卦。这是立身处世的根本。
    豚鱼吉。象征着诚信和信任。以诚待人，守信为本。`,
    pinyin: 'zhōng fú'
  },
  '001011': {
    no: 62,
    name: '上震下艮 雷山小过（小过卦）行动有度',
    qian: '中上卦',
    meaning: '行人路过独木桥，心内惶恐眼里瞧，爽利保你过得去，慢行一定不安牢。',
    description: `这个卦是异卦（下艮上震）相叠。艮为山；震为雷。过山雷鸣，不可不畏惧。阳为大，阴为小，卦外四阴超过中二阳，故称“小过”，小有越过。
    亨。象征着小有成就。虽小有成就，但不可自满。`,
    pinyin: 'xiǎo guò'
  },
  '010101': {
    no: 63,
    name: '上离下坎 水火既济（既济卦）盛极将衰',
    qian: '中上卦',
    meaning: '金榜以上题姓名，不负当年苦用功，人逢此卦名吉庆，一切谋望大亨通。',
    description: `这个卦是异卦（下离上坎）相叠。坎为水；离为火。水火相交，水在火上，水势压倒火势，救火大功告成。既，已经；济，成也。既济就是事情已经成功，但终将发生变故。
    亨小。象征着成功和完成。事情已成，但仍需谨慎。`,
    pinyin: 'jì jì'
  },
  '101010': {
    no: 64,
    name: '上离下坎 火水未济（未济卦）事业未竟',
    qian: '中下卦',
    meaning: '离地着人几丈深，是防偷营劫寨人，后封太岁为凶煞，时加谨慎祸不侵。',
    description: `这个卦是异卦（下坎上离）相叠。离为火；坎为水。火上水下，火势压倒水势，救火大功未成，故称未济。《周易》以乾坤二卦为始，以既济、未济二卦为终，充分反映了变化发展的思想。
    亨。象征着未完成。事情未成，需要继续努力。`,
    pinyin: 'wèi jì'
  }
} 
